
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Spring Framework Exceptions
id: ae48ab93-45f7-4051-9dfe-5d30a3f78e33
status: stable
description: Detects suspicious Spring framework exceptions that could indicate exploitation
    attempts
author: Thomas Patzke
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/08/06 13:28:31
references:
  - https://docs.spring.io/spring-security/site/docs/current/api/overview-tree.html
logsource:
    category: application
    product: spring
detection:
    condition: keywords
    keywords:
      - AccessDeniedException
      - CsrfException
      - InvalidCsrfTokenException
      - MissingCsrfTokenException
      - CookieTheftException
      - InvalidCookieException
      - RequestRejectedException
falsepositives: Application bugs
level: medium
customer: 'demo'
modified: 2020/09/01
tags:
  - attack.initial_access
  - attack.t1190
  - DEMO
