title: Suspicious Compressed Files
id: 9f1099ba-9c4d-4f84-97d5-7f7a11c0bf92
status: test
description: Detects compressed files containing suspicious content such as ".iso" and ".lnk" files
author: Nasreddine Bencherchali
references:
    - Internal Research
date: 2022/06/23
modified: 2023/03/29
tags:
    - attack.execution
logsource:
    category: file_event
    product: windows
detection:
    selection_path:
        - TargetFilename|contains:
            - '\AppData\Local\Temp\Rar$' # For files opened with WinRAR
            - '\AppData\Local\Temp\7z' # For files opened with 7Zip
            - '\AppData\Local\Temp\wz' # For files opened with WinZip
            - '\AppData\Local\Temp\peazip-tmp' # For files opened with PeaZip
            - '\AppData\Local\Temp\Temp1_' # For files opened with default explorer decompression function. The folder structure should be something like "\Temp1_[filename.zip]\"
        - TargetFilename|startswith:
            - 'C:\Windows\TEMP\Rar$'
            - 'C:\Windows\TEMP\7z'
            - 'C:\Windows\TEMP\wz'
            - 'C:\Windows\TEMP\peazip-tmp'
    selection_ext:
        TargetFilename|endswith:
            - '.lnk'
            - '.iso'
            - '.vbe'
            - '.hta'
    condition: all of selection_*
falsepositives:
    - Legitimate compressed files with benign content
level: high
