
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Appended Extension
id: e3f673b3-65d1-4d80-9146-466f8b63fa99
status: test
description: Detects file renames where the target filename uses an uncommon double
    extension. Could indicate potential ransomware activity renaming files and adding
    a custom extension to the encrypted files, such as ".jpg.crypted", ".docx.locky",
    etc.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/16 14:03:31
references:
  - https://app.any.run/tasks/d66ead5a-faf4-4437-93aa-65785afaf9e5/
  - https://blog.cyble.com/2022/08/10/onyx-ransomware-renames-its-leak-site-to-vsop/
logsource:
    category: file_rename
    product: windows
    definition: 'Requirements: Microsoft-Windows-Kernel-File Provider with at least
        the KERNEL_FILE_KEYWORD_RENAME_SETLINK_PATH keyword'
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_generic:
        TargetFilename|endswith:
          - .backup
          - .bak
          - .old
          - .orig
          - .temp
          - .tmp
    filter_optional_anaconda:
        TargetFilename|contains: :\ProgramData\Anaconda3\
        TargetFilename|endswith: .c~
    selection:
        SourceFilename|endswith:
          - .doc
          - .docx
          - .jpeg
          - .jpg
          - .lnk
          - .pdf
          - .png
          - .pst
          - .rtf
          - .xls
          - .xlsx
        TargetFilename|contains:
          - .doc.
          - .docx.
          - .jpeg.
          - .jpg.
          - .lnk.
          - .pdf.
          - .png.
          - .pst.
          - .rtf.
          - .xls.
          - .xlsx.
falsepositives: Backup software
level: medium
customer: 'demo'
modified: 2023/11/11
tags:
  - attack.impact
  - attack.t1486
  - DEMO
