
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PwnKit Local Privilege Escalation
id: 0506a799-698b-43b4-85a1-ac4c84c720e9
status: test
description: Detects potential PwnKit exploitation CVE-2021-4034 in auth logs
author: Sreeman
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/26 14:45:41
references:
  - https://twitter.com/wdormann/status/1486161836961579020
logsource:
    product: linux
    service: auth
detection:
    condition: keywords
    keywords:
        '|all':
          - pkexec
          - The value for environment variable XAUTHORITY contains suscipious content
          - '[USER=root] [TTY=/dev/pts/0]'
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/23
tags:
  - attack.privilege_escalation
  - attack.t1548.001
  - DEMO
