
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Failed MSExchange Transport Agent Installation
id: c7d16cae-aaf3-42e5-9c1c-fb8553faa6fa
status: test
description: Detects a failed installation of a Exchange Transport Agent
author: Tobias Michalski (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/06/08 18:14:21
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=8
logsource:
    product: windows
    service: msexchange-management
detection:
    condition: selection
    selection:
        Data|contains: Install-TransportAgent
        EventID: "6"
fields:
  - AssemblyPath
falsepositives: Legitimate installations of exchange TransportAgents. AssemblyPath
    is a good indicator for this.
level: high
customer: 'demo'
modified: 2022/07/12
tags:
  - attack.persistence
  - attack.t1505.002
  - DEMO
