
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Mailbox Export to Exchange Webserver
id: 516376b4-05cd-4122-bae0-ad7641c38d48
status: test
description: Detects a successful export of an Exchange mailbox to untypical directory
    or with aspx name suffix which can be used to place a webshell or the needed role
    assignment for it
author: Florian Roth (Nextron Systems), Rich Warren, Christian Burkard (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/09 15:37:31
references:
  - https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html
logsource:
    product: windows
    service: msexchange-management
detection:
    condition: (export_command and export_params) or role_assignment
    export_command:
        '|all':
          - New-MailboxExportRequest
          - ' -Mailbox '
    export_params:
      - -FilePath "\\\\
      - .aspx
    role_assignment:
        '|all':
          - New-ManagementRoleAssignment
          - ' -Role "Mailbox Import Export"'
          - ' -User '
falsepositives: Unlikely
level: critical
customer: 'demo'
modified: 2023/04/30
tags:
  - attack.persistence
  - attack.t1505.003
  - DEMO
