
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Certificate Request Export to Exchange Webserver
id: b7bc7038-638b-4ffd-880c-292c692209ef
status: test
description: Detects a write of an Exchange CSR to an untypical directory or with
    aspx name suffix which can be used to place a webshell
author: Max Altgelt (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/23 18:54:51
references:
  - https://twitter.com/GossiTheDog/status/1429175908905127938
logsource:
    product: windows
    service: msexchange-management
detection:
    condition: keywords_export_command and keywords_export_params
    keywords_export_command:
        '|all':
          - New-ExchangeCertificate
          - ' -GenerateRequest'
          - ' -BinaryEncoded'
          - ' -RequestFile'
    keywords_export_params:
      - \\\\localhost\\C$
      - \\\\127.0.0.1\\C$
      - C:\\inetpub
      - .aspx
falsepositives: Unlikely
level: critical
customer: 'demo'
modified: 2023/01/23
tags:
  - attack.persistence
  - attack.t1505.003
  - DEMO
