
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Access To Windows Credential History File By Uncommon Application
id: 7a2a22ea-a203-4cd3-9abf-20eb1c5c6cd2
status: experimental
description: |
    Detects file access requests to the Windows Credential History File by an uncommon application.
    This can be a sign of credential stealing. Example case would be usage of mimikatz "dpapi::credhist" function
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/17 23:00:01
references:
  - https://tools.thehacker.recipes/mimikatz/modules/dpapi/credhist
  - https://www.passcape.com/windows_password_recovery_dpapi_credhist
logsource:
    category: file_access
    product: windows
    definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_explorer:
        Image|endswith: :\Windows\explorer.exe
    filter_main_system_folders:
        Image|contains:
          - :\Program Files\
          - :\Program Files (x86)\
          - :\Windows\system32\
          - :\Windows\SysWOW64\
    selection:
        FileName|endswith: \Microsoft\Protect\CREDHIST
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/12/18
tags:
  - attack.credential_access
  - attack.t1555.004
  - DEMO
