
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Credential Manager Access By Uncommon Application
id: 407aecb1-e762-4acf-8c7b-d087bcff3bb6
status: experimental
description: |
    Detects suspicious processes based on name and location that access the windows credential manager and vault.
    Which can be a sign of credential stealing. Example case would be usage of mimikatz "dpapi::cred" function
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/11 18:53:51
references:
  - https://hunter2.gitbook.io/darthsidious/privilege-escalation/mimikatz
  - https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
logsource:
    category: file_access
    product: windows
    definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
    condition: selection and not 1 of filter_*
    filter_system_folders:
        Image|contains:
          - :\Program Files\
          - :\Program Files (x86)\
          - :\Windows\system32\
          - :\Windows\SysWOW64\
    selection:
        FileName|contains:
          - \AppData\Local\Microsoft\Credentials\
          - \AppData\Roaming\Microsoft\Credentials\
          - \AppData\Local\Microsoft\Vault\
          - \ProgramData\Microsoft\Vault\
falsepositives: Legitimate software installed by the users for example in the "AppData"
    directory may access these files (for any reason).
level: medium
customer: 'demo'
modified: 2023/12/18
tags:
  - attack.t1003
  - attack.credential_access
  - DEMO
