
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Suspicious PowerShell Keywords
id: 1f49f2ab-26bc-48b3-96cc-dcffbc93eadf
status: test
description: Detects potentially suspicious keywords that could indicate the use of
    a PowerShell exploitation framework
author: Florian Roth (Nextron Systems), Perez Diego (@darkquassar), Tuan Le (NCSGroup)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/02/11 17:07:21
references:
  - https://posts.specterops.io/entering-a-covenant-net-command-and-control-e11038bcf462
  - https://github.com/PowerShellMafia/PowerSploit/blob/d943001a7defb5e0d1657085a77a0e78609be58f/CodeExecution/Invoke-ReflectivePEInjection.ps1
  - https://github.com/hlldz/Phant0m/blob/30c2935d8cf4aafda17ee2fab7cd0c4aa9a607c2/old/Invoke-Phant0m.ps1
  - https://gist.github.com/MHaggis/0dbe00ad401daa7137c81c99c268cfb7
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: selection
    selection:
        ScriptBlockText|contains:
          - System.Reflection.Assembly.Load($
          - '[System.Reflection.Assembly]::Load($'
          - '[Reflection.Assembly]::Load($'
          - System.Reflection.AssemblyName
          - Reflection.Emit.AssemblyBuilderAccess
          - Reflection.Emit.CustomAttributeBuilder
          - Runtime.InteropServices.UnmanagedType
          - Runtime.InteropServices.DllImportAttribute
          - SuspendThread
          - rundll32
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/04/21
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
