
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Powershell Create Scheduled Task
id: 363eccc0-279a-4ccf-a3ab-24c2e63b11fb
status: test
description: Adversaries may abuse the Windows Task Scheduler to perform task scheduling
    for initial or recurring execution of malicious code
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/28 14:31:31
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.005/T1053.005.md#atomic-test-4---powershell-cmdlet-scheduled-task
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.005/T1053.005.md#atomic-test-6---wmi-invoke-cimmethod-scheduled-task
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: 1 of selection_*
    selection_cimmethod:
        ScriptBlockText|contains|all:
          - Invoke-CimMethod
          - -ClassName
          - PS_ScheduledTask
          - -NameSpace
          - Root\Microsoft\Windows\TaskScheduler
    selection_cmdlet:
        ScriptBlockText|contains:
          - New-ScheduledTaskAction
          - New-ScheduledTaskTrigger
          - New-ScheduledTaskPrincipal
          - New-ScheduledTaskSettingsSet
          - New-ScheduledTask
          - Register-ScheduledTask
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.persistence
  - attack.t1053.005
  - DEMO
