
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential POWERTRASH Script Execution
id: 4e19528a-f081-40dd-be09-90c39352bd64
status: test
description: Detects potential execution of the PowerShell script POWERTRASH
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/04 15:26:41
references:
  - https://labs.withsecure.com/publications/fin7-target-veeam-servers
logsource:
    category: ps_script
    product: windows
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    condition: selection
    selection:
        ScriptBlockText|contains|all:
          - IO.Compression.DeflateStream
          - IO.MemoryStream
          - ::FromBase64String
          - GetDelegateForFunctionPointer
          - .Invoke()
          - GlobalAssemblyCache
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.execution
  - attack.t1059.001
  - attack.g0046
  - detection.emerging_threats
  - DEMO
