
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential In-Memory Execution Using Reflection.Assembly
id: ddcd88cb-7f62-4ce5-86f9-1704190feb0a
status: test
description: Detects usage of "Reflection.Assembly" load functions to dynamically
    load assemblies in memory
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/25 20:45:21
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=50
logsource:
    category: ps_script
    product: windows
    definition: Script Block Logging must be enable
detection:
    condition: selection
    selection:
        ScriptBlockText|contains: '[Reflection.Assembly]::load'
falsepositives: Legitimate use of the library
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1620
  - DEMO
