
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Troubleshooting Pack Cmdlet Execution
id: 03409c93-a7c7-49ba-9a4c-a00badf2a153
status: test
description: Detects execution of "TroubleshootingPack" cmdlets to leverage CVE-2022-30190
    or action similar to "msdt" lolbin (as described in LOLBAS)
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/21 16:06:01
references:
  - https://twitter.com/nas_bench/status/1537919885031772161
  - https://lolbas-project.github.io/lolbas/Binaries/Msdt/
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: selection
    selection:
        ScriptBlockText|contains|all:
          - Invoke-TroubleshootingPack
          - C:\Windows\Diagnostics\System\PCW
          - -AnswerFile
          - -Unattended
falsepositives: Legitimate usage of "TroubleshootingPack" cmdlet for troubleshooting
    purposes
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
