
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Powershell Sensitive File Discovery
id: 7d416556-6502-45b2-9bad-9d2f05f38997
related:
  - type: derived
    id: d23f2ba5-9da0-4463-8908-8ee47f614bb9
status: test
description: Detect adversaries enumerate sensitive files
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/16 15:34:31
references:
  - https://twitter.com/malmoeb/status/1570814999370801158
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: all of selection_*
    selection_action:
        ScriptBlockText|contains:
          - ls
          - get-childitem
          - gci
    selection_file:
        ScriptBlockText|contains:
          - .pass
          - .kdbx
          - .kdb
    selection_recurse:
        ScriptBlockText|contains: -recurse
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.discovery
  - attack.t1083
  - DEMO
