
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious FromBase64String Usage On Gzip Archive - Ps Script
id: df69cb1d-b891-4cd9-90c7-d617d90100ce
related:
  - type: similar
    id: d75d6b6b-adb9-48f7-824b-ac2e786efe1f
status: test
description: Detects attempts of decoding a base64 Gzip archive in a PowerShell script.
    This technique is often used as a method to load malicious content into memory
    afterward.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/23 21:21:41
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=43
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: selection
    selection:
        ScriptBlockText|contains|all:
          - FromBase64String
          - MemoryStream
          - H4sI
falsepositives: Legitimate administrative script
level: medium
customer: 'demo'
tags:
  - attack.command_and_control
  - attack.t1132.001
  - DEMO
