
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Persistence Via PowerShell User Profile Using Add-Content
id: 05b3e303-faf0-4f4a-9b30-46cc13e69152
status: test
description: Detects calls to "Add-Content" cmdlet in order to modify the content
    of the user profile and potentially adding suspicious commands for persistence
author: frack113, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/18 23:36:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.013/T1546.013.md
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: all of selection_*
    selection_add:
        ScriptBlockText|contains: Add-Content $profile
    selection_options:
        ScriptBlockText|contains:
          - '-Value "IEX '
          - -Value "Invoke-Expression
          - -Value "Invoke-WebRequest
          - -Value "Start-Process
          - '-Value ''IEX '
          - -Value 'Invoke-Expression
          - -Value 'Invoke-WebRequest
          - -Value 'Start-Process
falsepositives: Legitimate administration and tuning scripts that aim to add functionality
    to a user PowerShell session
level: medium
customer: 'demo'
modified: 2023/05/04
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1546.013
  - DEMO
