
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Security Software Discovery Via Powershell Script
id: 904e8e61-8edf-4350-b59c-b905fc8e810c
status: experimental
description: |
    Detects calls to "get-process" where the output is piped to a "where-object" filter to search for security solution processes.
    Adversaries may attempt to get a listing of security software, configurations, defensive tools, and sensors that are installed on a system or in a cloud environment. This may include things such as firewall rules and anti-virus
author: frack113, Anish Bogati, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/16 19:18:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518.001/T1518.001.md#atomic-test-2---security-software-discovery---powershell
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: all of selection_*
    selection_cmdlet:
        ScriptBlockText|contains:
          - get-process | \?
          - get-process | where
          - gps | \?
          - gps | where
    selection_field:
        ScriptBlockText|contains:
          - Company -like
          - Description -like
          - Name -like
          - Path -like
          - Product -like
    selection_keywords:
        ScriptBlockText|contains:
          - \*avira\*
          - \*carbonblack\*
          - \*cylance\*
          - \*defender\*
          - \*kaspersky\*
          - \*malware\*
          - \*sentinel\*
          - \*symantec\*
          - \*virus\*
falsepositives:
  - False positives might occur due to the nature of the ScriptBlock being ingested
    as a big blob. Initial tuning is required.
  - As the "selection_cmdlet" is common in scripts the matching engine might slow
    down the search. Change into regex or a more accurate string to avoid heavy resource
    consumption if experienced
level: medium
customer: 'demo'
modified: 2023/10/24
tags:
  - attack.discovery
  - attack.t1518.001
  - DEMO
