
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Access to Browser Login Data
id: fc028194-969d-4122-8abe-0470d5b8f12f
related:
  - type: obsoletes
    id: 98f4c75c-3089-44f3-b733-b327b9cd9c9d
  - type: similar
    id: 47147b5b-9e17-4d76-b8d2-7bac24c5ce1b
status: test
description: |
    Adversaries may acquire credentials from web browsers by reading files specific to the target browser.
    Web browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future.
    Web browsers typically store the credentials in an encrypted format within a credential store.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/30 13:08:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.003/T1555.003.md
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: all of selection_*
    selection_cmd:
        ScriptBlockText|contains|all:
          - Copy-Item
          - -Destination
    selection_path:
        ScriptBlockText|contains:
          - \Opera Software\Opera Stable\Login Data
          - \Mozilla\Firefox\Profiles
          - \Microsoft\Edge\User Data\Default
          - \Google\Chrome\User Data\Default\Login Data
          - \Google\Chrome\User Data\Default\Login Data For Account
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1555.003
  - DEMO
