
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: LPE InstallerFileTakeOver PoC CVE-2021-41379
id: 7dbb86de-a0cc-494c-8aa8-b2996c9ef3c8
status: test
description: Detects PoC tool used to exploit LPE vulnerability CVE-2021-41379
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/11/22 15:39:51
references:
  - https://github.com/klinix5/InstallerFileTakeOver
logsource:
    product: windows
    service: application
detection:
    condition: selection
    selection:
        Data|contains: test pkg
        EventID: "1033"
        Provider_Name: MsiInstaller
falsepositives: Other MSI packages for which your admins have used that name
level: high
customer: 'demo'
modified: 2022/07/12
tags:
  - attack.initial_access
  - attack.t1190
  - detection.emerging_threats
  - DEMO
