
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: MSSQL Server Failed Logon From External Network
id: ebfe73c2-5bc9-4ed9-aaa8-8b54b2b4777d
related:
  - type: similar
    id: 218d2855-2bba-4f61-9c85-81d0ea63ac71
status: experimental
description: Detects failed logon attempts from clients with external network IP to
    an MSSQL server. This can be a sign of a bruteforce attack.
author: j4son
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/11 17:56:41
references:
  - https://cybersecthreat.com/2020/07/08/enable-mssql-authentication-log-to-eventlog/
  - https://www.experts-exchange.com/questions/27800944/EventID-18456-Failed-to-open-the-explicitly-specified-database.html
logsource:
    product: windows
    service: application
    definition: 'Requirements: Must enable MSSQL authentication.'
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_local_ips:
        Data|contains:
          - 'CLIENT: 10.'
          - 'CLIENT: 172.16.'
          - 'CLIENT: 172.17.'
          - 'CLIENT: 172.18.'
          - 'CLIENT: 172.19.'
          - 'CLIENT: 172.20.'
          - 'CLIENT: 172.21.'
          - 'CLIENT: 172.22.'
          - 'CLIENT: 172.23.'
          - 'CLIENT: 172.24.'
          - 'CLIENT: 172.25.'
          - 'CLIENT: 172.26.'
          - 'CLIENT: 172.27.'
          - 'CLIENT: 172.28.'
          - 'CLIENT: 172.29.'
          - 'CLIENT: 172.30.'
          - 'CLIENT: 172.31.'
          - 'CLIENT: 192.168.'
          - 'CLIENT: 127.'
          - 'CLIENT: 169.254.'
    selection:
        EventID: "18456"
        Provider_Name: MSSQLSERVER
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1110
  - DEMO
