
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: UAC Bypass Using NTFS Reparse Point - Process
id: 39ed3c80-e6a1-431b-9df3-911ac53d08a7
status: test
description: Detects the pattern of UAC Bypass using NTFS reparse point and wusa.exe
    DLL hijacking (UACMe 36)
author: Christian Burkard (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/30 16:54:01
references:
  - https://github.com/hfiref0x/UACME
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection*
    selection1:
        CommandLine|endswith: \AppData\Local\Temp\update.msu
        CommandLine|startswith: '"C:\Windows\system32\wusa.exe"  /quiet C:\Users\'
        IntegrityLevel:
          - High
          - System
    selection2:
        CommandLine|contains|all:
          - C:\Users\
          - \AppData\Local\Temp\
          - \dismhost.exe {
        Image|endswith: \DismHost.exe
        IntegrityLevel:
          - High
          - System
        ParentCommandLine: '"C:\Windows\system32\dism.exe" /online /quiet /norestart
            /add-package /packagepath:"C:\Windows\system32\pe386" /ignorecheck'
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1548.002
  - DEMO
