
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - Jlaive In-Memory Assembly Execution
id: 0a99eb3e-1617-41bd-b095-13dc767f3def
status: test
description: Detects the use of Jlaive to execute assemblies in a copied PowerShell
author: Jose Luis Sanchez Martinez (@Joseliyo_Jstnk)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/05/24 17:46:21
references:
  - https://jstnk9.github.io/jstnk9/research/Jlaive-Antivirus-Evasion-Tool
  - https://web.archive.org/web/20220514073704/https://github.com/ch2sh/Jlaive
logsource:
    category: process_creation
    product: windows
detection:
    condition: parent_selection and (1 of selection*)
    parent_selection:
        ParentCommandLine|endswith: .bat
        ParentImage|endswith: \cmd.exe
    selection1:
        CommandLine|contains|all:
          - powershell.exe
          - .bat.exe
        Image|endswith: \xcopy.exe
    selection2:
        CommandLine|contains|all:
          - pwsh.exe
          - .bat.exe
        Image|endswith: \xcopy.exe
    selection3:
        CommandLine|contains|all:
          - +s
          - +h
          - .bat.exe
        Image|endswith: \attrib.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/02/22
tags:
  - attack.execution
  - attack.t1059.003
  - DEMO
