
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Node Process Executions
id: df1f26d3-bea7-4700-9ea2-ad3e990cf90e
status: test
description: Detects the execution of other scripts using the Node executable packaged
    with Adobe Creative Cloud
author: Max Altgelt (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/06 12:15:21
references:
  - https://twitter.com/mttaggart/status/1511804863293784064
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter
    filter:
        CommandLine|contains: Adobe Creative Cloud Experience\js
    selection:
        Image|endswith: \Adobe Creative Cloud Experience\libs\node.exe
fields:
  - Image
  - CommandLine
  - ParentCommandLine
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1127
  - attack.t1059.007
  - DEMO
