
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Script Event Consumer Spawning Process
id: f6d1dd2f-b8ce-40ca-bc23-062efb686b34
status: test
description: Detects a suspicious child process of Script Event Consumer (scrcons.exe).
author: Sittikorn S
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/06/21 16:14:51
references:
  - https://redcanary.com/blog/child-processes/
  - https://docs.paloaltonetworks.com/cortex/cortex-xdr/cortex-xdr-analytics-alert-reference/cortex-xdr-analytics-alert-reference/scrcons-exe-rare-child-process.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - \svchost.exe
          - \dllhost.exe
          - \powershell.exe
          - \pwsh.exe
          - \wscript.exe
          - \cscript.exe
          - \schtasks.exe
          - \regsvr32.exe
          - \mshta.exe
          - \rundll32.exe
          - \msiexec.exe
          - \msbuild.exe
        ParentImage|endswith: \scrcons.exe
fields:
  - CommandLine
  - ParentCommandLine
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/07/14
tags:
  - attack.execution
  - attack.t1047
  - DEMO
