
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - Stracciatella Execution
id: 7a4d9232-92fc-404d-8ce1-4c92e7caf539
status: test
description: Detects Stracciatella which executes a Powershell runspace from within
    C# (aka SharpPick technique) with AMSI, ETW and Script Block Logging disabled
    based on PE metadata characteristics.
author: pH-T (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/17 14:56:21
references:
  - https://github.com/mgeeky/Stracciatella
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - Image|endswith: \Stracciatella.exe
      - OriginalFileName: Stracciatella.exe
      - Description: Stracciatella
      - Hashes|contains:
          - SHA256=9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956
          - SHA256=fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a
      - sha256:
          - 9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956
          - fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1059
  - attack.t1562.001
  - DEMO
