
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Arbitrary File Download Via GfxDownloadWrapper.EXE
id: eee00933-a761-4cd0-be70-c42fe91731e7
status: test
description: Detects execution of GfxDownloadWrapper.exe with a URL as an argument
    to download file.
author: Victor Sergeev, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/09 19:02:21
references:
  - https://lolbas-project.github.io/lolbas/HonorableMentions/GfxDownloadWrapper/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_known_urls:
        CommandLine|contains: https://gameplayapi.intel.com/
    selection:
        CommandLine|contains:
          - http://
          - https://
        Image|endswith: \GfxDownloadWrapper.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/10/18
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
