
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Usage Of Web Request Commands And Cmdlets
id: 9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d
related:
  - type: similar
    id: 1139d2e2-84b1-4226-b445-354492eba8ba
  - type: obsoletes
    id: f67dbfce-93bc-440d-86ad-a95ae8858c90
  - type: obsoletes
    id: cd5c8085-4070-4e22-908d-a5b3342deb74
status: test
description: Detects the use of various web request commands with commandline tools
    and Windows PowerShell cmdlets (including aliases) via CommandLine
author: James Pemberton / @4A616D6573, Endgame, JHasenbusch, oscd.community, Austin
    Songer @austinsonger
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/24 16:19:01
references:
  - https://4sysops.com/archives/use-powershell-to-download-a-file-with-http-https-and-ftp/
  - https://blog.jourdant.me/post/3-ways-to-download-files-with-powershell
  - https://docs.microsoft.com/en-us/powershell/module/bitstransfer/add-bitsfile?view=windowsserver2019-ps
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - '[System.Net.WebRequest]::create'
          - 'curl '
          - Invoke-RestMethod
          - Invoke-WebRequest
          - 'iwr '
          - Net.WebClient
          - Resume-BitsTransfer
          - Start-BitsTransfer
          - 'wget '
          - WinHttp.WinHttpRequest
falsepositives: Use of Get-Command and Get-Help modules to reference Invoke-WebRequest
    and Start-BitsTransfer.
level: medium
customer: 'demo'
modified: 2023/01/10
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
