
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious Child Process Of Regsvr32
id: 6f0947a4-1c5e-4e0d-8ac7-53159b8f23ca
related:
  - type: obsoletes
    id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
status: experimental
description: Detects potentially suspicious child processes of "regsvr32.exe".
author: elhoim, Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/05/05 18:37:41
references:
  - https://redcanary.com/blog/intelligence-insights-april-2022/
  - https://www.echotrail.io/insights/search/regsvr32.exe
  - https://www.ired.team/offensive-security/code-execution/t1117-regsvr32-aka-squiblydoo
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_werfault:
        CommandLine|contains: ' -u -p '
        Image|endswith: \werfault.exe
    selection:
        Image|endswith:
          - \calc.exe
          - \cscript.exe
          - \explorer.exe
          - \mshta.exe
          - \net.exe
          - \net1.exe
          - \nltest.exe
          - \notepad.exe
          - \powershell.exe
          - \pwsh.exe
          - \reg.exe
          - \schtasks.exe
          - \werfault.exe
          - \wscript.exe
        ParentImage|endswith: \regsvr32.exe
falsepositives: Unlikely, but can rarely occur. Apply additional filters accordingly.
level: high
customer: 'demo'
modified: 2023/05/26
tags:
  - attack.defense_evasion
  - attack.t1218.010
  - DEMO
