
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Rundll32 Execution Without CommandLine Parameters
id: 1775e15e-b61b-4d14-a1a3-80981298085a
status: experimental
description: Detects suspicious start of rundll32.exe without any parameters as found
    in CobaltStrike beacon activity
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/05/27 19:02:51
references:
  - https://www.cobaltstrike.com/help-opsec
  - https://twitter.com/ber_m1ng/status/1397948048135778309
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter
    filter:
        ParentImage|contains:
          - \AppData\Local\
          - \Microsoft\Edge\
    selection:
        CommandLine|endswith:
          - \rundll32.exe
          - \rundll32.exe"
          - \rundll32
falsepositives: Possible but rare
level: high
customer: 'demo'
modified: 2023/08/31
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
