
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PowerShell Script Run in AppData
id: ac175779-025a-4f12-98b0-acdaeb77ea85
status: test
description: Detects a suspicious command line execution that invokes PowerShell with
    reference to an AppData folder
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/01/09 14:16:11
references:
  - https://twitter.com/JohnLaTwC/status/1082851155481288706
  - https://app.any.run/tasks/f87f1c4e-47e2-4c46-9cf4-31454c06ce03
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection1:
        CommandLine|contains:
          - powershell.exe
          - \powershell
          - \pwsh
          - pwsh.exe
    selection2:
        CommandLine|contains:
          - Local\
          - Roaming\
        CommandLine|contains|all:
          - '/c '
          - \AppData\
falsepositives: Administrative scripts
level: medium
customer: 'demo'
modified: 2022/07/14
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
