
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Add Scheduled Task Parent
id: 9494479d-d994-40bf-a8b1-eea890237021
status: test
description: Detects suspicious scheduled task creations from a parent stored in a
    temporary folder
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/23 15:27:41
references:
  - https://app.any.run/tasks/649e7b46-9bec-4d05-98a5-dfa9a13eaae5/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter*
    filter:
        CommandLine|contains:
          - update_task.xml
          - unattended.ini
    selection:
        CommandLine|contains: '/Create '
        Image|endswith: \schtasks.exe
        ParentImage|contains:
          - \AppData\Local\
          - \AppData\Roaming\
          - \Temporary Internet
          - \Users\Public\
falsepositives: Software installers that run from temporary folders and also install
    scheduled tasks
level: medium
customer: 'demo'
modified: 2022/06/02
tags:
  - attack.execution
  - attack.t1053.005
  - DEMO
