
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: File Download with Headless Browser
id: 0e8cfe08-02c9-4815-a2f8-0d157b7ed33e
related:
  - type: derived
    id: ef9dcfed-690c-4c5d-a9d1-482cd422225c
status: test
description: Detects execution of chromium based browser in headless mode using the
    "dump-dom" command line to download files
author: Sreeman, Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/04 15:14:51
references:
  - https://twitter.com/mrd0x/status/1478234484881436672?s=12
  - https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - --headless
          - dump-dom
          - http
        Image|endswith:
          - \brave.exe
          - \chrome.exe
          - \msedge.exe
          - \opera.exe
          - \vivaldi.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/05/12
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
