
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: SQLite Chromium Profile Data DB Access
id: 24c77512-782b-448a-8950-eddb0785fc71
status: test
description: Detect usage of the "sqlite" binary to query databases in Chromium-based
    browsers for potential data stealing.
author: TropChaud
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/19 15:24:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/84d9edaaaa2c5511144521b0e4af726d1c7276ce/atomics/T1539/T1539.md#atomic-test-2---steal-chrome-cookies-windows
  - https://blog.cyble.com/2022/04/21/prynt-stealer-a-new-info-stealer-performing-clipper-and-keylogger-activities/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_chromium:
        CommandLine|contains:
          - \User Data\
          - \Opera Software\
          - \ChromiumViewer\
    selection_data:
        CommandLine|contains:
          - Login Data
          - Cookies
          - Web Data
          - History
          - Bookmarks
    selection_sql:
      - Product: SQLite
      - Image|endswith:
          - \sqlite.exe
          - \sqlite3.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/19
tags:
  - attack.credential_access
  - attack.t1539
  - attack.t1555.003
  - attack.collection
  - attack.t1005
  - DEMO
