
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PUA - Rclone Execution
id: e37db05d-d1f9-49c8-b464-cee1a4b11638
related:
  - type: obsoletes
    id: a0d63692-a531-4912-ad39-4393325b2a9c
  - type: obsoletes
    id: cb7286ba-f207-44ab-b9e6-760d82b84253
status: test
description: Detects execution of RClone utility for exfiltration as used by various
    ransomwares strains like REvil, Conti, FiveHands, etc
author: Bhabesh Raj, Sittikorn S, Aaron Greetham (@beardofbinary) - NCC Group
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/05/10 11:21:41
references:
  - https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
  - https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware
  - https://us-cert.cisa.gov/ncas/analysis-reports/ar21-126a
  - https://labs.sentinelone.com/egregor-raas-continues-the-chaos-with-cobalt-strike-and-rclone
  - https://www.splunk.com/en_us/blog/security/darkside-ransomware-splunk-threat-update-and-detections.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_specific_options or all of selection_rclone_*
    selection_rclone_cli:
        CommandLine|contains:
          - pass
          - user
          - copy
          - sync
          - config
          - lsd
          - remote
          - ls
          - mega
          - pcloud
          - ftp
          - ignore-existing
          - auto-confirm
          - transfers
          - multi-thread-streams
          - 'no-check-certificate '
    selection_rclone_img:
      - Image|endswith: \rclone.exe
      - Description: Rsync for cloud storage
    selection_specific_options:
        CommandLine|contains|all:
          - '--config '
          - '--no-check-certificate '
          - ' copy '
fields:
  - CommandLine
  - ParentCommandLine
  - Details
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/03/05
tags:
  - attack.exfiltration
  - attack.t1567.002
  - DEMO
