
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Automated Collection Command Prompt
id: f576a613-2392-4067-9d1a-9345fb58d8d1
status: test
description: Once established within a system or network, an adversary may use automated
    techniques for collecting internal data.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/07/28 15:28:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1119/T1119.md
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.001/T1552.001.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_ext and 1 of selection_other_*
    selection_ext:
        CommandLine|contains:
          - .doc
          - .docx
          - .xls
          - .xlsx
          - .ppt
          - .pptx
          - .rtf
          - .pdf
          - .txt
    selection_other_dir:
        CommandLine|contains|all:
          - 'dir '
          - ' /b '
          - ' /s '
    selection_other_findstr:
        CommandLine|contains:
          - ' /e '
          - ' /si '
        OriginalFileName: FINDSTR.EXE
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/11/11
tags:
  - attack.collection
  - attack.t1119
  - attack.credential_access
  - attack.t1552.001
  - DEMO
