
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious ScreenSave Change by Reg.exe
id: 0fc35fc3-efe6-4898-8a37-0b233339524f
status: test
description: |
    Adversaries may establish persistence by executing malicious content triggered by user inactivity.
    Screensavers are programs that execute after a configurable time of user inactivity and consist of Portable Executable (PE) files with a .scr file extension
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/19 16:11:31
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md
  - https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_reg and 1 of selection_option_*
    selection_option_1:
        CommandLine|contains|all:
          - /v ScreenSaveActive
          - /t REG_SZ
          - /d 1
          - /f
    selection_option_2:
        CommandLine|contains|all:
          - /v ScreenSaveTimeout
          - /t REG_SZ
          - '/d '
          - /f
    selection_option_3:
        CommandLine|contains|all:
          - /v ScreenSaverIsSecure
          - /t REG_SZ
          - /d 0
          - /f
    selection_option_4:
        CommandLine|contains|all:
          - /v SCRNSAVE.EXE
          - /t REG_SZ
          - '/d '
          - .scr
          - /f
    selection_reg:
        CommandLine|contains:
          - HKEY_CURRENT_USER\Control Panel\Desktop
          - HKCU\Control Panel\Desktop
        Image|endswith: \reg.exe
falsepositives: GPO
level: medium
customer: 'demo'
modified: 2022/06/02
tags:
  - attack.privilege_escalation
  - attack.t1546.002
  - DEMO
