
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Msiexec Execute Arbitrary DLL
id: 6f4191bb-912b-48a8-9ce7-682769541e6d
status: test
description: |
    Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.
    Msiexec.exe is the command-line utility for the Windows Installer and is thus commonly associated with executing installation packages (.msi)
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/16 16:35:21
references:
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
  - https://twitter.com/_st0pp3r_/status/1583914515996897281
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_*
    filter_apple:
        CommandLine|contains:
          - \MsiExec.exe" /Y "C:\Program Files\Bonjour\mdnsNSP.dll
          - \MsiExec.exe" /Y "C:\Program Files (x86)\Bonjour\mdnsNSP.dll
          - \MsiExec.exe" /Y "C:\Program Files (x86)\Apple Software Update\ScriptingObjectModel.dll
          - \MsiExec.exe" /Y "C:\Program Files (x86)\Apple Software Update\SoftwareUpdateAdmin.dll
          - \MsiExec.exe" /Y "C:\Windows\CCM\
          - \MsiExec.exe" /Y C:\Windows\CCM\
          - \MsiExec.exe" -Y "C:\Program Files\Bonjour\mdnsNSP.dll
          - \MsiExec.exe" -Y "C:\Program Files (x86)\Bonjour\mdnsNSP.dll
          - \MsiExec.exe" -Y "C:\Program Files (x86)\Apple Software Update\ScriptingObjectModel.dll
          - \MsiExec.exe" -Y "C:\Program Files (x86)\Apple Software Update\SoftwareUpdateAdmin.dll
          - \MsiExec.exe" -Y "C:\Windows\CCM\
          - \MsiExec.exe" -Y C:\Windows\CCM\
    selection:
        CommandLine|contains|windash: ' -y'
        Image|endswith: \msiexec.exe
falsepositives: Legitimate script
level: medium
customer: 'demo'
modified: 2024/03/13
tags:
  - attack.defense_evasion
  - attack.t1218.007
  - DEMO
