
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Turla Group Commands May 2020
id: 9e2e51c5-c699-4794-ba5a-29f5da40ac0c
status: test
description: Detects commands used by Turla group as reported by ESET in May 2020
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/05/26 12:53:41
references:
  - https://www.welivesecurity.com/wp-content/uploads/2020/05/ESET_Turla_ComRAT.pdf
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_cli_1:
        CommandLine|contains:
          - tracert -h 10 yahoo.com
          - .WSqmCons))|iex;
          - Fr`omBa`se6`4Str`ing
    selection_cli_2:
        CommandLine|contains|all:
          - net use https://docs.live.net
          - '@aol.co.uk'
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.g0010
  - attack.execution
  - attack.t1059.001
  - attack.t1053.005
  - attack.t1027
  - detection.emerging_threats
  - DEMO
