
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Visual Studio NodejsTools PressAnyKey Renamed Execution
id: 65c3ca2c-525f-4ced-968e-246a713d164f
related:
  - type: similar
    id: a20391f8-76fb-437b-abc0-dba2df1952c6
status: test
description: Detects renamed execution of "Microsoft.NodejsTools.PressAnyKey.exe",
    which can be abused as a LOLBIN to execute arbitrary binaries
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/11 20:47:41
references:
  - https://twitter.com/mrd0x/status/1463526834918854661
  - https://gist.github.com/nasbench/a989ce64cefa8081bd50cf6ad8c491b5
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_legit_name:
        Image|endswith: \Microsoft.NodejsTools.PressAnyKey.exe
    selection:
        OriginalFileName: Microsoft.NodejsTools.PressAnyKey.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218
  - DEMO
