
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Uncommon Userinit Child Process
id: 0a98a10c-685d-4ab0-bddc-b6bdd1d48458
related:
  - type: similar
    id: 21d856f9-9281-4ded-9377-51a1a6e2a432
status: test
description: Detects uncommon "userinit.exe" child processes, which could be a sign
    of uncommon shells or login scripts used for persistence.
author: Tom Ueltschi (@c_APT_ure), Tim Shelton
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/01/12 14:21:41
references:
  - https://cocomelonc.github.io/persistence/2022/12/09/malware-pers-20.html
  - https://learn.microsoft.com/en-us/windows-server/administration/server-core/server-core-sconfig#powershell-is-the-default-shell-on-server-core
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_explorer:
        Image|endswith: :\WINDOWS\explorer.exe
    filter_optional_citrix:
        Image|endswith:
          - :\Program Files (x86)\Citrix\HDX\bin\cmstart.exe
          - :\Program Files (x86)\Citrix\HDX\bin\icast.exe
          - :\Program Files (x86)\Citrix\System32\icast.exe
          - :\Program Files\Citrix\HDX\bin\cmstart.exe
          - :\Program Files\Citrix\HDX\bin\icast.exe
          - :\Program Files\Citrix\System32\icast.exe
    filter_optional_image_null:
        Image: []
    filter_optional_logonscripts:
        CommandLine|contains:
          - netlogon.bat
          - UsrLogon.cmd
    filter_optional_proquota:
        Image|endswith:
          - :\Windows\System32\proquota.exe
          - :\Windows\SysWOW64\proquota.exe
    filter_optional_windows_core:
        CommandLine: PowerShell.exe
    selection:
        ParentImage|endswith: \userinit.exe
falsepositives: Legitimate logon scripts or custom shells may trigger false positives.
    Apply additional filters accordingly.
level: high
customer: 'demo'
modified: 2023/11/14
tags:
  - attack.t1037.001
  - attack.persistence
  - DEMO
