
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Uncommon Child Process Of Conhost.EXE
id: 7dc2dedd-7603-461a-bc13-15803d132355
status: experimental
description: Detects uncommon "conhost" child processes. This could be a sign of "conhost"
    usage as a LOLBIN or potential process injection activity.
author: omkar72
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/25 15:23:01
references:
  - http://www.hexacorn.com/blog/2020/05/25/how-to-con-your-host/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_conhost:
        Image|endswith: :\Windows\System32\conhost.exe
    filter_main_empty:
        Image: ""
    filter_main_null:
        Image: []
    filter_optional_provider:
        Provider_Name: SystemTraceProvider-Process
    selection:
        ParentImage|endswith: \conhost.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/12/11
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
