
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Extexport Execution
id: fb0b815b-f5f6-4f50-970f-ffe21f253f7a
status: test
description: Extexport.exe loads dll and is execute from other folder the original
    path
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/11/26 14:31:41
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Extexport/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - CommandLine|contains: Extexport.exe
      - Image|endswith: \Extexport.exe
      - OriginalFileName: extexport.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/05/16
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
