
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Remote Child Process From Outlook
id: e212d415-0e93-435f-9e1a-f29005bb4723
related:
  - type: similar
    id: 208748f7-881d-47ac-a29c-07ea84bf691d
status: test
description: Detects a suspicious child process spawning from Outlook where the image
    is located in a remote location (SMB/WebDav shares).
author: Markus Neis, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/12/27 17:45:11
references:
  - https://github.com/sensepost/ruler
  - https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html
  - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=49
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|startswith: \\\\
        ParentImage|endswith: \outlook.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/09
tags:
  - attack.execution
  - attack.t1059
  - attack.t1202
  - DEMO
