
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Add SafeBoot Keys Via Reg Utility
id: d7662ff6-9e97-4596-a61d-9839e32dee8d
related:
  - type: similar
    id: fc0e89b5-adb0-43c1-b749-c12a10ec37de
status: test
description: Detects execution of "reg.exe" commands with the "add" or "copy" flags
    on safe boot registry keys. Often used by attacker to allow the ransomware to
    work in safe mode as some security products do not
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/02 14:12:21
references:
  - https://redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_flag:
        CommandLine|contains:
          - ' copy '
          - ' add '
    selection_img:
      - Image|endswith: reg.exe
      - OriginalFileName: reg.exe
    selection_safeboot:
        CommandLine|contains: \SYSTEM\CurrentControlSet\Control\SafeBoot
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - DEMO
