
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Unquoted Service Path Reconnaissance Via Wmic.EXE
id: 68bcd73b-37ef-49cb-95fc-edc809730be6
related:
  - type: similar
    id: 09658312-bc27-4a3b-91c5-e49ab9046d1b
  - type: similar
    id: 76f55eaa-d27f-4213-9d45-7b0e4b60bbae
status: experimental
description: Detects known WMI recon method to look for unquoted service paths using
    wmic. Often used by pentester and attacker enumeration scripts
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/20 21:19:51
references:
  - https://github.com/nccgroup/redsnarf/blob/35949b30106ae543dc6f2bc3f1be10c6d9a8d40e/redsnarf.py
  - https://github.com/S3cur3Th1sSh1t/Creds/blob/eac23d67f7f90c7fc8e3130587d86158c22aa398/PowershellScripts/jaws-enum.ps1
  - https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_cli:
        CommandLine|contains|all:
          - ' service get '
          - name,displayname,pathname,startmode
    selection_img:
      - OriginalFileName: wmic.exe
      - Image|endswith: \WMIC.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/09/11
tags:
  - attack.execution
  - attack.t1047
  - DEMO
