
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-06-21 19:00
# Generated for User: demo
# Number of Rules: 3228
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Binary Proxy Execution Via Cdb.EXE
id: b5c7395f-e501-4a08-94d4-57fe7a9da9d2
status: test
description: Detects usage of "cdb.exe" to launch arbitrary processes or commands
    from a debugger script file
author: Beyu Denis, oscd.community, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/26 17:12:41
references:
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Cdb/
  - https://web.archive.org/web/20170715043507/http://www.exploit-monday.com/2016/08/windbg-cdb-shellcode-runner.html
  - https://twitter.com/nas_bench/status/1534957360032120833
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_cli:
        CommandLine|contains:
          - ' -c '
          - ' -cf '
    selection_img:
      - Image|endswith: \cdb.exe
      - OriginalFileName: CDB.Exe
falsepositives: Legitimate use of debugging tools
level: medium
customer: 'demo'
modified: 2024/04/22
tags:
  - attack.execution
  - attack.t1106
  - attack.defense_evasion
  - attack.t1218
  - attack.t1127
  - DEMO
