
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Mint Sandstorm - Log4J Wstomcat Process Execution
id: 7c97c625-0350-4f0a-8943-f6cadc88125e
status: test
description: Detects Log4J Wstomcat process execution as seen in Mint Sandstorm activity
author: Nasreddine Bencherchali (Nextron Systems), MSTIC (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/20 18:38:11
references:
  - https://www.microsoft.com/en-us/security/blog/2023/04/18/nation-state-threat-actor-mint-sandstorm-refines-tradecraft-to-attack-high-value-targets/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_repadmin:
        Image|endswith: \repadmin.exe
    selection:
        ParentImage|endswith: \ws_tomcatservice.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/11/29
tags:
  - attack.execution
  - detection.emerging_threats
  - DEMO
