
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - KrbRelayUp Execution
id: 12827a56-61a4-476a-a9cb-f3068f191073
status: test
description: Detects KrbRelayUp used to perform a universal no-fix local privilege
    escalation in Windows domain environments where LDAP signing is not enforced
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/26 13:58:31
references:
  - https://github.com/Dec0ne/KrbRelayUp
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_cli_1:
        CommandLine|contains|all:
          - ' relay '
          - ' -Domain '
          - ' -ComputerName '
    selection_cli_2:
        CommandLine|contains|all:
          - ' krbscm '
          - ' -sc '
    selection_cli_3:
        CommandLine|contains|all:
          - ' spawn '
          - ' -d '
          - ' -cn '
          - ' -cp '
    selection_img:
      - Image|endswith: \KrbRelayUp.exe
      - OriginalFileName: KrbRelayUp.exe
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.credential_access
  - attack.t1558.003
  - attack.lateral_movement
  - attack.t1550.003
  - DEMO
