
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspect Svchost Activity
id: 16c37b52-b141-42a5-a3ea-bbe098444397
status: test
description: It is extremely abnormal for svchost.exe to spawn without any CLI arguments
    and is normally observed when a malicious process spawns the process and injects
    code into the process memory space.
author: David Burkett, @signalblur
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/12/28 12:39:41
references:
  - https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter
    filter:
      - ParentImage|endswith:
          - \rpcnet.exe
          - \rpcnetp.exe
      - CommandLine: []
    selection:
        CommandLine|endswith: svchost.exe
        Image|endswith: \svchost.exe
fields:
  - CommandLine
  - ParentCommandLine
falsepositives: Rpcnet.exe / rpcnetp.exe which is a lojack style software. https://www.blackhat.com/docs/us-14/materials/us-14-Kamlyuk-Kamluk-Computrace-Backdoor-Revisited.pdf
level: high
customer: 'demo'
modified: 2022/06/27
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1055
  - DEMO
