
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious PowerShell Encoded Command Patterns
id: b9d9cc83-380b-4ba3-8d8f-60c0e7e2930c
status: test
description: Detects PowerShell command line patterns in combincation with encoded
    commands that often appear in malware infection chains
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/05/24 18:26:21
references:
  - https://app.any.run/tasks/b9040c63-c140-479b-ad59-f1bb56ce7a97/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_*
    filter_gcworker:
        ParentImage|contains:
          - C:\Packages\Plugins\Microsoft.GuestConfiguration.ConfigurationforWindows\
          - \gc_worker.exe
    selection_encoded:
        CommandLine|contains:
          - ' JAB'
          - ' SUVYI'
          - ' SQBFAFgA'
          - ' aWV4I'
          - ' IAB'
          - ' PAA'
          - ' aQBlAHgA'
    selection_flags:
        CommandLine|contains:
          - ' -e '
          - ' -en '
          - ' -enc '
          - ' -enco'
    selection_img:
      - Image|endswith:
          - \powershell.exe
          - \pwsh.exe
      - OriginalFileName:
          - PowerShell.Exe
          - pwsh.dll
falsepositives: Other tools that work with encoded scripts in the command line instead
    of script files
level: high
customer: 'demo'
modified: 2023/01/05
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
