
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: User Added to Remote Desktop Users Group
id: ffa28e60-bdb1-46e0-9f82-05f7a61cc06e
related:
  - type: similar
    id: ad720b90-25ad-43ff-9b5e-5c841facc8e5
  - type: similar
    id: 10fb649c-3600-4d37-b1e6-56ea90bb7e09
status: test
description: Detects addition of users to the local Remote Desktop Users group via
    "Net" or "Add-LocalGroupMember".
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/06 16:17:31
references:
  - https://www.microsoft.com/security/blog/2021/11/16/evolving-trends-in-iranian-threat-actor-activity-mstic-presentation-at-cyberwarcon-2021/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_group:
        CommandLine|contains:
          - Remote Desktop Users
          - Utilisateurs du Bureau à distance
          - Usuarios de escritorio remoto
    selection_main:
      - CommandLine|contains|all:
          - 'localgroup '
          - ' /add'
      - CommandLine|contains|all:
          - 'Add-LocalGroupMember '
          - ' -Group '
falsepositives: Administrative activity
level: high
customer: 'demo'
modified: 2022/09/09
tags:
  - attack.persistence
  - attack.lateral_movement
  - attack.t1133
  - attack.t1136.001
  - attack.t1021.001
  - DEMO
