
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PowerShell DownloadFile
id: 8f70ac5f-1f6f-4f8e-b454-db19561216c5
status: test
description: Detects the execution of powershell, a WebClient object creation and
    the invocation of DownloadFile in a single command line
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/08/28 12:18:11
references:
  - https://www.fireeye.com/blog/threat-research/2020/03/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - powershell
          - .DownloadFile
          - System.Net.WebClient
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.execution
  - attack.t1059.001
  - attack.command_and_control
  - attack.t1104
  - attack.t1105
  - DEMO
