
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Service Binary Directory
id: 883faa95-175a-4e22-8181-e5761aeb373c
status: test
description: Detects a service binary running in a suspicious directory
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/03/09 15:36:21
references:
  - https://blog.truesec.com/2021/03/07/exchange-zero-day-proxylogon-and-hafnium/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|contains:
          - \Users\Public\
          - \$Recycle.bin
          - \Users\All Users\
          - \Users\Default\
          - \Users\Contacts\
          - \Users\Searches\
          - C:\Perflogs\
          - \config\systemprofile\
          - \Windows\Fonts\
          - \Windows\IME\
          - \Windows\addins\
        ParentImage|endswith:
          - \services.exe
          - \svchost.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
