
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - Certify Execution
id: 762f2482-ff21-4970-8939-0aa317a886bb
status: test
description: Detects Certify a tool for Active Directory certificate abuse based on
    PE metadata characteristics and common command line arguments.
author: pH-T (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/17 13:14:01
references:
  - https://github.com/GhostPack/Certify
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_img or all of selection_cli_*
    selection_cli_commands:
        CommandLine|contains:
          - '.exe cas '
          - '.exe find '
          - '.exe pkiobjects '
          - '.exe request '
          - '.exe download '
    selection_cli_options:
        CommandLine|contains:
          - ' /vulnerable'
          - ' /template:'
          - ' /altname:'
          - ' /domain:'
          - ' /path:'
          - ' /ca:'
    selection_img:
      - Image|endswith: \Certify.exe
      - OriginalFileName: Certify.exe
      - Description|contains: Certify
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/04/25
tags:
  - attack.discovery
  - attack.credential_access
  - attack.t1649
  - DEMO
