
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Schtasks Schedule Types
id: 24c8392b-aa3c-46b7-a545-43f71657fe98
related:
  - type: similar
    id: 7a02e22e-b885-4404-b38b-1ddc7e65258a
status: test
description: Detects scheduled task creations or modification on a suspicious schedule
    type
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/09 15:19:31
references:
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-change
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
  - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_*
    filter_privs:
        CommandLine|contains:
          - NT AUT
          - ' SYSTEM'
          - HIGHEST
    selection_img:
      - Image|endswith: \schtasks.exe
      - OriginalFileName: schtasks.exe
    selection_time:
        CommandLine|contains:
          - ' ONLOGON '
          - ' ONSTART '
          - ' ONCE '
          - ' ONIDLE '
falsepositives: Legitimate processes that run at logon. Filter according to your environment
level: high
customer: 'demo'
tags:
  - attack.execution
  - attack.t1053.005
  - DEMO
