
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious IIS Module Registration
id: 043c4b8b-3a54-4780-9682-081cb6b8185c
status: test
description: Detects a suspicious IIS module registration as described in Microsoft
    threat report on IIS backdoors
author: Florian Roth (Nextron Systems), Microsoft (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/04 15:08:51
references:
  - https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_parent and 1 of selection_cli_*
    selection_cli_1:
        CommandLine|contains: appcmd.exe add module
    selection_cli_2:
        CommandLine|contains: ' system.enterpriseservices.internal.publish'
        Image|endswith: \powershell.exe
    selection_cli_3:
        CommandLine|contains|all:
          - gacutil
          - ' /I'
    selection_parent:
        ParentImage|endswith: \w3wp.exe
falsepositives: Administrative activity
level: high
customer: 'demo'
modified: 2023/01/23
tags:
  - attack.persistence
  - attack.t1505.004
  - DEMO
