
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Abusing Print Executable
id: bafac3d6-7de9-4dd9-8874-4a1194b493ed
status: test
description: Attackers can use print.exe for remote file copy
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/05 12:28:01
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Print/
  - https://twitter.com/Oddvarmoe/status/985518877076541440
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter_print
    filter_print:
        CommandLine|contains: print.exe
    selection:
        CommandLine|contains|all:
          - /D
          - .exe
        CommandLine|startswith: print
        Image|endswith: \print.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/07/07
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
