
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Regsvr32 DLL Execution With Suspicious File Extension
id: 089fc3d2-71e8-4763-a8a5-c97fbb0a403e
related:
  - type: obsoletes
    id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
status: experimental
description: Detects the execution of REGSVR32.exe with DLL files masquerading as
    other files
author: Florian Roth (Nextron Systems), frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/11/29 19:41:01
references:
  - https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/
  - https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html
  - https://guides.lib.umich.edu/c.php?g=282942&p=1885348
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|endswith:
          - .bin
          - .bmp
          - .cr2
          - .dat
          - .eps
          - .gif
          - .ico
          - .jpeg
          - .jpg
          - .nef
          - .orf
          - .png
          - .raw
          - .sr2
          - .temp
          - .tif
          - .tiff
          - .tmp
          - .rtf
          - .txt
    selection_img:
      - Image|endswith: \regsvr32.exe
      - OriginalFileName: REGSVR32.EXE
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/05/24
tags:
  - attack.defense_evasion
  - attack.t1218.010
  - DEMO
