
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Rundll32 UNC Path Execution
id: 5cdb711b-5740-4fb2-ba88-f7945027afac
status: test
description: Detects rundll32 execution where the DLL is located on a remote location
    (share)
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/10 12:39:31
references:
  - https://www.cybereason.com/blog/rundll32-the-infamous-proxy-for-executing-malicious-code
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains: ' \\\\'
    selection_img:
      - Image|endswith: \rundll32.exe
      - OriginalFileName: RUNDLL32.EXE
      - CommandLine|contains: rundll32
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.execution
  - attack.t1021.002
  - attack.t1218.011
  - DEMO
