
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Add Insecure Download Source To Winget
id: 81a0ecb5-0a41-4ba1-b2ba-c944eb92bfa2
related:
  - type: similar
    id: 05ebafc8-7aa2-4bcd-a269-2aec93f9e842
  - type: similar
    id: c15a46a0-07d4-4c87-b4b6-89207835a83b
status: test
description: |
    Detects usage of winget to add a new insecure (http) download source.
    Winget will not allow the addition of insecure sources, hence this could indicate potential suspicious activity (or typos)
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/17 15:46:51
references:
  - https://learn.microsoft.com/en-us/windows/package-manager/winget/source
  - https://github.com/nasbench/Misc-Research/tree/b9596e8109dcdb16ec353f316678927e507a5b8d/LOLBINs/Winget
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains|all:
          - 'source '
          - 'add '
          - http://
    selection_img:
      - Image|endswith: \winget.exe
      - OriginalFileName: winget.exe
falsepositives: False positives might occur if the users are unaware of such control
    checks
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.execution
  - attack.t1059
  - DEMO
