
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: LSA PPL Protection Disabled Via Reg.EXE
id: 8c0eca51-0f88-4db2-9183-fdfb10c703f9
status: test
description: Detects the usage of the "reg.exe" utility to disable PPL protection
    on the LSA process
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/22 15:13:31
references:
  - https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains: SYSTEM\CurrentControlSet\Control\Lsa
        CommandLine|contains|all:
          - ' add '
          - ' /d 0'
          - ' /v RunAsPPL '
    selection_img:
      - Image|endswith: \reg.exe
      - OriginalFileName: reg.exe
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/03/26
tags:
  - attack.defense_evasion
  - attack.t1562.010
  - DEMO
