
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious PowerShell Child Processes
id: e4b6d2a7-d8a4-4f19-acbd-943c16d90647
status: experimental
description: Detects potentially suspicious child processes spawned by PowerShell
author: Florian Roth (Nextron Systems), Tim Shelton
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/26 19:27:21
references:
  - https://twitter.com/ankit_anubhav/status/1518835408502620162
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_optional_*
    filter_optional_amazon:
        CommandLine|contains: \Program Files\Amazon\WorkspacesConfig\Scripts\
        ParentCommandLine|contains: \Program Files\Amazon\WorkspacesConfig\Scripts\
    selection:
        Image|endswith:
          - \bash.exe
          - \bitsadmin.exe
          - \certutil.exe
          - \cscript.exe
          - \forfiles.exe
          - \hh.exe
          - \mshta.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \schtasks.exe
          - \scrcons.exe
          - \scriptrunner.exe
          - \sh.exe
          - \wmic.exe
          - \wscript.exe
        ParentImage|endswith:
          - \powershell_ise.exe
          - \powershell.exe
          - \pwsh.exe
falsepositives: Some false positive is to be expected from PowerShell scripts that
    might make use of additional binaries such as "mshta", "bitsadmin", etc. Apply
    additional filters for those scripts when needed.
level: high
customer: 'demo'
modified: 2023/05/30
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
