
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Execute Code with Pester.bat
id: 59e938ff-0d6d-4dc3-b13f-36cc28734d4e
status: test
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for
    testing)
author: Julia Fomina, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/08 13:17:41
references:
  - https://twitter.com/Oddvarmoe/status/993383596244258816
  - https://github.com/api0cradle/LOLBAS/blob/d148d278f5f205ce67cfaf49afdfb68071c7252a/OSScripts/pester.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: powershell_module or (cmd_execution and get_help)
    cmd_execution:
        CommandLine|contains|all:
          - pester
          - ;
        Image|endswith: \cmd.exe
    get_help:
        CommandLine|contains:
          - help
          - \?
    powershell_module:
        CommandLine|contains|all:
          - Pester
          - Get-Help
        Image|endswith:
          - \powershell.exe
          - \pwsh.exe
falsepositives: Legitimate use of Pester for writing tests for Powershell scripts
    and modules
level: medium
customer: 'demo'
modified: 2023/11/09
tags:
  - attack.execution
  - attack.t1059.001
  - attack.defense_evasion
  - attack.t1216
  - DEMO
