
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PktMon.EXE Execution
id: f956c7c1-0f60-4bc5-b7d7-b39ab3c08908
status: test
description: Detects execution of PktMon, a tool that captures network packets.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/17 11:08:51
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Pktmon/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - Image|endswith: \pktmon.exe
      - OriginalFileName: PktMon.exe
falsepositives: Legitimate use
level: medium
customer: 'demo'
modified: 2023/06/23
tags:
  - attack.credential_access
  - attack.t1040
  - DEMO
