
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Scheduled Task Executing Encoded Payload from Registry
id: c4eeeeae-89f4-43a7-8b48-8d1bdfa66c78
status: test
description: Detects the creation of a schtask that potentially executes a base64
    encoded payload stored in the Windows Registry using PowerShell.
author: pH-T (Nextron Systems), @Kostastsale, @TheDFIRReport, X__Junior (Nextron Systems),
    Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/12 20:17:31
references:
  - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli_create:
        CommandLine|contains: /Create
    selection_cli_encoding:
        CommandLine|contains:
          - FromBase64String
          - encodedcommand
    selection_cli_get:
        CommandLine|contains:
          - Get-ItemProperty
          - ' gp '
    selection_cli_hive:
        CommandLine|contains:
          - 'HKCU:'
          - 'HKLM:'
          - 'registry::'
          - HKEY_
    selection_img:
      - Image|endswith: \schtasks.exe
      - OriginalFileName: schtasks.exe
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.execution
  - attack.persistence
  - attack.t1053.005
  - attack.t1059.001
  - DEMO
