
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Scheduled Task Executing Payload from Registry
id: 86588b36-c6d3-465f-9cee-8f9093e07798
related:
  - type: derived
    id: c4eeeeae-89f4-43a7-8b48-8d1bdfa66c78
status: experimental
description: Detects the creation of a schtasks that potentially executes a payload
    stored in the Windows Registry using PowerShell.
author: X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/07/18 18:17:11
references:
  - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_*
    filter_main_encoding:
        CommandLine|contains:
          - FromBase64String
          - encodedcommand
    selection_cli_create:
        CommandLine|contains: /Create
    selection_cli_get:
        CommandLine|contains:
          - Get-ItemProperty
          - ' gp '
    selection_cli_hive:
        CommandLine|contains:
          - 'HKCU:'
          - 'HKLM:'
          - 'registry::'
          - HKEY_
    selection_img:
      - Image|endswith: \schtasks.exe
      - OriginalFileName: schtasks.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.persistence
  - attack.t1053.005
  - attack.t1059.001
  - DEMO
