
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PUA - System Informer Execution
id: 5722dff1-4bdd-4949-86ab-fbaf707e767a
related:
  - type: similar
    id: 811e0002-b13b-4a15-9d00-a613fce66e42
status: experimental
description: Detects the execution of System Informer, a task manager tool to view
    and manipulate processes, kernel options and other low level operations
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/08 13:51:41
references:
  - https://github.com/winsiderss/systeminformer
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_hash_values:
      - md5: 19426363A37C03C3ED6FEDF57B6696EC
      - sha1: 8B12C6DA8FAC0D5E8AB999C31E5EA04AF32D53DC
      - sha256: 8EE9D84DE50803545937A63C686822388A3338497CDDB660D5D69CF68B68F287
      - Imphash: B68908ADAEB5D662F87F2528AF318F12
    selection_hashes:
        Hashes|contains:
          - MD5=19426363A37C03C3ED6FEDF57B6696EC
          - SHA1=8B12C6DA8FAC0D5E8AB999C31E5EA04AF32D53DC
          - SHA256=8EE9D84DE50803545937A63C686822388A3338497CDDB660D5D69CF68B68F287
          - IMPHASH=B68908ADAEB5D662F87F2528AF318F12
    selection_image:
      - Image|endswith: \SystemInformer.exe
      - OriginalFileName: SystemInformer.exe
      - Description: System Informer
      - Product: System Informer
falsepositives: System Informer is regularly used legitimately by system administrators
    or developers. Apply additional filters accordingly
level: medium
customer: 'demo'
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.discovery
  - attack.defense_evasion
  - attack.t1082
  - attack.t1564
  - attack.t1543
  - DEMO
