
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Password Spraying Attempt Using Dsacls.EXE
id: bac9fb54-2da7-44e9-988f-11e9a5edbc0c
status: test
description: Detects possible password spraying attempts using Dsacls
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/20 19:41:11
references:
  - https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/using-dsacls-to-check-ad-object-permissions#password-spraying-anyone
  - https://ss64.com/nt/dsacls.html
  - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_cli:
        CommandLine|contains|all:
          - '/user:'
          - '/passwd:'
    selection_img:
      - Image|endswith: \dsacls.exe
      - OriginalFileName: DSACLS.EXE
falsepositives: Legitimate use of dsacls to bind to an LDAP session
level: medium
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
