
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Possible Privilege Escalation via Weak Service Permissions
id: d937b75f-a665-4480-88a5-2f20e9f9b22a
status: test
description: Detection of sc.exe utility spawning by user with Medium integrity level
    to change service ImagePath or FailureCommand
author: Teymur Kheirkhabarov
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/26 21:33:21
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
  - https://pentestlab.blog/2017/03/30/weak-service-permissions/
logsource:
    category: process_creation
    product: windows
detection:
    condition: scbynonadmin and 1 of selection_*
    scbynonadmin:
        Image|endswith: \sc.exe
        IntegrityLevel: Medium
    selection_binpath:
        CommandLine|contains|all:
          - config
          - binPath
    selection_failure:
        CommandLine|contains|all:
          - failure
          - command
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/07/14
tags:
  - attack.persistence
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1574.011
  - DEMO
