
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: VMToolsd Suspicious Child Process
id: 5687f942-867b-4578-ade7-1e341c46e99a
status: experimental
description: Detects suspicious child process creations of VMware Tools process which
    may indicate persistence setup
author: bohops, Bhabesh Raj
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/10/08 14:51:01
references:
  - https://bohops.com/2021/10/08/analyzing-and-detecting-a-vmtools-persistence-technique/
  - https://user-images.githubusercontent.com/61026070/136518004-b68cce7d-f9b8-4e9a-9b7b-53b1568a9a94.png
  - https://github.com/vmware/open-vm-tools/blob/master/open-vm-tools/tools.conf
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection* and not 1 of filter_main_*
    filter_main_empty:
        CommandLine: ""
        Image|endswith: \cmd.exe
    filter_main_null:
        CommandLine: []
        Image|endswith: \cmd.exe
    filter_main_vmwaretools_script:
        CommandLine|contains:
          - \VMware\VMware Tools\poweron-vm-default.bat
          - \VMware\VMware Tools\poweroff-vm-default.bat
          - \VMware\VMware Tools\resume-vm-default.bat
          - \VMware\VMware Tools\suspend-vm-default.bat
        Image|endswith: \cmd.exe
    selection_img:
      - Image|endswith:
          - \cmd.exe
          - \cscript.exe
          - \mshta.exe
          - \powershell.exe
          - \pwsh.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \wscript.exe
      - OriginalFileName:
          - Cmd.Exe
          - cscript.exe
          - MSHTA.EXE
          - PowerShell.EXE
          - pwsh.dll
          - REGSVR32.EXE
          - RUNDLL32.EXE
          - wscript.exe
    selection_parent:
        ParentImage|endswith: \vmtoolsd.exe
falsepositives: Legitimate use by VM administrator
level: high
customer: 'demo'
modified: 2023/07/25
tags:
  - attack.execution
  - attack.persistence
  - attack.t1059
  - DEMO
