
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: System File Execution Location Anomaly
id: e4a6b256-3e47-40fc-89d2-7a477edd6915
status: experimental
description: Detects a Windows program executable started from a suspicious folder
author: Florian Roth (Nextron Systems), Patrick Bareiss, Anton Kutepov, oscd.community,
    Nasreddine Bencherchali
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/11/27 16:08:31
references:
  - https://twitter.com/GelosSnake/status/934900723426439170
  - https://asec.ahnlab.com/en/39828/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_*
    filter_generic:
      - Image|startswith:
          - C:\Windows\System32\
          - C:\Windows\SysWOW64\
          - C:\Windows\WinSxS\
      - Image|contains: \SystemRoot\System32\
      - Image:
          - C:\Windows\explorer.exe
          - C:\Program Files\PowerShell\7\pwsh.exe
          - C:\Program Files\PowerShell\7-preview\pwsh.exe
    filter_wsl_windowsapps:
        Image|endswith: \wsl.exe
        Image|startswith: C:\Program Files\WindowsApps\MicrosoftCorporationII.WindowsSubsystemForLinux
    selection:
        Image|endswith:
          - \svchost.exe
          - \rundll32.exe
          - \services.exe
          - \powershell.exe
          - \powershell_ise.exe
          - \pwsh.exe
          - \regsvr32.exe
          - \spoolsv.exe
          - \lsass.exe
          - \smss.exe
          - \csrss.exe
          - \conhost.exe
          - \wininit.exe
          - \lsm.exe
          - \winlogon.exe
          - \explorer.exe
          - \taskhost.exe
          - \Taskmgr.exe
          - \sihost.exe
          - \RuntimeBroker.exe
          - \smartscreen.exe
          - \dllhost.exe
          - \audiodg.exe
          - \wlanext.exe
          - \dashost.exe
          - \schtasks.exe
          - \cscript.exe
          - \wscript.exe
          - \wsl.exe
          - \bitsadmin.exe
          - \atbroker.exe
          - \bcdedit.exe
          - \certutil.exe
          - \certreq.exe
          - \cmstp.exe
          - \consent.exe
          - \defrag.exe
          - \dism.exe
          - \dllhst3g.exe
          - \eventvwr.exe
          - \msiexec.exe
          - \runonce.exe
          - \winver.exe
          - \logonui.exe
          - \userinit.exe
          - \dwm.exe
          - \LsaIso.exe
          - \ntoskrnl.exe
          - \wsmprovhost.exe
          - \dfrgui.exe
fields:
  - ComputerName
  - User
  - Image
falsepositives: Exotic software
level: high
customer: 'demo'
modified: 2023/10/18
tags:
  - attack.defense_evasion
  - attack.t1036
  - DEMO
