
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - SharpImpersonation Execution
id: f89b08d0-77ad-4728-817b-9b16c5a69c7a
related:
  - type: similar
    id: cf0c254b-22f1-4b2b-8221-e137b3c0af94
status: test
description: Detects execution of the SharpImpersonation tool. Which can be used to
    manipulate tokens on a Windows computers remotely (PsExec/WmiExec) or interactively
author: Sai Prashanth Pulisetti @pulisettis, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/27 16:28:41
references:
  - https://s3cur3th1ssh1t.github.io/SharpImpersonation-Introduction/
  - https://github.com/S3cur3Th1sSh1t/SharpImpersonation
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_cli:
      - CommandLine|contains|all:
          - ' user:'
          - ' binary:'
      - CommandLine|contains|all:
          - ' user:'
          - ' shellcode:'
      - CommandLine|contains:
          - ' technique:CreateProcessAsUserW'
          - ' technique:ImpersonateLoggedOnuser'
    selection_img:
      - Image|endswith: \SharpImpersonation.exe
      - OriginalFileName: SharpImpersonation.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/13
tags:
  - attack.privilege_escalation
  - attack.defense_evasion
  - attack.t1134.001
  - attack.t1134.003
  - DEMO
