
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential SMB Relay Attack Tool Execution
id: 5589ab4f-a767-433c-961d-c91f3f704db1
status: test
description: Detects different hacktools used for relay attacks on Windows for privilege
    escalation
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/07/24 16:33:31
references:
  - https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/
  - https://pentestlab.blog/2017/04/13/hot-potato/
  - https://github.com/ohpe/juicy-potato
  - https://hunter2.gitbook.io/darthsidious/other/war-stories/domain-admin-in-30-minutes
  - https://hunter2.gitbook.io/darthsidious/execution/responder-with-ntlm-relay-and-empire
  - https://www.localpotato.com/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_* and not 1 of filter_*
    filter_hotpotatoes:
        Image|contains:
          - HotPotatoes6
          - HotPotatoes7
          - 'HotPotatoes '
    selection_juicypotato_enum:
        CommandLine|contains: .exe -c "{
        CommandLine|endswith: '}" -z'
    selection_pe:
        Image|contains:
          - PetitPotam
          - RottenPotato
          - HotPotato
          - JuicyPotato
          - \just_dce_
          - Juicy Potato
          - \temp\rot.exe
          - \Potato.exe
          - \SpoolSample.exe
          - \Responder.exe
          - \smbrelayx
          - \ntlmrelayx
          - \LocalPotato
    selection_script:
        CommandLine|contains:
          - Invoke-Tater
          - ' smbrelay'
          - ' ntlmrelay'
          - 'cme smb '
          - ' /ntlm:NTLMhash '
          - Invoke-PetitPotam
          - '.exe -t * -p '
falsepositives: Legitimate files with these rare hacktool names
level: critical
customer: 'demo'
modified: 2023/02/14
tags:
  - attack.execution
  - attack.t1557.001
  - DEMO
