
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Disabled IE Security Features
id: fb50eb7a-5ab1-43ae-bcc9-091818cb8424
status: test
description: Detects command lines that indicate unwanted modifications to registry
    keys that disable important Internet Explorer security features
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/06/19 13:32:51
references:
  - https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection*
    selection1:
        CommandLine|contains|all:
          - ' -name IEHarden '
          - ' -value 0 '
    selection2:
        CommandLine|contains|all:
          - ' -name DEPOff '
          - ' -value 1 '
    selection3:
        CommandLine|contains|all:
          - ' -name DisableFirstRunCustomize '
          - ' -value 2 '
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - DEMO
