
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - Htran/NATBypass Execution
id: f5e3b62f-e577-4e59-931e-0a15b2b94e1e
status: test
description: Detects executable names or flags used by Htran or Htran-like tools (e.g.
    NATBypass)
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/27 15:07:51
references:
  - https://github.com/HiwinCN/HTran
  - https://github.com/cw1997/NATBypass
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_cli:
        CommandLine|contains:
          - '.exe -tran '
          - '.exe -slave '
    selection_img:
        Image|endswith:
          - \htran.exe
          - \lcx.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.command_and_control
  - attack.t1090
  - attack.s0040
  - DEMO
