
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Capture Credentials with Rpcping.exe
id: 93671f99-04eb-4ab4-a161-70d446a84003
status: test
description: Detects using Rpcping.exe to send a RPC test connection to the target
    server (-s) and force the NTLM hash to be sent in the process.
author: Julia Fomina, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/09 15:41:31
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Rpcping/
  - https://twitter.com/vysecurity/status/974806438316072960
  - https://twitter.com/vysecurity/status/873181705024266241
  - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh875578(v=ws.11)
logsource:
    category: process_creation
    product: windows
detection:
    condition: use_rpcping and remote_server and ntlm_auth
    ntlm_auth:
      - CommandLine|contains|all|windash:
          - -u
          - NTLM
      - CommandLine|contains|all|windash:
          - -t
          - ncacn_np
    remote_server:
        CommandLine|contains|windash: -s
    use_rpcping:
        Image|endswith: \rpcping.exe
falsepositives: Unlikely
level: medium
customer: 'demo'
modified: 2024/03/13
tags:
  - attack.credential_access
  - attack.t1003
  - DEMO
