
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PsExec Service Execution
id: fdfcbd78-48f1-4a4b-90ac-d82241e368c5
related:
  - type: obsoletes
    id: fa91cc36-24c9-41ce-b3c8-3bbc3f2f67ba
status: test
description: Detects launch of the PSEXESVC service, which means that this system
    was the target of a psexec remote execution
author: Thomas Patzke, Romaissa Adjailia, Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/06/12 12:26:11
references:
  - https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
  - https://www.youtube.com/watch?v=ro2QuZTIMBM
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - Image: C:\Windows\PSEXESVC.exe
      - OriginalFileName: psexesvc.exe
falsepositives: Legitimate administrative tasks
level: medium
customer: 'demo'
modified: 2023/02/28
tags:
  - attack.execution
  - DEMO
