
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Firewall Rule Deleted Via Netsh.EXE
id: 1a5fefe6-734f-452e-a07d-fc1c35bce4b2
status: test
description: Detects the removal of a port or application rule in the Windows Firewall
    configuration using netsh
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/14 14:41:11
references:
  - https://app.any.run/tasks/8bbd5b4c-b82d-4e6d-a3ea-d454594a37cc/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_optional_*
    filter_optional_dropbox:
        CommandLine|contains: name=Dropbox
        ParentImage|endswith: \Dropbox.exe
    selection_cli:
        CommandLine|contains|all:
          - firewall
          - 'delete '
    selection_img:
      - Image|endswith: \netsh.exe
      - OriginalFileName: netsh.exe
falsepositives:
  - Legitimate administration activity
  - Software installations and removal
level: medium
customer: 'demo'
modified: 2023/02/10
tags:
  - attack.defense_evasion
  - attack.t1562.004
  - DEMO
