
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Credential Dumping Attempt Using New NetworkProvider - CLI
id: baef1ec6-2ca9-47a3-97cc-4cf2bda10b77
related:
  - type: similar
    id: 0442defa-b4a2-41c9-ae2c-ea7042fc4701
status: test
description: Detects when an attacker tries to add a new network provider in order
    to dump clear text credentials, similar to how the NPPSpy tool does it
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/23 23:37:21
references:
  - https://docs.microsoft.com/en-us/troubleshoot/windows-client/deployment/network-provider-settings-removed-in-place-upgrade
  - https://github.com/gtworek/PSBits/tree/master/PasswordStealing/NPPSpy
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - \System\CurrentControlSet\Services\
          - \NetworkProvider
falsepositives: Other legitimate network providers used and not filtred in this rule
level: high
customer: 'demo'
modified: 2023/02/02
tags:
  - attack.credential_access
  - attack.t1003
  - DEMO
