
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: MpiExec Lolbin
id: 729ce0ea-5d8f-4769-9762-e35de441586d
status: test
description: Detects a certain command line flag combination used by mpiexec.exe LOLBIN
    from HPC pack that can be used to execute any other binary
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/11 09:40:31
references:
  - https://twitter.com/mrd0x/status/1465058133303246867
  - https://docs.microsoft.com/en-us/powershell/high-performance-computing/mpiexec?view=hpc19-ps
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_binary:
      - Image|endswith: \mpiexec.exe
      - Imphash: d8b52ef6aaa3a81501bdfff9dbb96217
      - Hashes|contains: IMPHASH=d8b52ef6aaa3a81501bdfff9dbb96217
    selection_flags:
        CommandLine|contains:
          - ' /n 1 '
          - ' -n 1 '
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/03/04
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218
  - DEMO
