
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: File Encryption/Decryption Via Gpg4win From Suspicious Locations
id: e1e0b7d7-e10b-4ee4-ac49-a4bda05d320d
status: experimental
description: Detects usage of Gpg4win to encrypt/decrypt files located in potentially
    suspicious locations.
author: Nasreddine Bencherchali (Nextron Systems), X__Junior (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/11/30 23:01:41
references:
  - https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
  - https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains: -passphrase
    selection_metadata:
      - Image|endswith:
          - \gpg.exe
          - \gpg2.exe
      - Product: GNU Privacy Guard (GnuPG)
      - Description: GnuPG’s OpenPGP tool
    selection_paths:
        CommandLine|contains:
          - :\PerfLogs\
          - :\Temp\
          - :\Users\Public\
          - :\Windows\Temp\
          - \AppData\Local\Temp\
          - \AppData\Roaming\
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/09
tags:
  - attack.execution
  - DEMO
