
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - Quarks PwDump Execution
id: 0685b176-c816-4837-8e7b-1216f346636b
status: test
description: Detects usage of the Quarks PwDump tool via commandline arguments
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/05 14:44:21
references:
  - https://github.com/quarkslab/quarkspwdump
  - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/seedworm-apt-iran-middle-east
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_cli:
        CommandLine:
          - ' -dhl'
          - ' --dump-hash-local'
          - ' -dhdc'
          - ' --dump-hash-domain-cached'
          - ' --dump-bitlocker'
          - ' -dhd '
          - ' --dump-hash-domain '
          - --ntds-file
    selection_img:
        Image|endswith: \QuarksPwDump.exe
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/02/05
tags:
  - attack.credential_access
  - attack.t1003.002
  - DEMO
