
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - SharpUp PrivEsc Tool Execution
id: c484e533-ee16-4a93-b6ac-f0ea4868b2f1
status: test
description: Detects the use of SharpUp, a tool for local privilege escalation
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/20 16:27:11
references:
  - https://github.com/GhostPack/SharpUp
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - Image|endswith: \SharpUp.exe
      - Description: SharpUp
      - CommandLine|contains:
          - HijackablePaths
          - UnquotedServicePath
          - ProcessDLLHijack
          - ModifiableServiceBinaries
          - ModifiableScheduledTask
          - DomainGPPPassword
          - CachedGPPPassword
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2023/02/13
tags:
  - attack.privilege_escalation
  - attack.t1615
  - attack.t1569.002
  - attack.t1574.005
  - DEMO
