
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Control Panel Items
id: 0ba863e6-def5-4e50-9cea-4dd8c7dc46a4
status: test
description: Detects the malicious use of a control panel item
author: Kyaw Min Thein, Furkan Caliskan (@caliskanfurkan_)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/06/22 11:01:51
references:
  - https://ired.team/offensive-security/code-execution/code-execution-through-control-panel-add-ins
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_reg_* or (selection_cpl and not 1 of filter_cpl_*)
    filter_cpl_igfx:
        CommandLine|contains|all:
          - 'regsvr32 '
          - ' /s '
          - igfxCPL.cpl
    filter_cpl_sys:
        CommandLine|contains:
          - \System32\
          - '%System%'
          - '|C:\Windows\system32|'
    selection_cpl:
        CommandLine|endswith: .cpl
    selection_reg_cli:
        CommandLine|contains|all:
          - add
          - CurrentVersion\Control Panel\CPLs
    selection_reg_img:
      - Image|endswith: \reg.exe
      - OriginalFileName: reg.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/10/11
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218.002
  - attack.persistence
  - attack.t1546
  - DEMO
