
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Copy .DMP/.DUMP Files From Remote Share Via Cmd.EXE
id: 044ba588-dff4-4918-9808-3f95e8160606
status: experimental
description: Detects usage of the copy builtin cmd command to copy files with the
    ".dmp"/".dump" extension from a remote share
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/27 17:34:31
references:
  - https://thedfirreport.com/2022/09/26/bumblebee-round-two/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains:
          - .dmp
          - .dump
          - .hdmp
        CommandLine|contains|all:
          - 'copy '
          - ' \\\\'
    selection_img:
      - Image|endswith: \cmd.exe
      - OriginalFileName: Cmd.Exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/09/12
tags:
  - attack.credential_access
  - DEMO
