
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Arbitrary File Download Using Office Application
id: 4ae3e30b-b03f-43aa-87e3-b622f4048eed
related:
  - type: obsoletes
    id: 0c79148b-118e-472b-bdb7-9b57b444cc19
status: experimental
description: Detects potential arbitrary file download using a Microsoft Office application
author: Nasreddine Bencherchali (Nextron Systems), Beyu Denis, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/05/17 21:22:21
references:
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Winword/
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Powerpnt/
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Excel/
  - https://medium.com/@reegun/unsanitized-file-validation-leads-to-malicious-payload-download-via-office-binaries-202d02db7191
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_http:
        CommandLine|contains:
          - http://
          - https://
    selection_img:
      - Image|endswith:
          - \EXCEL.EXE
          - \POWERPNT.EXE
          - \WINWORD.exe
      - OriginalFileName:
          - Excel.exe
          - POWERPNT.EXE
          - WinWord.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/06/22
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
