
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Arbitrary Command Execution Using Msdt.EXE
id: 258fc8ce-8352-443a-9120-8a11e4857fa5
status: test
description: Detects processes leveraging the "ms-msdt" handler or the "msdt.exe"
    binary to execute arbitrary commands as seen in the follina (CVE-2022-30190) vulnerability
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/05/29 19:36:11
references:
  - https://twitter.com/nao_sec/status/1530196847679401984
  - https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
  - https://twitter.com/_JohnHammond/status/1531672601067675648
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_img and (selection_cmd_inline or all of selection_cmd_answerfile_*)
    selection_cmd_answerfile_flag:
        CommandLine|contains: ' PCWDiagnostic'
    selection_cmd_answerfile_param:
        CommandLine|contains|windash: ' -af '
    selection_cmd_inline:
        CommandLine|contains: IT_BrowseForFile=
    selection_img:
      - Image|endswith: \msdt.exe
      - OriginalFileName: msdt.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2024/03/13
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
