
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Hacktool Execution - PE Metadata
id: 37c1333a-a0db-48be-b64b-7393b2386e3b
status: test
description: Detects the execution of different Windows based hacktools via PE metadata
    (company, product, etc.) even if the files have been renamed
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/27 14:02:01
references:
  - https://github.com/cube0x0
  - https://www.virustotal.com/gui/search/metadata%253ACube0x0/files
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Company: Cube0x0
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2024/01/15
tags:
  - attack.credential_access
  - attack.t1588.002
  - attack.t1003
  - DEMO
