
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Process Parents
id: cbec226f-63d9-4eca-9f52-dfb6652f24df
status: test
description: Detects suspicious parent processes that should not have any children
    or should only have a single possible child program
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/21 13:15:11
references:
  - https://twitter.com/x86matthew/status/1505476263464607744?s=12
  - https://svch0st.medium.com/stats-from-hunting-cobalt-strike-beacons-c17e56255f9b
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection or ( selection_special and not 1 of filter_* )
    filter_null:
        Image: []
    filter_special:
        Image|endswith:
          - \WerFault.exe
          - \wermgr.exe
          - \conhost.exe
          - \mmc.exe
          - \win32calc.exe
          - \notepad.exe
    selection:
        ParentImage|endswith:
          - \minesweeper.exe
          - \winver.exe
          - \bitsadmin.exe
    selection_special:
        ParentImage|endswith:
          - \csrss.exe
          - \certutil.exe
          - \eventvwr.exe
          - \calc.exe
          - \notepad.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/09/08
tags:
  - attack.defense_evasion
  - attack.t1036
  - DEMO
