
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Mstsc.EXE Execution From Uncommon Parent
id: ff3b6b39-e765-42f9-bb2c-ea6761e0e0f6
status: test
description: Detects potential RDP connection via Mstsc using a local ".rdp" file
    located in suspicious locations.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/18 16:22:41
references:
  - https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
  - https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_img:
      - Image|endswith: \mstsc.exe
      - OriginalFileName: mstsc.exe
    selection_parent:
        ParentImage|endswith:
          - \brave.exe
          - \CCleanerBrowser.exe
          - \chrome.exe
          - \chromium.exe
          - \firefox.exe
          - \iexplore.exe
          - \microsoftedge.exe
          - \msedge.exe
          - \opera.exe
          - \vivaldi.exe
          - \whale.exe
          - \outlook.exe
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/04/18
tags:
  - attack.lateral_movement
  - DEMO
