
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Schtasks Execution AppData Folder
id: c5c00f49-b3f9-45a6-997e-cfdecc6e1967
status: test
description: Detects the creation of a schtask that executes a file from C:\Users\<USER>\AppData\Local
author: pH-T (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/15 17:50:21
references:
  - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter
    filter:
        CommandLine|contains: /TN TVInstallRestore
        Image|endswith: \schtasks.exe
        ParentImage|contains|all:
          - \AppData\Local\Temp\
          - TeamViewer_.exe
    selection:
        CommandLine|contains:
          - NT AUT
          - ' SYSTEM '
        CommandLine|contains|all:
          - /Create
          - /RU
          - /TR
          - C:\Users\
          - \AppData\Local\
        Image|endswith: \schtasks.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/07/28
tags:
  - attack.execution
  - attack.persistence
  - attack.t1053.005
  - attack.t1059.001
  - DEMO
