
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DllUnregisterServer Function Call Via Msiexec.EXE
id: 84f52741-8834-4a8c-a413-2eb2269aa6c8
status: test
description: Detects MsiExec loading a DLL and calling its DllUnregisterServer function
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/24 18:47:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
  - https://lolbas-project.github.io/lolbas/Binaries/Msiexec/
  - https://twitter.com/_st0pp3r_/status/1583914515996897281
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_dll:
        CommandLine|contains: .dll
    selection_flag:
        CommandLine|contains|windash: ' -z '
    selection_img:
      - Image|endswith: \msiexec.exe
      - OriginalFileName: \msiexec.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2024/03/13
tags:
  - attack.defense_evasion
  - attack.t1218.007
  - DEMO
