
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Weak or Abused Passwords In CLI
id: 91edcfb1-2529-4ac2-9ecc-7617f895c7e4
status: test
description: |
    Detects weak passwords or often abused passwords (seen used by threat actors) via the CLI.
    An example would be a threat actor creating a new user via the net command and providing the password inline
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/14 13:36:21
references:
  - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/espionage-asia-governments
  - https://thedfirreport.com/2022/09/26/bumblebee-round-two/
  - https://www.microsoft.com/en-us/security/blog/2022/10/25/dev-0832-vice-society-opportunistic-ransomware-campaigns-impacting-us-education-sector/
  - https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - "123456789"
          - 123123qwE
          - Asd123.aaaa
          - Decryptme
          - P@ssw0rd!
          - Pass8080
          - password123
          - test@202
falsepositives:
  - Legitimate usage of the passwords by users via commandline (should be discouraged)
  - Other currently unknown false positives
level: medium
customer: 'demo'
modified: 2024/02/23
tags:
  - attack.defense_evasion
  - attack.execution
  - DEMO
