
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Discovery of a System Time
id: b243b280-65fe-48df-ba07-6ddea7646427
status: test
description: Identifies use of various commands to query a systems time. This technique
    may be used before executing a scheduled task or to discover the time zone of
    a target system.
author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/24 12:45:41
references:
  - https://eqllib.readthedocs.io/en/latest/analytics/fcdb99c2-ac3c-4bde-b664-4b336329bed2.html
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1124/T1124.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_time:
        CommandLine|contains: time
        Image|endswith:
          - \net.exe
          - \net1.exe
    selection_w32tm:
        CommandLine|contains: tz
        Image|endswith: \w32tm.exe
falsepositives: Legitimate use of the system utilities to discover system time for
    legitimate reason
level: low
customer: 'demo'
modified: 2022/06/28
tags:
  - attack.discovery
  - attack.t1124
  - DEMO
