
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious ZipExec Execution
id: 90dcf730-1b71-4ae7-9ffc-6fcf62bd0132
status: test
description: ZipExec is a Proof-of-Concept (POC) tool to wrap binary-based tools into
    a password-protected zip file.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/11/07 13:44:31
references:
  - https://twitter.com/SBousseaden/status/1451237393017839616
  - https://github.com/Tylous/ZipExec
logsource:
    category: process_creation
    product: windows
detection:
    condition: run or delete
    delete:
        CommandLine|contains|all:
          - /delete
          - Microsoft_Windows_Shell_ZipFolder:filename=
          - .zip
    run:
        CommandLine|contains|all:
          - /generic:Microsoft_Windows_Shell_ZipFolder:filename=
          - .zip
          - '/pass:'
          - '/user:'
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/12/25
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218
  - attack.t1202
  - DEMO
