
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PUA - Nmap/Zenmap Execution
id: f6ecd1cf-19b8-4488-97f6-00f0924991a3
status: test
description: Detects usage of namp/zenmap. Adversaries may attempt to get a listing
    of services running on remote hosts, including those that may be vulnerable to
    remote software exploitation
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/10 12:36:51
references:
  - https://nmap.org/
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md#atomic-test-3---port-scan-nmap-for-windows
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - Image|endswith:
          - \nmap.exe
          - \zennmap.exe
      - OriginalFileName:
          - nmap.exe
          - zennmap.exe
falsepositives: Legitimate administrator activity
level: medium
customer: 'demo'
modified: 2023/12/11
tags:
  - attack.discovery
  - attack.t1046
  - DEMO
