
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Process Creation Using Sysnative Folder
id: 3c1b5fb0-c72f-45ba-abd1-4d4c353144ab
status: test
description: Detects process creation events that use the Sysnative folder (common
    for CobaltStrike spawns)
author: Max Altgelt (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/23 16:28:41
references:
  - https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/
logsource:
    category: process_creation
    product: windows
detection:
    condition: sysnative
    sysnative:
      - CommandLine|contains: :\Windows\Sysnative\
      - Image|contains: :\Windows\Sysnative\
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/12/14
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1055
  - DEMO
