
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Program Names
id: efdd8dd5-cee8-4e59-9390-7d4d5e4dd6f6
status: test
description: Detects suspicious patterns in program names or folders that are often
    found in malicious samples or hacktools
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/11 12:35:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection*
    selection_commandline:
        CommandLine|contains:
          - inject.ps1
          - Invoke-CVE
          - pupy.ps1
          - payload.ps1
          - beacon.ps1
          - PowerView.ps1
          - bypass.ps1
          - obfuscated.ps1
          - obfusc.ps1
          - obfus.ps1
          - obfs.ps1
          - evil.ps1
          - MiniDogz.ps1
          - _enc.ps1
          - \shell.ps1
          - \rshell.ps1
          - revshell.ps1
          - \av.ps1
          - \av_test.ps1
          - adrecon.ps1
          - mimikatz.ps1
          - \PowerUp_
          - powerup.ps1
          - \Temp\a.ps1
          - \Temp\p.ps1
          - \Temp\1.ps1
          - Hound.ps1
          - encode.ps1
          - powercat.ps1
    selection_image:
      - Image|contains:
          - \CVE-202
          - \CVE202
      - Image|endswith:
          - \poc.exe
          - \artifact.exe
          - \artifact64.exe
          - \artifact_protected.exe
          - \artifact32.exe
          - \artifact32big.exe
          - obfuscated.exe
          - obfusc.exe
          - \meterpreter
fields:
  - CommandLine
  - ParentCommandLine
  - CurrentDirectory
falsepositives: Legitimate tools that accidentally match on the searched patterns
level: high
customer: 'demo'
modified: 2023/03/22
tags:
  - attack.execution
  - attack.t1059
  - DEMO
