
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Use of PsLogList
id: aae1243f-d8af-40d8-ab20-33fc6d0c55bc
status: test
description: Detects usage of the PsLogList utility to dump event log in order to
    extract admin accounts and perform account discovery or delete events logs
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/18 13:11:01
references:
  - https://research.nccgroup.com/2021/01/12/abusing-cloud-services-to-fly-under-the-radar/
  - https://www.cybereason.com/blog/deadringer-exposing-chinese-threat-actors-targeting-major-telcos
  - https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Sysinternals/PsLogList
  - https://twitter.com/EricaZelic/status/1614075109827874817
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli_eventlog:
        CommandLine|contains:
          - ' security'
          - ' application'
          - ' system'
    selection_cli_flags:
        CommandLine|contains|windash:
          - ' -d'
          - ' -x'
          - ' -s'
          - ' -c'
          - ' -g'
    selection_img:
      - OriginalFileName: psloglist.exe
      - Image|endswith:
          - \psloglist.exe
          - \psloglist64.exe
falsepositives:
  - Another tool that uses the command line switches of PsLogList
  - Legitimate use of PsLogList by an administrator
level: medium
customer: 'demo'
modified: 2024/03/05
tags:
  - attack.discovery
  - attack.t1087
  - attack.t1087.001
  - attack.t1087.002
  - DEMO
