
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Usage Of ShellExec_RunDLL
id: d87bd452-6da1-456e-8155-7dc988157b7d
related:
  - type: obsoletes
    id: 36c5146c-d127-4f85-8e21-01bf62355d5a
status: test
description: Detects suspicious usage of the ShellExec_RunDLL function to launch other
    commands as seen in the the raspberry-robin attack
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/01 15:22:21
references:
  - https://redcanary.com/blog/raspberry-robin/
  - https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/
  - https://github.com/SigmaHQ/sigma/issues/1009
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_openasrundll:
        CommandLine|contains: ShellExec_RunDLL
    selection_suspcli:
        CommandLine|contains:
          - regsvr32
          - msiexec
          - \Users\Public\
          - odbcconf
          - \Desktop\
          - \Temp\
          - Invoke-
          - iex
          - comspec
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/12/30
tags:
  - attack.defense_evasion
  - DEMO
