
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Compress Data and Lock With Password for Exfiltration With 7-ZIP
id: 9fbf5927-5261-4284-a71d-f681029ea574
status: test
description: An adversary may compress or encrypt data that is collected prior to
    exfiltration using 3rd party utilities
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/07/27 22:11:21
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_action:
        CommandLine|contains:
          - ' a '
          - ' u '
    selection_img:
      - Description|contains: 7-Zip
      - Image|endswith:
          - \7z.exe
          - \7zr.exe
          - \7za.exe
      - OriginalFileName:
          - 7z.exe
          - 7za.exe
    selection_password:
        CommandLine|contains: ' -p'
falsepositives: Legitimate activity is expected since compressing files with a password
    is common.
level: medium
customer: 'demo'
modified: 2023/03/13
tags:
  - attack.collection
  - attack.t1560.001
  - DEMO
