
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Regsvr32 Execution From Potential Suspicious Location
id: 9525dc73-0327-438c-8c04-13c0e037e9da
related:
  - type: obsoletes
    id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
status: experimental
description: Detects execution of regsvr32 where the DLL is located in a potentially
    suspicious location.
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/26 20:09:01
references:
  - https://web.archive.org/web/20171001085340/https://subt0x10.blogspot.com/2017/04/bypass-application-whitelisting-script.html
  - https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains:
          - :\ProgramData\
          - :\Temp\
          - :\Users\Public\
          - :\Windows\Temp\
          - \AppData\Local\Temp\
          - \AppData\Roaming\
    selection_img:
      - Image|endswith: \regsvr32.exe
      - OriginalFileName: REGSVR32.EXE
falsepositives: Some installers might execute "regsvr32" with DLLs located in %TEMP%
    or in %PROGRAMDATA%. Apply additional filters if necessary.
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218.010
  - DEMO
