
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: CMD Shell Output Redirect
id: 4f4eaa9f-5ad4-410c-a4be-bc6132b0175a
related:
  - type: similar
    id: 8e0bb260-d4b2-4fff-bb8d-3f82118e6892
status: test
description: Detects the use of the redirection character ">" to redicrect information
    in commandline
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/22 12:21:11
references:
  - https://ss64.com/nt/syntax-redirection.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_*
    filter_idm_extension:
        CommandLine|contains:
          - C:\Program Files (x86)\Internet Download Manager\IDMMsgHost.exe
          - chrome-extension://
          - \\.\pipe\chrome.nativeMessaging
    selection_cli:
        CommandLine|contains: '>'
    selection_cmd:
      - OriginalFileName: Cmd.Exe
      - Image|endswith: \cmd.exe
falsepositives: Internet Download Manager extensions use named pipes and redirection
    via CLI. Filter it out if you use it in your environment
level: low
customer: 'demo'
modified: 2023/03/07
tags:
  - attack.discovery
  - attack.t1082
  - DEMO
