
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Wlrmdr.EXE Uncommon Argument Or Child Process
id: 9cfc00b6-bfb7-49ce-9781-ef78503154bb
status: test
description: |
    Detects the execution of "Wlrmdr.exe" with the "-u" command line flag which allows anything passed to it to be an argument of the ShellExecute API, which would allow an attacker to execute arbitrary binaries.
    This detection also focuses on any uncommon child processes spawned from "Wlrmdr.exe" as a supplement for those that posses "ParentImage" telemetry.
author: frack113, manasmbellani
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/16 17:32:31
references:
  - https://twitter.com/0gtweet/status/1493963591745220608?s=20&t=xUg9DsZhJy1q9bPTUWgeIQ
  - https://lolbas-project.github.io/lolbas/Binaries/Wlrmdr/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_parent or (all of selection_child_* and not 1 of filter_main_*)
    filter_main_empty:
        ParentImage:
          - ""
          - '-'
    filter_main_null:
        ParentImage: []
    filter_main_winlogon:
        ParentImage: C:\Windows\System32\winlogon.exe
    selection_child_cli:
        CommandLine|contains|all|windash:
          - '-s '
          - '-f '
          - '-t '
          - '-m '
          - '-a '
          - '-u '
    selection_child_img:
      - Image|endswith: \wlrmdr.exe
      - OriginalFileName: WLRMNDR.EXE
    selection_parent:
        ParentImage|endswith: \wlrmdr.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2024/03/06
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
