
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Product Reconnaissance Via Wmic.EXE
id: 15434e33-5027-4914-88d5-3d4145ec25a9
status: test
description: Detects the execution of WMIC in order to get a list of firewall and
    antivirus products
author: Nasreddine Bencherchali
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/02/14 17:43:31
references:
  - https://thedfirreport.com/2023/03/06/2022-year-in-review/
  - https://www.yeahhub.com/list-installed-programs-version-path-windows/
  - https://learn.microsoft.com/en-us/answers/questions/253555/software-list-inventory-wmic-product
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains: Product
    selection_img:
      - Image|endswith: \wmic.exe
      - OriginalFileName: wmic.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.t1047
  - DEMO
