
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Encoded PowerShell Command Line
id: ca2092a1-c273-4878-9b4b-0d60115bf5ea
status: test
description: Detects suspicious powershell process starts with base64 encoded commands
    (e.g. Emotet)
author: Florian Roth (Nextron Systems), Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy,
    Anton Kutepov, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/09/03 17:10:11
references:
  - https://app.any.run/tasks/6217d77d-3189-4db2-a957-8ab239f3e01e
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_img and (all of selection_cli_* or selection_standalone)
        and not 1 of filter_optional_*
    filter_optional_remote_signed:
        CommandLine|contains: ' -ExecutionPolicy remotesigned '
    selection_cli_content:
        CommandLine|contains:
          - ' JAB'
          - ' SUVYI'
          - ' SQBFAFgA'
          - ' aQBlAHgA'
          - ' aWV4I'
          - ' IAA'
          - ' IAB'
          - ' UwB'
          - ' cwB'
    selection_cli_enc:
        CommandLine|contains: ' -e'
    selection_img:
      - Image|endswith:
          - \powershell.exe
          - \pwsh.exe
      - OriginalFileName:
          - PowerShell.EXE
          - pwsh.dll
    selection_standalone:
        CommandLine|contains:
          - '.exe -ENCOD '
          - ' BA^J e-'
level: high
customer: 'demo'
modified: 2023/04/06
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
