
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Windows Kernel Debugger Execution
id: 27ee9438-90dc-4bef-904b-d3ef927f5e7e
status: experimental
description: Detects execution of the Windows Kernel Debugger "kd.exe".
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/15 14:54:11
references:
  - Internal Research
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - Image|endswith: \kd.exe
      - OriginalFileName: kd.exe
falsepositives: Rare occasions of legitimate cases where kernel debugging is necessary
    in production. Investigation is required
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - DEMO
