
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Processes Spawned by WinRM
id: 5cc2cda8-f261-4d88-a2de-e9e193c86716
status: test
description: Detects suspicious processes including shells spawnd from WinRM host
    process
author: Andreas Hunkeler (@Karneades), Markus Neis
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/05/20 15:53:21
references:
  - Internal Research
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - \cmd.exe
          - \sh.exe
          - \bash.exe
          - \powershell.exe
          - \pwsh.exe
          - \wsl.exe
          - \schtasks.exe
          - \certutil.exe
          - \whoami.exe
          - \bitsadmin.exe
        ParentImage|endswith: \wsmprovhost.exe
falsepositives: Legitimate WinRM usage
level: high
customer: 'demo'
modified: 2022/07/14
tags:
  - attack.t1190
  - attack.initial_access
  - attack.persistence
  - attack.privilege_escalation
  - DEMO
