
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Curl.EXE Download
id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
related:
  - type: derived
    id: bbeaed61-1990-4773-bf57-b81dbad7db2d
  - type: similar
    id: 9a517fca-4ba3-4629-9278-a68694697b81
status: test
description: Detects a suspicious curl process start on Windows and outputs the requested
    document to a local file
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/07/03 13:20:51
references:
  - https://twitter.com/max_mal_/status/1542461200797163522
  - https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464
  - https://github.com/pr0xylife/Qakbot/blob/4f0795d79dabee5bc9dd69f17a626b48852e7869/Qakbot_AA_23.06.2022.txt
  - https://www.volexity.com/blog/2022/07/28/sharptongue-deploys-clever-mail-stealing-browser-extension-sharpext/
  - https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1105/T1105.md#atomic-test-18---curl-download-file
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_curl and 1 of selection_susp_* and not 1 of filter_optional_*
    filter_optional_git_windows:
        CommandLine|contains|all:
          - '--silent --show-error --output '
          - gfw-httpget-
          - AppData
        Image: C:\Program Files\Git\mingw64\bin\curl.exe
        ParentImage: C:\Program Files\Git\usr\bin\sh.exe
    selection_curl:
      - Image|endswith: \curl.exe
      - Product: The curl executable
    selection_susp_extensions:
        CommandLine|endswith:
          - .dll
          - .gif
          - .jpeg
          - .jpg
          - .png
          - .temp
          - .tmp
          - .txt
          - .vbe
          - .vbs
    selection_susp_locations:
        CommandLine|contains:
          - '%AppData%'
          - '%Public%'
          - '%Temp%'
          - '%tmp%'
          - \AppData\
          - \Desktop\
          - \Temp\
          - \Users\Public\
          - C:\PerfLogs\
          - C:\ProgramData\
          - C:\Windows\Temp\
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/21
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
