
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Cscript/Wscript Uncommon Script Extension Execution
id: 99b7460d-c9f1-40d7-a316-1f36f61d52ee
status: experimental
description: Detects Wscript/Cscript executing a file with an uncommon (i.e. non-script)
    extension
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/15 19:58:11
references:
  - Internal Research
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_extension:
        CommandLine|contains:
          - .csv
          - .dat
          - .doc
          - .gif
          - .jpeg
          - .jpg
          - .png
          - .ppt
          - .txt
          - .xls
          - .xml
    selection_img:
      - OriginalFileName:
          - wscript.exe
          - cscript.exe
      - Image|endswith:
          - \wscript.exe
          - \cscript.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/06/19
tags:
  - attack.execution
  - attack.t1059.005
  - attack.t1059.007
  - DEMO
