
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Msbuild Execution By Uncommon Parent Process
id: 33be4333-2c6b-44f4-ae28-102cdbde0a31
status: test
description: Detects suspicious execution of 'Msbuild.exe' by a uncommon parent process
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/11/17 20:47:11
references:
  - https://app.any.run/tasks/abdf586e-df0c-4d39-89a7-06bf24913401/
  - https://www.echotrail.io/insights/search/msbuild.exe
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter_parent
    filter_parent:
        ParentImage|endswith:
          - \devenv.exe
          - \cmd.exe
          - \msbuild.exe
          - \python.exe
          - \explorer.exe
          - \nuget.exe
    selection:
      - Image|endswith: \MSBuild.exe
      - OriginalFileName: MSBuild.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - DEMO
