
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - SysmonEOP Execution
id: 8a7e90c5-fe6e-45dc-889e-057fe4378bd9
status: test
description: Detects the execution of the PoC that can be used to exploit Sysmon CVE-2022-41120
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/04 13:39:11
references:
  - https://github.com/Wh04m1001/SysmonEoP
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_hash:
      - Hashes:
          - IMPHASH=22F4089EB8ABA31E1BB162C6D9BF72E5
          - IMPHASH=5123FA4C4384D431CD0D893EEB49BBEC
      - Imphash:
          - 22f4089eb8aba31e1bb162c6d9bf72e5
          - 5123fa4c4384d431cd0d893eeb49bbec
    selection_img:
        Image|endswith: \SysmonEOP.exe
falsepositives: Unlikely
level: critical
customer: 'demo'
modified: 2023/02/04
tags:
  - cve.2022.41120
  - attack.t1068
  - attack.privilege_escalation
  - DEMO
