
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Execute MSDT Via Answer File
id: 9c8c7000-3065-44a8-a555-79bcba5d9955
status: test
description: Detects execution of "msdt.exe" using an answer file which is simulating
    the legitimate way of calling msdt via "pcwrun.exe" (For example from the compatibility
    tab)
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/13 12:49:51
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Msdt/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection* and not filter
    filter:
        ParentImage|endswith: \pcwrun.exe
    selection_answer:
        CommandLine|contains:
          - ' -af '
          - ' /af '
    selection_cli:
        CommandLine|contains: \WINDOWS\diagnostics\index\PCWDiagnostic.xml
        Image|endswith: \msdt.exe
falsepositives: Possible undocumented parents of "msdt" other than "pcwrun"
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218
  - attack.execution
  - DEMO
