
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Regsvr32 Execution From Highly Suspicious Location
id: 327ff235-94eb-4f06-b9de-aaee571324be
status: experimental
description: Detects execution of regsvr32 where the DLL is located in a highly suspicious
    locations
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/26 19:13:51
references:
  - Internal Research
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_img and (selection_path_1 or (selection_path_2 and not selection_exclude_known_dirs))
        and not 1 of filter_main_*
    filter_main_empty:
        CommandLine: ""
    filter_main_null:
        CommandLine: []
    selection_exclude_known_dirs:
        CommandLine|contains:
          - C:\Program Files (x86)\
          - C:\Program Files\
          - C:\ProgramData\
          - C:\Users\
          - ' C:\Windows\'
          - ' "C:\Windows\'
          - ' ''C:\Windows\'
    selection_img:
      - Image|endswith: \regsvr32.exe
      - OriginalFileName: REGSVR32.EXE
    selection_path_1:
        CommandLine|contains:
          - :\PerfLogs\
          - :\Temp\
          - \Windows\Registration\CRMLog
          - \Windows\System32\com\dmp\
          - \Windows\System32\FxsTmp\
          - \Windows\System32\Microsoft\Crypto\RSA\MachineKeys\
          - \Windows\System32\spool\drivers\color\
          - \Windows\System32\spool\PRINTERS\
          - \Windows\System32\spool\SERVERS\
          - \Windows\System32\Tasks_Migrated\
          - \Windows\System32\Tasks\Microsoft\Windows\SyncCenter\
          - \Windows\SysWOW64\com\dmp\
          - \Windows\SysWOW64\FxsTmp\
          - \Windows\SysWOW64\Tasks\Microsoft\Windows\PLA\System\
          - \Windows\SysWOW64\Tasks\Microsoft\Windows\SyncCenter\
          - \Windows\Tasks\
          - \Windows\Tracing\
    selection_path_2:
        CommandLine|contains:
          - ' "C:\'
          - ' C:\'
          - ' ''C:\'
          - D:\
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218.010
  - DEMO
