
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Process Memory Dump Via Comsvcs.DLL
id: 646ea171-dded-4578-8a4d-65e9822892e3
related:
  - type: obsoletes
    id: 09e6d5c0-05b8-4ff8-9eeb-043046ec774c
status: test
description: Detects a process memory dump via "comsvcs.dll" using rundll32, covering
    multiple different techniques (ordinal, minidump function, etc.)
author: Florian Roth (Nextron Systems), Modexp, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/02/18 14:51:41
references:
  - https://twitter.com/shantanukhande/status/1229348874298388484
  - https://twitter.com/pythonresponder/status/1385064506049630211?s=21
  - https://twitter.com/Hexacorn/status/1224848930795552769
  - https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/
  - https://twitter.com/SBousseaden/status/1167417096374050817
  - https://twitter.com/Wietze/status/1542107456507203586
  - https://github.com/Hackndo/lsassy/blob/14d8f8ae596ecf22b449bfe919829173b8a07635/lsassy/dumpmethod/comsvcs.py
logsource:
    category: process_creation
    product: windows
detection:
    condition: (selection_img and 1 of selection_cli_*) or selection_generic
    selection_cli_1:
        CommandLine|contains:
          - '#-'
          - '#+'
          - '#24'
          - '24 '
          - MiniDump
        CommandLine|contains|all:
          - comsvcs
          - full
    selection_generic:
        CommandLine|contains:
          - ' #'
          - ',#'
          - ', #'
        CommandLine|contains|all:
          - "24"
          - comsvcs
          - full
    selection_img:
      - Image|endswith: \rundll32.exe
      - OriginalFileName: RUNDLL32.EXE
      - CommandLine|contains: rundll32
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/05/16
tags:
  - attack.defense_evasion
  - attack.credential_access
  - attack.t1036
  - attack.t1003.001
  - car.2013-05-009
  - DEMO
