
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Service Path Modification
id: 138d3531-8793-4f50-a2cd-f291b2863d78
status: test
description: Detects service path modification via the "sc" binary to a suspicious
    command or path
author: Victor Sergeev, oscd.community, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/21 15:48:31
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md
  - https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - powershell
          - 'cmd '
          - mshta
          - wscript
          - cscript
          - rundll32
          - svchost
          - dllhost
          - cmd.exe /c
          - cmd.exe /k
          - cmd.exe /r
          - cmd /c
          - cmd /k
          - cmd /r
          - C:\Users\Public
          - \Downloads\
          - \Desktop\
          - \Microsoft\Windows\Start Menu\Programs\Startup\
          - C:\Windows\TEMP\
          - \AppData\Local\Temp
        CommandLine|contains|all:
          - config
          - binPath
        Image|endswith: \sc.exe
fields:
  - CommandLine
  - ParentCommandLine
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2022/11/18
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1543.003
  - DEMO
