
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Python Spawning Pretty TTY on Windows
id: 480e7e51-e797-47e3-8d72-ebfce65b6d8d
related:
  - type: derived
    id: 899133d5-4d7c-4a7f-94ee-27355c879d90
status: test
description: Detects python spawning a pretty tty
author: Nextron Systems
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/03 15:45:41
references:
  - https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_img and 1 of selection_cli_*
    selection_cli_1:
        CommandLine|contains|all:
          - import pty
          - .spawn(
    selection_cli_2:
        CommandLine|contains: from pty import spawn
    selection_img:
        Image|endswith:
          - python.exe
          - python3.exe
          - python2.exe
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.execution
  - attack.t1059
  - DEMO
