
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Monitoring For Persistence Via BITS
id: b9cbbc17-d00d-4e3d-a827-b06d03d2380d
status: test
description: |
    BITS will allow you to schedule a command to execute after a successful download to notify you that the job is finished.
    When the job runs on the system the command specified in the BITS job will be executed.
    This can be abused by actors to create a backdoor within the system and for persistence.
    It will be chained in a BITS job to schedule the download of malware/additional binaries and execute the program after being downloaded.
author: Sreeman
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/29 14:59:21
references:
  - https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
  - http://0xthem.blogspot.com/2014/03/t-emporal-persistence-with-and-schtasks.html
  - https://isc.sans.edu/diary/Wipe+the+drive+Stealthy+Malware+Persistence+Mechanism+-+Part+1/15394
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_img and (all of selection_cli_notify_* or all of selection_cli_add_*)
    selection_cli_add_1:
        CommandLine|contains: /Addfile
    selection_cli_add_2:
        CommandLine|contains:
          - 'http:'
          - 'https:'
          - 'ftp:'
          - 'ftps:'
    selection_cli_notify_1:
        CommandLine|contains: /SetNotifyCmdLine
    selection_cli_notify_2:
        CommandLine|contains:
          - '%COMSPEC%'
          - cmd.exe
          - regsvr32.exe
    selection_img:
      - Image|endswith: \bitsadmin.exe
      - OriginalFileName: bitsadmin.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2024/01/25
tags:
  - attack.defense_evasion
  - attack.t1197
  - DEMO
