
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - Rubeus Execution
id: 7ec2c172-dceb-4c10-92c9-87c1881b7e18
related:
  - type: similar
    id: 7ec2c172-dceb-4c10-92c9-87c1881b7e18
status: stable
description: Detects the execution of the hacktool Rubeus via PE information of command
    line parameters
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/12/19 12:58:01
references:
  - https://blog.harmj0y.net/redteaming/from-kekeo-to-rubeus
  - https://m0chan.github.io/2019/07/31/How-To-Attack-Kerberos-101.html
  - https://github.com/GhostPack/Rubeus
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - Image|endswith: \Rubeus.exe
      - OriginalFileName: Rubeus.exe
      - Description: Rubeus
      - CommandLine|contains:
          - 'asreproast '
          - 'dump /service:krbtgt '
          - dump /luid:0x
          - 'kerberoast '
          - 'createnetonly /program:'
          - 'ptt /ticket:'
          - '/impersonateuser:'
          - 'renew /ticket:'
          - 'asktgt /user:'
          - 'harvest /interval:'
          - 's4u /user:'
          - 's4u /ticket:'
          - 'hash /password:'
          - 'golden /aes256:'
          - 'silver /user:'
falsepositives: Unlikely
level: critical
customer: 'demo'
modified: 2023/04/20
tags:
  - attack.credential_access
  - attack.t1003
  - attack.t1558.003
  - attack.lateral_movement
  - attack.t1550.003
  - DEMO
