
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Where Execution
id: 725a9768-0f5e-4cb3-aec2-bc5719c6831a
status: test
description: |
    Adversaries may enumerate browser bookmarks to learn more about compromised hosts.
    Browser bookmarks may reveal personal information about users (ex: banking sites, interests, social media, etc.) as well as details about
    internal network resources such as servers, tools/dashboards, or other related infrastructure.
author: frack113, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/13 13:13:01
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of where_*
    where_exe:
      - Image|endswith: \where.exe
      - OriginalFileName: where.exe
    where_opt:
        CommandLine|contains:
          - places.sqlite
          - cookies.sqlite
          - formhistory.sqlite
          - logins.json
          - key4.db
          - key3.db
          - sessionstore.jsonlz4
          - History
          - Bookmarks
          - Cookies
          - Login Data
falsepositives: Unknown
level: low
customer: 'demo'
modified: 2022/06/29
tags:
  - attack.discovery
  - attack.t1217
  - DEMO
