
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Lolbin Ssh.exe Use As Proxy
id: 7d6d30b8-5b91-4b90-a891-46cccaf29598
status: test
description: Detect usage of the "ssh.exe" binary as a proxy to launch other programs
author: frack113, Nasreddine Bencherchali
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/29 12:45:31
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Ssh/
  - https://github.com/LOLBAS-Project/LOLBAS/pull/211/files
  - https://gtfobins.github.io/gtfobins/ssh/
  - https://man.openbsd.org/ssh_config#ProxyCommand
  - https://man.openbsd.org/ssh_config#LocalCommand
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_parent or all of selection_cli_*
    selection_cli_flags:
      - CommandLine|contains: ProxyCommand=
      - CommandLine|contains|all:
          - PermitLocalCommand
          - LocalCommand
    selection_cli_img:
        Image|endswith: \ssh.exe
    selection_parent:
        ParentImage: C:\Windows\System32\OpenSSH\sshd.exe
falsepositives: Legitimate usage for administration purposes
level: medium
customer: 'demo'
modified: 2023/01/25
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
