
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Sideloading Link.EXE
id: 6e968eb1-5f05-4dac-94e9-fd0c5cb49fd6
status: test
description: Detects the execution utitilies often found in Visual Studio tools that
    hardcode the call to the binary "link.exe". They can be abused to sideload any
    binary with the same name
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/22 11:04:11
references:
  - https://twitter.com/0gtweet/status/1560732860935729152
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_*
    filter_visual_studio:
        ParentImage|contains: \VC\Tools\MSVC\
        ParentImage|startswith:
          - C:\Program Files\Microsoft Visual Studio\
          - C:\Program Files (x86)\Microsoft Visual Studio\
    selection:
        CommandLine|contains: LINK /
        Image|endswith: \link.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
