
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Mstsc.EXE Execution With Local RDP File
id: 5fdce3ac-e7f9-4ecd-a3aa-a4d78ebbf0af
status: test
description: Detects potential RDP connection via Mstsc using a local ".rdp" file
author: Nasreddine Bencherchali (Nextron Systems), Christopher Peacock @securepeacock
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/18 15:29:51
references:
  - https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
  - https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_optional_*
    filter_optional_wsl:
        CommandLine|contains: C:\ProgramData\Microsoft\WSL\wslg.rdp
        ParentImage: C:\Windows\System32\lxss\wslhost.exe
    selection_cli:
        CommandLine|endswith:
          - .rdp
          - .rdp"
    selection_img:
      - Image|endswith: \mstsc.exe
      - OriginalFileName: mstsc.exe
falsepositives: Likely with legitimate usage of ".rdp" files
level: low
customer: 'demo'
modified: 2023/04/30
tags:
  - attack.command_and_control
  - attack.t1219
  - DEMO
