
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Child Process Of BgInfo.EXE
id: 811f459f-9231-45d4-959a-0266c6311987
related:
  - type: similar
    id: aaf46cdc-934e-4284-b329-34aa701e3771
status: experimental
description: Detects suspicious child processes of "BgInfo.exe" which could be a sign
    of potential abuse of the binary to proxy execution via external VBScript
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/16 15:34:01
references:
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Bginfo/
  - https://oddvar.moe/2017/05/18/bypassing-application-whitelisting-with-bginfo/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_child:
      - Image|endswith:
          - \calc.exe
          - \cmd.exe
          - \cscript.exe
          - \mshta.exe
          - \notepad.exe
          - \powershell.exe
          - \pwsh.exe
          - \wscript.exe
      - Image|contains:
          - \AppData\Local\
          - \AppData\Roaming\
          - :\Users\Public\
          - :\Temp\
          - :\Windows\Temp\
          - :\PerfLogs\
    selection_parent:
        ParentImage|endswith:
          - \bginfo.exe
          - \bginfo64.exe
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.execution
  - attack.t1059.005
  - attack.defense_evasion
  - attack.t1218
  - attack.t1202
  - DEMO
