
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Private Keys Reconnaissance Via CommandLine Tools
id: 213d6a77-3d55-4ce8-ba74-fcfef741974e
status: test
description: Adversaries may search for private key certificate files on compromised
    systems for insecurely stored credential
author: frack113, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/07/20 18:57:51
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.004/T1552.004.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_ext and (all of selection_cmd_* or all of selection_pwsh_*
        or selection_findstr)
    selection_cmd_cli:
        CommandLine|contains: 'dir '
    selection_cmd_img:
      - Image|endswith: \cmd.exe
      - OriginalFileName: Cmd.Exe
    selection_ext:
        CommandLine|contains:
          - .key
          - .pgp
          - .gpg
          - .ppk
          - .p12
          - .pem
          - .pfx
          - .cer
          - .p7b
          - .asc
    selection_findstr:
      - Image|endswith: \findstr.exe
      - OriginalFileName: FINDSTR.EXE
    selection_pwsh_cli:
        CommandLine|contains: 'Get-ChildItem '
    selection_pwsh_img:
      - Image|endswith:
          - \powershell.exe
          - \pwsh.exe
      - OriginalFileName:
          - PowerShell.EXE
          - pwsh.dll
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/03/06
tags:
  - attack.credential_access
  - attack.t1552.004
  - DEMO
