
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Password Provided In Command Line Of Net.EXE
id: d4498716-1d52-438f-8084-4a603157d131
status: test
description: Detects a when net.exe is called with a password in the command line
author: Tim Shelton (HAWK.IO)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/09 16:49:41
references:
  - Internal Research
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_main_*
    filter_main_empty:
        CommandLine|endswith: ' '
    selection_cli:
        CommandLine|contains|all:
          - ' use '
          - :*\\
          - /USER:* *
    selection_img:
      - Image|endswith:
          - \net.exe
          - \net1.exe
      - OriginalFileName:
          - net.exe
          - net1.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/02/21
tags:
  - attack.defense_evasion
  - attack.initial_access
  - attack.persistence
  - attack.privilege_escalation
  - attack.lateral_movement
  - attack.t1021.002
  - attack.t1078
  - DEMO
