
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Meterpreter/CobaltStrike Activity
id: 15619216-e993-4721-b590-4c520615a67d
status: test
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
    a specific service starting
author: Teymur Kheirkhabarov, Ecco, Florian Roth
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/26 17:55:01
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
  - https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_img and 1 of selection_technique_* and not 1 of filter_*
    filter_defender:
        CommandLine|contains: MpCmdRun
    selection_img:
        ParentImage|endswith: \services.exe
    selection_technique_1:
        CommandLine|contains:
          - cmd
          - '%COMSPEC%'
        CommandLine|contains|all:
          - /c
          - echo
          - \pipe\
    selection_technique_2:
        CommandLine|contains|all:
          - rundll32
          - .dll,a
          - '/p:'
fields:
  - ComputerName
  - User
  - CommandLine
falsepositives:
  - Commandlines containing components like cmd accidentally
  - Jobs and services started with cmd
level: high
customer: 'demo'
modified: 2023/02/05
tags:
  - attack.privilege_escalation
  - attack.t1134.001
  - attack.t1134.002
  - DEMO
