
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Kernel Dump Using Dtrace
id: 7124aebe-4cd7-4ccb-8df0-6d6b93c96795
status: test
description: Detects suspicious way to dump the kernel on Windows systems using dtrace.exe,
    which is available on Windows systems since Windows 10 19H1
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/28 15:15:51
references:
  - https://twitter.com/0gtweet/status/1474899714290208777?s=12
  - https://docs.microsoft.com/en-us/windows-hardware/drivers/devtest/dtrace
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection*
    selection_obfuscated:
        CommandLine|contains|all:
          - syscall:::return
          - lkd(
    selection_plain:
        CommandLine|contains: lkd(0)
        Image|endswith: \dtrace.exe
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.discovery
  - attack.t1082
  - DEMO
