
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Persistence Attempt Via Run Keys Using Reg.EXE
id: de587dce-915e-4218-aac4-835ca6af6f70
status: test
description: Detects suspicious command line reg.exe tool adding key to RUN key in
    Registry
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/06/28 20:17:31
references:
  - https://app.any.run/tasks/9c0f37bc-867a-4314-b685-e101566766d7/
  - https://docs.microsoft.com/en-us/windows/win32/setupapi/run-and-runonce-registry-keys
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - reg
          - ' ADD '
          - Software\Microsoft\Windows\CurrentVersion\Run
falsepositives:
  - Legitimate software automatically (mostly, during installation) sets up autorun
    keys for legitimate reasons.
  - Legitimate administrator sets up autorun keys for legitimate reasons.
  - Discord
level: medium
customer: 'demo'
modified: 2023/01/30
tags:
  - attack.persistence
  - attack.t1547.001
  - DEMO
