
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - Hashcat Password Cracker Execution
id: 39b31e81-5f5f-4898-9c0e-2160cfc0f9bf
status: test
description: Execute Hashcat.exe with provided SAM file from registry of Windows and
    Password list to crack against
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/27 17:38:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1110.002/T1110.002.md#atomic-test-1---password-cracking-with-hashcat
  - https://hashcat.net/wiki/doku.php?id=hashcat
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_cli:
        CommandLine|contains|all:
          - '-a '
          - '-m 1000 '
          - '-r '
    selection_img:
        Image|endswith: \hashcat.exe
falsepositives: Tools that use similar command line flags and values
level: high
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.credential_access
  - attack.t1110.002
  - DEMO
