
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DumpMinitool Execution
id: dee0a7a3-f200-4112-a99b-952196d81e42
status: test
description: Detects the use of "DumpMinitool.exe" a tool that allows the dump of
    process memory via the use of the "MiniDumpWriteDump"
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/06 12:11:31
references:
  - https://twitter.com/mrd0x/status/1511415432888131586
  - https://twitter.com/mrd0x/status/1511489821247684615
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/DumpMinitool/
  - https://gist.github.com/nasbench/6d58c3c125e2fa1b8f7a09754c1b087f
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains:
          - ' Full'
          - ' Mini'
          - ' WithHeap'
    selection_img:
      - Image|endswith:
          - \DumpMinitool.exe
          - \DumpMinitool.x86.exe
          - \DumpMinitool.arm64.exe
      - OriginalFileName:
          - DumpMinitool.exe
          - DumpMinitool.x86.exe
          - DumpMinitool.arm64.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/04/12
tags:
  - attack.defense_evasion
  - attack.t1036
  - attack.t1003.001
  - DEMO
