
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Command Patterns In Scheduled Task Creation
id: f2c64357-b1d2-41b7-849f-34d2682c0fad
status: experimental
description: Detects scheduled task creation using "schtasks" that contain potentially
    suspicious or uncommon commands
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/23 20:17:11
references:
  - https://app.any.run/tasks/512c1352-6380-4436-b27d-bb62f0c020d6/
  - https://twitter.com/RedDrip7/status/1506480588827467785
  - https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/devil-bait/NCSC-MAR-Devil-Bait.pdf
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_schtasks and ( all of selection_pattern_* or selection_uncommon
        or all of selection_anomaly_* )
    selection_anomaly_1:
        CommandLine|contains:
          - :\Windows\Temp\
          - \AppData\
          - '%AppData%'
          - '%Temp%'
          - '%tmp%'
    selection_anomaly_2:
        CommandLine|contains:
          - cscript
          - curl
          - wscript
    selection_pattern_1:
        CommandLine|contains:
          - '/sc minute '
          - '/ru system '
    selection_pattern_2:
        CommandLine|contains:
          - cmd /c
          - cmd /k
          - cmd /r
          - 'cmd.exe /c '
          - 'cmd.exe /k '
          - 'cmd.exe /r '
    selection_schtasks:
        CommandLine|contains: '/Create '
        Image|endswith: \schtasks.exe
    selection_uncommon:
        CommandLine|contains:
          - ' -decode '
          - ' -enc '
          - ' -w hidden '
          - ' bypass '
          - ' IEX'
          - .DownloadData
          - .DownloadFile
          - .DownloadString
          - '/c start /min '
          - FromBase64String
          - mshta http
          - mshta.exe http
falsepositives: Software installers that run from temporary folders and also install
    scheduled tasks are expected to generate some false positives
level: high
customer: 'demo'
modified: 2023/12/21
tags:
  - attack.execution
  - attack.t1053.005
  - DEMO
