
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PDQ Deploy Remote Adminstartion Tool Execution
id: d679950c-abb7-43a6-80fb-2a480c4fc450
related:
  - type: similar
    id: 12b8e9f5-96b2-41e1-9a42-8c6779a5c184
status: test
description: Detect use of PDQ Deploy remote admin tool
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/01 18:07:31
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/9e5b12c4912c07562aec7500447b11fa3e17e254/atomics/T1072/T1072.md
  - https://www.pdq.com/pdq-deploy/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - Description: PDQ Deploy Console
      - Product: PDQ Deploy
      - Company: PDQ.com
      - OriginalFileName: PDQDeployConsole.exe
falsepositives: Legitimate use
level: medium
customer: 'demo'
modified: 2023/01/30
tags:
  - attack.execution
  - attack.lateral_movement
  - attack.t1072
  - DEMO
