
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: File Download Via Bitsadmin
id: d059842b-6b9d-4ed1-b5c3-5b89143c6ede
status: test
description: Detects usage of bitsadmin downloading a file
author: Michael Haag, FPT.EagleEye
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/03/09 12:59:11
references:
  - https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
  - https://isc.sans.edu/diary/22264
  - https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_img and (selection_cmd or all of selection_cli_*)
    selection_cli_1:
        CommandLine|contains:
          - ' /create '
          - ' /addfile '
    selection_cli_2:
        CommandLine|contains: http
    selection_cmd:
        CommandLine|contains: ' /transfer '
    selection_img:
      - Image|endswith: \bitsadmin.exe
      - OriginalFileName: bitsadmin.exe
fields:
  - CommandLine
  - ParentCommandLine
falsepositives: Some legitimate apps use this, but limited.
level: medium
customer: 'demo'
modified: 2023/02/15
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.t1197
  - attack.s0190
  - attack.t1036.003
  - DEMO
