
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: UAC Bypass via ICMLuaUtil
id: 49f2f17b-b4c8-4172-a68b-d5bf95d05130
status: test
description: Detects the pattern of UAC Bypass using ICMLuaUtil Elevated COM interface
author: Florian Roth (Nextron Systems), Elastic (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/13 12:03:21
references:
  - https://www.elastic.co/guide/en/security/current/uac-bypass-via-icmluautil-elevated-com-interface.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter
    filter:
      - Image|endswith: \WerFault.exe
      - OriginalFileName: WerFault.exe
    selection:
        ParentCommandLine|contains:
          - /Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}
          - /Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}
        ParentImage|endswith: \dllhost.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/09/27
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1548.002
  - DEMO
