
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PUA - Ngrok Execution
id: ee37eb7c-a4e7-4cd5-8fa4-efa27f1c3f31
status: test
description: |
    Detects the use of Ngrok, a utility used for port forwarding and tunneling, often used by threat actors to make local protected services publicly available.
    Involved domains are bin.equinox.io for download and *.ngrok.io for connections.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/05/14 11:05:21
references:
  - https://ngrok.com/docs
  - https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html
  - https://stackoverflow.com/questions/42442320/ssh-tunnel-to-ngrok-and-initiate-rdp
  - https://www.virustotal.com/gui/file/58d21840d915aaf4040ceb89522396124c82f325282f805d1085527e1e2ccfa1/detection
  - https://cybleinc.com/2021/02/15/ngrok-platform-abused-by-hackers-to-deliver-a-new-wave-of-phishing-attacks/
  - https://twitter.com/xorJosh/status/1598646907802451969
  - https://www.softwaretestinghelp.com/how-to-use-ngrok/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection*
    selection1:
        CommandLine|contains:
          - ' tcp 139'
          - ' tcp 445'
          - ' tcp 3389'
          - ' tcp 5985'
          - ' tcp 5986'
    selection2:
        CommandLine|contains|all:
          - ' start '
          - --all
          - --config
          - .yml
    selection3:
        CommandLine|contains:
          - ' tcp '
          - ' http '
          - ' authtoken '
        Image|endswith: ngrok.exe
    selection4:
        CommandLine|contains:
          - '.exe authtoken '
          - .exe start --all
falsepositives:
  - Another tool that uses the command line switches of Ngrok
  - Ngrok http 3978 (https://docs.microsoft.com/en-us/azure/bot-service/bot-service-debug-channel-ngrok?view=azure-bot-service-4.0)
level: high
customer: 'demo'
modified: 2023/02/21
tags:
  - attack.command_and_control
  - attack.t1572
  - DEMO
