
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Deny Service Access Using Security Descriptor Tampering Via Sc.EXE
id: 99cf1e02-00fb-4c0d-8375-563f978dfd37
related:
  - type: similar
    id: 98c5aeef-32d5-492f-b174-64a691896d25
  - type: similar
    id: a537cfc3-4297-4789-92b5-345bfd845ad0
status: test
description: Detects suspicious DACL modifications to deny access to a service that
    affects critical trustees. This can be used to hide services or make them unstoppable.
author: Jonhnathan Ribeiro, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/16 22:52:51
references:
  - https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
  - https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
  - https://learn.microsoft.com/en-us/windows/win32/secauthz/sid-strings
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_sc:
      - Image|endswith: \sc.exe
      - OriginalFileName: sc.exe
    selection_sdset:
        CommandLine|contains|all:
          - sdset
          - D;
    selection_trustee:
        CommandLine|contains:
          - ;IU
          - ;SU
          - ;BA
          - ;SY
          - ;WD
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/28
tags:
  - attack.persistence
  - attack.t1543.003
  - DEMO
