
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Winrar Execution in Non-Standard Folder
id: 4ede543c-e098-43d9-a28f-dd784a13132f
status: test
description: Detects a suspicious winrar execution in a folder which is not the default
    installation folder
author: Florian Roth (Nextron Systems), Tigzy
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/11/17 16:13:51
references:
  - https://twitter.com/cyb3rops/status/1460978167628406785
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_path:
        Image|contains:
          - :\Program Files (x86)\WinRAR\
          - :\Program Files\WinRAR\
    filter_main_unrar:
        Image|endswith: \UnRAR.exe
    filter_optional_temp:
        Image|contains: :\Windows\Temp\
    selection:
      - Image|endswith:
          - \rar.exe
          - \winrar.exe
      - Description: Command line RAR
falsepositives: Legitimate use of WinRAR in a folder of a software that bundles WinRAR
level: medium
customer: 'demo'
modified: 2023/08/31
tags:
  - attack.collection
  - attack.t1560.001
  - DEMO
