
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Arbitrary Code Execution Via Node.EXE
id: 6640f31c-01ad-49b5-beb5-83498a5cd8bd
status: test
description: Detects the execution node.exe which is shipped with multiple software
    such as VMware, Adobe...etc. In order to execute arbitrary code. For example to
    establish reverse shell as seen in Log4j attacks...etc
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/09 18:00:51
references:
  - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
  - https://www.sprocketsecurity.com/resources/crossing-the-log4j-horizon-a-vulnerability-with-no-return
  - https://www.rapid7.com/blog/post/2022/01/18/active-exploitation-of-vmware-horizon-servers/
  - https://nodejs.org/api/cli.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and 1 of action_*
    action_reverse_shell:
        CommandLine|contains|all:
          - .exec(
          - net.socket
          - .connect
          - child_process
    selection:
        CommandLine|contains:
          - ' -e '
          - ' --eval '
        Image|endswith: \node.exe
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/02/03
tags:
  - attack.defense_evasion
  - attack.t1127
  - DEMO
