
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Regsvr32 DLL Execution With Uncommon Extension
id: 50919691-7302-437f-8e10-1fe088afa145
status: test
description: Detects a "regsvr32" execution where the DLL doesn't contain a common
    file extension.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/07/17 17:52:31
references:
  - https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_empty_4688:
        CommandLine: ""
    filter_main_legit_ext:
        CommandLine|contains:
          - .ax
          - .cpl
          - .dll
          - .ocx
    filter_main_null_4688:
        CommandLine: []
    filter_optional_avg:
        CommandLine|contains: .bav
    filter_optional_pascal:
        CommandLine|contains: .ppl
    selection:
      - Image|endswith: \regsvr32.exe
      - OriginalFileName: REGSVR32.EXE
falsepositives: Other legitimate extensions currently not in the list either from
    third party or specific Windows components.
level: medium
customer: 'demo'
modified: 2023/05/24
tags:
  - attack.defense_evasion
  - attack.t1574
  - attack.execution
  - DEMO
