
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: LOL-Binary Copied From System Directory
id: f5d19838-41b5-476c-98d8-ba8af4929ee2
related:
  - type: derived
    id: fff9d2b7-e11c-4a69-93d3-40ef66189767
status: experimental
description: |
    Detects a suspicious copy operation that tries to copy a known LOLBIN from system (System32, SysWOW64, WinSxS) directories to another on disk in order to bypass detections based on locations.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/29 16:01:51
references:
  - https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120
  - https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
  - https://thedfirreport.com/2023/08/28/html-smuggling-leads-to-domain-wide-ransomware/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_tools_* and all of selection_target_*
    selection_target_lolbin:
        CommandLine|contains:
          - \bitsadmin.exe
          - \calc.exe
          - \certutil.exe
          - \cmdl32.exe
          - \cscript.exe
          - \mshta.exe
          - \rundll32.exe
          - \wscript.exe
    selection_target_path:
        CommandLine|contains:
          - \System32
          - \SysWOW64
          - \WinSxS
    selection_tools_cmd:
        CommandLine|contains: 'copy '
        Image|endswith: \cmd.exe
    selection_tools_other:
      - Image|endswith:
          - \robocopy.exe
          - \xcopy.exe
      - OriginalFileName:
          - robocopy.exe
          - XCOPY.EXE
    selection_tools_pwsh:
        CommandLine|contains:
          - copy-item
          - ' copy '
          - 'cpi '
          - ' cp '
        Image|endswith:
          - \powershell.exe
          - \pwsh.exe
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1036.003
  - DEMO
