
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Cmdl32 Execution
id: f37aba28-a9e6-4045-882c-d5004043b337
status: test
description: lolbas Cmdl32 is use to download a payload to evade antivirus
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/11/03 13:09:21
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Cmdl32/
  - https://twitter.com/SwiftOnSecurity/status/1455897435063074824
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_cli:
        CommandLine|contains|all:
          - '/vpn '
          - '/lan '
    selection_img:
      - Image|endswith: \cmdl32.exe
      - OriginalFileName: CMDL32.EXE
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/06/12
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218
  - attack.t1202
  - DEMO
