
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Dropping Of Password Filter DLL
id: b7966f4a-b333-455b-8370-8ca53c229762
status: test
description: Detects dropping of dll files in system32 that may be used to retrieve
    user credentials from LSASS
author: Sreeman
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/29 13:51:31
references:
  - https://pentestlab.blog/2020/02/10/credential-access-password-filter-dll/
  - https://github.com/3gstudent/PasswordFilter/tree/master/PasswordFilter
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_cmdline
    selection_cmdline:
        CommandLine|contains|all:
          - HKLM\SYSTEM\CurrentControlSet\Control\Lsa
          - scecli\0*
          - reg add
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.credential_access
  - attack.t1556.002
  - DEMO
