
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious PowerShell Download and Execute Pattern
id: e6c54d94-498c-4562-a37c-b469d8e9a275
related:
  - type: derived
    id: 3b6ab547-8ec2-4991-b9d2-2b06702a48d7
status: test
description: Detects suspicious PowerShell download patterns that are often used in
    malicious scripts, stagers or downloaders (make sure that your backend applies
    the strings case-insensitive)
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/28 19:29:21
references:
  - https://gist.github.com/jivoi/c354eaaf3019352ce32522f916c03d70
  - https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - IEX ((New-Object Net.WebClient).DownloadString
          - IEX (New-Object Net.WebClient).DownloadString
          - IEX((New-Object Net.WebClient).DownloadString
          - IEX(New-Object Net.WebClient).DownloadString
          - ' -command (New-Object System.Net.WebClient).DownloadFile('
          - ' -c (New-Object System.Net.WebClient).DownloadFile('
falsepositives: Software installers that pull packages from remote systems and execute
    them
level: high
customer: 'demo'
modified: 2022/03/01
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
