
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: File Download Using Notepad++ GUP Utility
id: 44143844-0631-49ab-97a0-96387d6b2d7c
status: test
description: Detects execution of the Notepad++ updater (gup) from a process other
    than Notepad++ to download files.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/10 16:13:11
references:
  - https://twitter.com/nas_bench/status/1535322182863179776
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection* and not filter
    filter:
        ParentImage|endswith: \notepad++.exe
    selection_cli:
        CommandLine|contains|all:
          - ' -unzipTo '
          - http
    selection_img:
      - Image|endswith: \GUP.exe
      - OriginalFileName: gup.exe
falsepositives: Other parent processes other than notepad++ using GUP that are not
    currently identified
level: high
customer: 'demo'
modified: 2023/03/02
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
