
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Arbitrary MSI Download Via Devinit.EXE
id: 90d50722-0483-4065-8e35-57efaadd354d
status: test
description: Detects a certain command line flag combination used by "devinit.exe",
    which can be abused as a LOLBIN to download arbitrary MSI packages on a Windows
    system
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/11 15:28:41
references:
  - https://twitter.com/mrd0x/status/1460815932402679809
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Devinit/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - ' -t msi-install '
          - ' -i http'
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/04/06
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218
  - DEMO
