
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious WebDav Client Execution Via Rundll32.EXE
id: 982e9f2d-1a85-4d5b-aea4-31f5e97c6555
status: experimental
description: |
    Detects "svchost.exe" spawning "rundll32.exe" with command arguments like C:\windows\system32\davclnt.dll,DavSetCookie. This could be an indicator of exfiltration or use of WebDav to launch code (hosted on WebDav Server) or potentially a sign of exploitation of CVE-2023-23397
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/03/16 18:54:51
references:
  - https://twitter.com/aceresponder/status/1636116096506818562
  - https://www.mdsec.co.uk/2023/03/exploiting-cve-2023-23397-microsoft-outlook-elevation-of-privilege-vulnerability/
  - https://www.pwndefend.com/2023/03/15/the-long-game-persistent-hash-theft/
  - https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2023/03/Figure-7-sample-webdav-process-create-event.png
  - https://www.microsoft.com/en-us/security/blog/2023/03/24/guidance-for-investigating-attacks-using-cve-2023-23397/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_*
    filter_local_ips:
        CommandLine|contains:
          - ://10.
          - ://192.168.
          - ://172.16.
          - ://172.17.
          - ://172.18.
          - ://172.19.
          - ://172.20.
          - ://172.21.
          - ://172.22.
          - ://172.23.
          - ://172.24.
          - ://172.25.
          - ://172.26.
          - ://172.27.
          - ://172.28.
          - ://172.29.
          - ://172.30.
          - ://172.31.
          - ://127.
          - ://169.254.
    selection:
        CommandLine|contains: C:\windows\system32\davclnt.dll,DavSetCookie
        CommandLine|re: ://\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}
        Image|endswith: \rundll32.exe
        ParentCommandLine|contains: -s WebClient
        ParentImage|endswith: \svchost.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/09/18
tags:
  - attack.exfiltration
  - attack.t1048.003
  - cve.2023.23397
  - DEMO
