
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Discovery Activity Via Dnscmd.EXE
id: b6457d63-d2a2-4e29-859d-4e7affc153d1
status: test
description: Detects an attempt to leverage dnscmd.exe to enumerate the DNS zones
    of a domain. DNS zones used to host the DNS records for a particular domain.
author: '@gott_cyber'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/31 17:11:41
references:
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/dnscmd
  - https://docs.microsoft.com/en-us/azure/dns/dns-zones-records
  - https://lolbas-project.github.io/lolbas/Binaries/Dnscmd/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains:
          - /enumrecords
          - /enumzones
          - /ZonePrint
          - /info
    selection_img:
        Image|endswith: \dnscmd.exe
falsepositives: Legitimate administration use
level: medium
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.discovery
  - attack.execution
  - attack.t1543.003
  - DEMO
