
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Sysinternals PsService Execution
id: 3371f518-5fe3-4cf6-a14b-2a0ae3fd8a4f
status: test
description: Detects usage of Sysinternals PsService which can be abused for service
    reconnaissance and tampering
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/16 14:57:11
references:
  - https://docs.microsoft.com/en-us/sysinternals/downloads/psservice
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - OriginalFileName: psservice.exe
      - Image|endswith:
          - \PsService.exe
          - \PsService64.exe
falsepositives: Legitimate use of PsService by an administrator
level: medium
customer: 'demo'
modified: 2023/02/24
tags:
  - attack.discovery
  - attack.persistence
  - attack.t1543.003
  - DEMO
