
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Processes Spawned by Java.EXE
id: 0d34ed8b-1c12-4ff2-828c-16fc860b766d
related:
  - type: similar
    id: dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0
status: experimental
description: Detects suspicious processes spawned from a Java host process which could
    indicate a sign of exploitation (e.g. log4j)
author: Andreas Hunkeler (@Karneades), Florian Roth
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/17 16:26:11
references:
  - https://www.lunasec.io/docs/blog/log4j-zero-day/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - \AppVLP.exe
          - \bitsadmin.exe
          - \certutil.exe
          - \cscript.exe
          - \curl.exe
          - \forfiles.exe
          - \hh.exe
          - \mftrace.exe
          - \mshta.exe
          - \net.exe
          - \net1.exe
          - \query.exe
          - \reg.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \schtasks.exe
          - \scrcons.exe
          - \scriptrunner.exe
          - \sh.exe
          - \systeminfo.exe
          - \whoami.exe
          - \wmic.exe
          - \wscript.exe
        ParentImage|endswith: \java.exe
falsepositives:
  - Legitimate calls to system binaries
  - Company specific internal usage
level: high
customer: 'demo'
modified: 2024/01/18
tags:
  - attack.initial_access
  - attack.persistence
  - attack.privilege_escalation
  - DEMO
