
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious Execution Of Regasm/Regsvcs With Uncommon Extension
id: e9f8f8cc-07cc-4e81-b724-f387db9175e4
related:
  - type: derived
    id: cc368ed0-2411-45dc-a222-510ace303cb2
status: test
description: Detects potentially suspicious execution of the Regasm/Regsvcs utilities
    with an uncommon extension.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/02/13 02:00:51
references:
  - https://www.fortiguard.com/threat-signal-report/4718?s=09
  - https://lolbas-project.github.io/lolbas/Binaries/Regasm/
  - https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_extension:
        CommandLine|contains:
          - .dat
          - .gif
          - .jpeg
          - .jpg
          - .png
          - .txt
    selection_img:
      - Image|endswith:
          - \Regsvcs.exe
          - \Regasm.exe
      - OriginalFileName:
          - RegSvcs.exe
          - RegAsm.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218.009
  - DEMO
