
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Rundll32 Execution With Image Extension
id: 4aa6040b-3f28-44e3-a769-9208e5feb5ec
related:
  - type: similar
    id: 089fc3d2-71e8-4763-a8a5-c97fbb0a403e
status: test
description: Detects the execution of Rundll32.exe with DLL files masquerading as
    image files
author: Hieu Tran
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/03/13 19:14:11
references:
  - https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains:
          - .bmp
          - .cr2
          - .eps
          - .gif
          - .ico
          - .jpeg
          - .jpg
          - .nef
          - .orf
          - .png
          - .raw
          - .sr2
          - .tif
          - .tiff
    selection_img:
      - Image|endswith: \rundll32.exe
      - OriginalFileName: RUNDLL32.exe
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218.011
  - DEMO
