
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PowerShell SAM Copy
id: 1af57a4b-460a-4738-9034-db68b880c665
status: test
description: Detects suspicious PowerShell scripts accessing SAM hives
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/07/29 10:48:11
references:
  - https://twitter.com/splinter_code/status/1420546784250769408
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_1:
        CommandLine|contains|all:
          - \HarddiskVolumeShadowCopy
          - System32\config\sam
    selection_2:
        CommandLine|contains:
          - Copy-Item
          - cp $_.
          - cpi $_.
          - copy $_.
          - .File]::Copy(
falsepositives:
  - Some rare backup scenarios
  - PowerShell scripts fixing HiveNightmare / SeriousSAM ACLs
level: high
customer: 'demo'
modified: 2023/01/06
tags:
  - attack.credential_access
  - attack.t1003.002
  - DEMO
