
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Lace Tempest Malware Loader Execution
id: 745ea50b-9673-4ba7-9426-cb45cf4a8e6d
status: experimental
description: Detects execution of a specific binary based on filename and hash used
    by Lace Tempest to load additional malware as reported by SysAid Team
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/11/09 15:43:11
references:
  - https://www.sysaid.com/blog/service-desk/on-premise-software-security-vulnerability-notification
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_hash:
        Hashes|contains: SHA256=B5ACF14CDAC40BE590318DEE95425D0746E85B1B7B1CBD14DA66F21F2522BF4D
    selection_img:
        Image|endswith: :\Program Files\SysAidServer\tomcat\webapps\usersfiles\user.exe
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.execution
  - detection.emerging_threats
  - DEMO
