
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-06-21 19:00
# Generated for User: demo
# Number of Rules: 3228
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Sensitive File Dump Via Wbadmin.EXE
id: 8b93a509-1cb8-42e1-97aa-ee24224cdc15
status: experimental
description: |
    Detects the dump of highly sensitive files such as "NTDS.DIT" and "SECURITY" hive.
    Attackers can leverage the "wbadmin" utility in order to dump sensitive files that might contain credential or sensitive information.
author: Nasreddine Bencherchali (Nextron Systems), frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/05/10 14:43:01
references:
  - https://github.com/LOLBAS-Project/LOLBAS/blob/2cc01b01132b5c304027a658c698ae09dd6a92bf/yml/OSBinaries/Wbadmin.yml
  - https://lolbas-project.github.io/lolbas/Binaries/Wbadmin/
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-recovery
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-backup
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_backup:
        CommandLine|contains:
          - start
          - backup
    selection_img:
      - Image|endswith: \wbadmin.exe
      - OriginalFileName: WBADMIN.EXE
    selection_path:
        CommandLine|contains:
          - \config\SAM
          - \config\SECURITY
          - \config\SYSTEM
          - \Windows\NTDS\NTDS.dit
falsepositives: Legitimate backup operation by authorized administrators. Matches
    must be investigated and allowed on a case by case basis.
level: high
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1003.003
  - DEMO
