
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Registry Modification Via Regini.EXE
id: 5f60740a-f57b-4e76-82a1-15b6ff2cb134
related:
  - type: derived
    id: 77946e79-97f1-45a2-84b4-f37b5c0d8682
status: test
description: Detects the execution of regini.exe which can be used to modify registry
    keys, the changes are imported from one or more text files.
author: Eli Salem, Sander Wiebing, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/08 15:19:31
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Regini/
  - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/regini
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter
    filter:
        CommandLine|re: :[^ \\]
    selection:
      - Image|endswith: \regini.exe
      - OriginalFileName: REGINI.EXE
fields:
  - ParentImage
  - CommandLine
falsepositives: Legitimate modification of keys
level: low
customer: 'demo'
modified: 2023/02/08
tags:
  - attack.t1112
  - attack.defense_evasion
  - DEMO
