
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - Windows Credential Editor (WCE) Execution
id: 7aa7009a-28b9-4344-8c1f-159489a390df
status: test
description: Detects the use of Windows Credential Editor (WCE)
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/12/31 18:56:31
references:
  - https://www.ampliasecurity.com/research/windows-credentials-editor/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_* and not filter
    filter:
        Image|endswith: \clussvc.exe
    selection_1:
      - Imphash:
          - a53a02b997935fd8eedcb5f7abab9b9f
          - e96a73c7bf33a464c510ede582318bf2
      - Hashes|contains:
          - IMPHASH=a53a02b997935fd8eedcb5f7abab9b9f
          - IMPHASH=e96a73c7bf33a464c510ede582318bf2
    selection_2:
        CommandLine|endswith: .exe -S
        ParentImage|endswith: \services.exe
falsepositives: Another service that uses a single -s command line switch
level: critical
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.s0005
  - DEMO
