
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Windows Binary Executed From WSL
id: ed825c86-c009-4014-b413-b76003e33d35
status: test
description: Detects the execution of Windows binaries from within a WSL instance.
    This could be used to masquerade parent-child relationships
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/02/14 14:13:31
references:
  - Internal Research
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CurrentDirectory|contains: \\\\wsl.localhost
        Image|re: '[a-zA-Z]:\\'
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1202
  - DEMO
