
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Replace.exe Usage
id: 9292293b-8496-4715-9db6-37028dcda4b3
status: test
description: Detects the use of Replace.exe which can be used to replace file with
    another file
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/06 10:26:51
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Replace/
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/replace
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and argument
    argument:
        CommandLine|contains|windash: -a
    selection:
        Image|endswith: \replace.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2024/03/13
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
