
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Reg Add Open Command
id: dd3ee8cc-f751-41c9-ba53-5a32ed47e563
status: test
description: Threat actors performed dumping of SAM, SECURITY and SYSTEM registry
    hives using DelegateExecute key
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/20 13:57:11
references:
  - https://thedfirreport.com/2021/12/13/diavol-ransomware/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_1:
        CommandLine|contains|all:
          - reg
          - add
          - hkcu\software\classes\ms-settings\shell\open\command
          - '/ve '
          - /d
    selection_2:
        CommandLine|contains|all:
          - reg
          - add
          - hkcu\software\classes\ms-settings\shell\open\command
          - /v
          - DelegateExecute
    selection_3:
        CommandLine|contains|all:
          - reg
          - delete
          - hkcu\software\classes\ms-settings
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/12/25
tags:
  - attack.credential_access
  - attack.t1003
  - DEMO
