
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious Child Process Of WinRAR.EXE
id: 146aace8-9bd6-42ba-be7a-0070d8027b76
related:
  - type: similar
    id: ec3a3c2f-9bb0-4a9b-8f4b-5ec386544343
status: experimental
description: Detects potentially suspicious child processes of WinRAR.exe.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/31 18:49:11
references:
  - https://www.group-ib.com/blog/cve-2023-38831-winrar-zero-day/
  - https://github.com/knight0x07/WinRAR-Code-Execution-Vulnerability-CVE-2023-38831/blob/26ab6c40b6d2c09bb4fc60feaa4a3a90cfd20c23/Part-1-Overview.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_binaries:
      - Image|endswith:
          - \cmd.exe
          - \cscript.exe
          - \mshta.exe
          - \powershell.exe
          - \pwsh.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \wscript.exe
      - OriginalFileName:
          - Cmd.Exe
          - cscript.exe
          - mshta.exe
          - PowerShell.EXE
          - pwsh.dll
          - regsvr32.exe
          - RUNDLL32.EXE
          - wscript.exe
    selection_parent:
        ParentImage|endswith: \WinRAR.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.t1203
  - DEMO
