
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Lolbin Defaultpack.exe Use As Proxy
id: b2309017-4235-44fe-b5af-b15363011957
status: test
description: Detect usage of the "defaultpack.exe" binary as a proxy to launch other
    programs
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/31 15:02:31
references:
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/DefaultPack/
  - https://www.echotrail.io/insights/search/defaultpack.exe
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        ParentImage|endswith: \defaultpack.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.t1218
  - attack.defense_evasion
  - attack.execution
  - DEMO
