
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Domain Trust Discovery Via Dsquery
id: 3bad990e-4848-4a78-9530-b427d854aac0
related:
  - type: similar
    id: b23fcb74-b1cb-4ff7-a31d-bfe2a7ba453b
  - type: obsoletes
    id: 77815820-246c-47b8-9741-e0def3f57308
status: test
description: Detects execution of "dsquery.exe" for domain trust discovery
author: E.M. Anhaus, Tony Lambert, oscd.community, omkar72
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/24 15:03:51
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1482/T1482.md
  - https://posts.specterops.io/an-introduction-to-manual-active-directory-querying-with-dsquery-and-ldapsearch-84943c13d7eb?gi=41b97a644843
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains: trustedDomain
    selection_img:
      - Image|endswith: \dsquery.exe
      - OriginalFileName: dsquery.exe
falsepositives: Legitimate use of the utilities by legitimate user for legitimate
    reason
level: medium
customer: 'demo'
modified: 2023/02/02
tags:
  - attack.discovery
  - attack.t1482
  - DEMO
