
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: File Download Via Bitsadmin To An Uncommon Target Folder
id: 6e30c82f-a9f8-4aab-b79c-7c12bce6f248
status: test
description: Detects usage of bitsadmin downloading a file to uncommon target folder
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/28 20:11:21
references:
  - https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
  - https://isc.sans.edu/diary/22264
  - https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
  - https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_flags:
        CommandLine|contains:
          - ' /transfer '
          - ' /create '
          - ' /addfile '
    selection_folder:
        CommandLine|contains:
          - '%AppData%'
          - '%temp%'
          - '%tmp%'
          - \AppData\Local\
          - C:\Windows\Temp\
    selection_img:
      - Image|endswith: \bitsadmin.exe
      - OriginalFileName: bitsadmin.exe
fields:
  - CommandLine
  - ParentCommandLine
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/02/15
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.t1197
  - attack.s0190
  - attack.t1036.003
  - DEMO
