
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Encoded PowerShell Patterns In CommandLine
id: cdf05894-89e7-4ead-b2b0-0a5f97a90f2f
related:
  - type: similar
    id: 5b572dcf-254b-425c-a8c5-d9af6bea35a6
status: test
description: Detects specific combinations of encoding methods in PowerShell via the
    commandline
author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/11 19:45:01
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_img and (all of selection_to_* or 1 of selection_gen_*)
    selection_gen_1:
        CommandLine|contains|all:
          - char
          - join
    selection_gen_2:
        CommandLine|contains|all:
          - split
          - join
    selection_img:
      - Image|endswith:
          - \powershell.exe
          - \pwsh.exe
      - OriginalFileName:
          - PowerShell.EXE
          - pwsh.dll
    selection_to_1:
        CommandLine|contains:
          - ToInt
          - ToDecimal
          - ToByte
          - ToUint
          - ToSingle
          - ToSByte
    selection_to_2:
        CommandLine|contains:
          - ToChar
          - ToString
          - String
falsepositives: Unknown
level: low
customer: 'demo'
modified: 2023/01/26
tags:
  - attack.defense_evasion
  - attack.t1027
  - attack.execution
  - attack.t1059.001
  - DEMO
