
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Detect Virtualbox Driver Installation OR Starting Of VMs
id: bab049ca-7471-4828-9024-38279a4c04da
status: test
description: Adversaries can carry out malicious operations using a virtual instance
    to avoid detection. This rule is built to detect the registration of the Virtualbox
    driver or start of a Virtualbox VM.
author: Janantha Marasinghe
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/09/26 20:34:31
references:
  - https://news.sophos.com/en-us/2020/05/21/ragnar-locker-ransomware-deploys-virtual-machine-to-dodge-security/
  - https://threatpost.com/maze-ransomware-ragnar-locker-virtual-machine/159350/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_1:
        CommandLine|contains:
          - VBoxRT.dll,RTR3Init
          - VBoxC.dll
          - VBoxDrv.sys
    selection_2:
        CommandLine|contains:
          - startvm
          - controlvm
fields:
  - ComputerName
  - User
  - CommandLine
  - ParentCommandLine
falsepositives: This may have false positives on hosts where Virtualbox is legitimately
    being used for operations
level: low
customer: 'demo'
modified: 2022/07/14
tags:
  - attack.defense_evasion
  - attack.t1564.006
  - attack.t1564
  - DEMO
