
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: WMI Backdoor Exchange Transport Agent
id: 797011dc-44f4-4e6f-9f10-a8ceefbe566b
status: test
description: Detects a WMI backdoor in Exchange Transport Agents via WMI event filters
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/11 15:33:31
references:
  - https://twitter.com/cglyer/status/1182389676876980224
  - https://twitter.com/cglyer/status/1182391019633029120
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_*
    filter_conhost:
        Image: C:\Windows\System32\conhost.exe
    filter_oleconverter:
        Image|endswith: \Bin\OleConverter.exe
        Image|startswith: C:\Program Files\Microsoft\Exchange Server\
    selection:
        ParentImage|endswith: \EdgeTransport.exe
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2023/02/08
tags:
  - attack.persistence
  - attack.t1546.003
  - DEMO
