
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Defense Evasion Via Binary Rename
id: 36480ae1-a1cb-4eaa-a0d6-29801d7e9142
related:
  - type: similar
    id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
status: test
description: Detects the execution of a renamed binary often used by attackers or
    malware leveraging new Sysmon OriginalFileName datapoint.
author: Matthew Green @mgreen27, Ecco, James Pemberton @4A616D6573, oscd.community,
    Andreas Hunkeler (@Karneades)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/06/15 17:11:21
references:
  - https://mgreen27.github.io/posts/2019/05/12/BinaryRename.html
  - https://mgreen27.github.io/posts/2019/05/29/BinaryRename2.html
  - https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1036.003/T1036.003.md#atomic-test-1---masquerading-as-windows-lsass-process
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter
    filter:
        Image|endswith:
          - \cmd.exe
          - \conhost.exe
          - \7z.exe
          - \WinRAR.exe
          - \wevtutil.exe
          - \net.exe
          - \net1.exe
          - \netsh.exe
          - \InstallUtil.exe
    selection:
        OriginalFileName:
          - Cmd.Exe
          - CONHOST.EXE
          - 7z.exe
          - WinRAR.exe
          - wevtutil.exe
          - net.exe
          - net1.exe
          - netsh.exe
          - InstallUtil.exe
falsepositives: Custom applications use renamed binaries adding slight change to binary
    name. Typically this is easy to spot and add to whitelist
level: medium
customer: 'demo'
modified: 2023/01/18
tags:
  - attack.defense_evasion
  - attack.t1036.003
  - DEMO
