
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Boot Configuration Tampering Via Bcdedit.EXE
id: 1444443e-6757-43e4-9ea4-c8fc705f79a2
status: stable
description: Detects the use of the bcdedit command to tamper with the boot configuration
    data. This technique is often times used by malware or attackers as a destructive
    way before launching ransomware.
author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/24 17:20:21
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md
  - https://eqllib.readthedocs.io/en/latest/analytics/c4732632-9c1d-4980-9fa8-1d98c93f918e.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
      - CommandLine|contains|all:
          - bootstatuspolicy
          - ignoreallfailures
      - CommandLine|contains|all:
          - recoveryenabled
          - "no"
    selection_img:
      - Image|endswith: \bcdedit.exe
      - OriginalFileName: bcdedit.exe
    selection_set:
        CommandLine|contains: set
fields:
  - ComputerName
  - User
  - CommandLine
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/02/15
tags:
  - attack.impact
  - attack.t1490
  - DEMO
