
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Cmd.EXE Missing Space Characters Execution Anomaly
id: a16980c2-0c56-4de0-9a79-17971979efdd
status: test
description: |
    Detects Windows command lines that miss a space before or after the /c flag when running a command using the cmd.exe.
    This could be a sign of obfuscation of a fat finger problem (typo by the developer).
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/23 18:50:31
references:
  - https://twitter.com/cyb3rops/status/1562072617552678912
  - https://ss64.com/nt/cmd.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection* and not 1 of filter_*
    filter_fp:
      - CommandLine|contains: AppData\Local\Programs\Microsoft VS Code\resources\app\node_modules
      - CommandLine|endswith: cmd.exe/c .
      - CommandLine: cmd.exe /c
    filter_generic:
        CommandLine|contains:
          - 'cmd.exe /c '
          - 'cmd /c '
          - 'cmd.exe /k '
          - 'cmd /k '
          - 'cmd.exe /r '
          - 'cmd /r '
    selection1:
        CommandLine|contains:
          - cmd.exe/c
          - \cmd/c
          - '"cmd/c'
          - cmd.exe/k
          - \cmd/k
          - '"cmd/k'
          - cmd.exe/r
          - \cmd/r
          - '"cmd/r'
    selection2:
        CommandLine|contains:
          - /cwhoami
          - /cpowershell
          - /cschtasks
          - /cbitsadmin
          - /ccertutil
          - /kwhoami
          - /kpowershell
          - /kschtasks
          - /kbitsadmin
          - /kcertutil
    selection3:
        CommandLine|contains:
          - cmd.exe /c
          - cmd /c
          - cmd.exe /k
          - cmd /k
          - cmd.exe /r
          - cmd /r
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/03/06
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
