
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Uncommon Child Process Spawned By Odbcconf.EXE
id: 8e3c7994-131e-4ba5-b6ea-804d49113a26
status: experimental
description: Detects an uncommon child process of "odbcconf.exe" binary which normally
    shouldn't have any child processes.
author: Harjot Singh @cyb3rjy0t
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/22 17:40:21
references:
  - https://learn.microsoft.com/en-us/sql/odbc/odbcconf-exe?view=sql-server-ver16
  - https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/
  - https://medium.com/@cyberjyot/t1218-008-dll-execution-using-odbcconf-exe-803fa9e08dac
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        ParentImage|endswith: \odbcconf.exe
falsepositives:
  - In rare occurrences where "odbcconf" crashes. It might spawn a "werfault" process
  - Other child processes will depend on the DLL being registered by actions like
    "regsvr". In case where the DLLs have external calls (which should be rare). Other
    child processes might spawn and additional filters need to be applied.
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218.008
  - DEMO
