
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Usage Of Active Directory Diagnostic Tool (ntdsutil.exe)
id: a58353df-af43-4753-bad0-cd83ef35eef5
related:
  - type: derived
    id: 2afafd61-6aae-4df4-baed-139fa1f4c345
status: test
description: Detects execution of ntdsutil.exe to perform different actions such as
    restoring snapshots...etc.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/14 23:32:51
references:
  - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731620(v=ws.11)
  - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/espionage-asia-governments
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
      - CommandLine|contains|all:
          - snapshot
          - 'mount '
      - CommandLine|contains|all:
          - ac
          - ' i'
          - ' ntds'
    selection_img:
      - Image|endswith: \ntdsutil.exe
      - OriginalFileName: ntdsutil.exe
falsepositives:
  - Legitimate usage to restore snapshots
  - Legitimate admin activity
level: medium
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1003.003
  - DEMO
