
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: SQLite Firefox Profile Data DB Access
id: 4833155a-4053-4c9c-a997-777fcea0baa7
status: test
description: Detect usage of the "sqlite" binary to query databases in Firefox and
    other Gecko-based browsers for potential data stealing.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/08 15:05:21
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1539/T1539.md#atomic-test-1---steal-firefox-cookies-windows
  - https://blog.cyble.com/2022/04/21/prynt-stealer-a-new-info-stealer-performing-clipper-and-keylogger-activities/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_firefox:
        CommandLine|contains:
          - cookies.sqlite
          - places.sqlite
    selection_sql:
      - Product: SQLite
      - Image|endswith:
          - \sqlite.exe
          - \sqlite3.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/19
tags:
  - attack.credential_access
  - attack.t1539
  - attack.collection
  - attack.t1005
  - DEMO
