
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: File Download Via Windows Defender MpCmpRun.EXE
id: 46123129-1024-423e-9fae-43af4a0fa9a5
status: test
description: Detects the use of Windows Defender MpCmdRun.EXE to download files
author: Matthew Matchen
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/09/04 17:49:41
references:
  - https://web.archive.org/web/20200903194959/https://twitter.com/djmtshepana/status/1301608169496612866
  - https://lolbas-project.github.io/lolbas/Binaries/MpCmdRun/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains|all:
          - DownloadFile
          - url
    selection_img:
      - OriginalFileName: MpCmdRun.exe
      - Image|endswith: \MpCmdRun.exe
      - CommandLine|contains: MpCmdRun.exe
      - Description: Microsoft Malware Protection Command Line Utility
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/11/09
tags:
  - attack.defense_evasion
  - attack.t1218
  - attack.command_and_control
  - attack.t1105
  - DEMO
