
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Schtasks From Suspicious Folders
id: 8a8379b8-780b-4dbf-b1e9-31c8d112fefb
status: test
description: Detects scheduled task creations that have suspicious action command
    and folder combinations
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/15 14:42:21
references:
  - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/lazarus-dream-job-chemical
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_all_folders:
        CommandLine|contains:
          - C:\ProgramData\
          - '%ProgramData%'
    selection_command:
        CommandLine|contains:
          - powershell
          - pwsh
          - 'cmd /c '
          - 'cmd /k '
          - 'cmd /r '
          - 'cmd.exe /c '
          - 'cmd.exe /k '
          - 'cmd.exe /r '
    selection_create:
        CommandLine|contains: ' /create '
    selection_img:
      - Image|endswith: \schtasks.exe
      - OriginalFileName: schtasks.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/11/18
tags:
  - attack.execution
  - attack.t1053.005
  - DEMO
