
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PsExec Service Child Process Execution as LOCAL SYSTEM
id: 7c0dcd3d-acf8-4f71-9570-f448b0034f94
related:
  - type: similar
    id: fa91cc36-24c9-41ce-b3c8-3bbc3f2f67ba
status: test
description: Detects suspicious launch of the PSEXESVC service on this system and
    a sub process run as LOCAL_SYSTEM (-s), which means that someone remotely started
    a command on this system running it with highest privileges and not only the privileges
    of the login user account (e.g. the administrator account)
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/21 19:12:41
references:
  - https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        ParentImage: C:\Windows\PSEXESVC.exe
        User|contains:
          - AUTHORI
          - AUTORI
falsepositives: Users that debug Microsoft Intune issues using the commands mentioned
    in the official documentation; see https://learn.microsoft.com/en-us/mem/intune/apps/intune-management-extension
level: high
customer: 'demo'
modified: 2023/02/28
tags:
  - attack.execution
  - DEMO
