
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Provlaunch.EXE Child Process
id: f9999590-1f94-4a34-a91e-951e47bedefd
related:
  - type: similar
    id: 7f5d1c9a-3e83-48df-95a7-2b98aae6c13c
  - type: similar
    id: 2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25
  - type: similar
    id: 7021255e-5db3-4946-a8b9-0ba7a4644a69
status: experimental
description: Detects suspicious child processes of "provlaunch.exe" which might indicate
    potential abuse to proxy execution.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/08 16:20:41
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
  - https://twitter.com/0gtweet/status/1674399582162153472
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_child:
      - Image|endswith:
          - \calc.exe
          - \cmd.exe
          - \cscript.exe
          - \mshta.exe
          - \notepad.exe
          - \powershell.exe
          - \pwsh.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \wscript.exe
      - Image|contains:
          - :\PerfLogs\
          - :\Temp\
          - :\Users\Public\
          - \AppData\Temp\
          - \Windows\System32\Tasks\
          - \Windows\Tasks\
          - \Windows\Temp\
    selection_parent:
        ParentImage|endswith: \provlaunch.exe
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
