
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Debugger Registration Cmdline
id: ae215552-081e-44c7-805f-be16f975c8a2
status: test
description: Detects the registration of a debugger for a program that is available
    in the logon screen (sticky key backdoor).
author: Florian Roth (Nextron Systems), oscd.community, Jonhnathan Ribeiro
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/09/06 16:59:11
references:
  - https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/
  - https://bazaar.abuse.ch/sample/6f3aa9362d72e806490a8abce245331030d1ab5ac77e400dd475748236a6cc81/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection1:
        CommandLine|contains: \CurrentVersion\Image File Execution Options\
    selection2:
        CommandLine|contains:
          - sethc.exe
          - utilman.exe
          - osk.exe
          - magnify.exe
          - narrator.exe
          - displayswitch.exe
          - atbroker.exe
          - HelpPane.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/08/06
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1546.008
  - DEMO
