
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Cabinet File Execution Via Msdt.EXE
id: dc4576d4-7467-424f-9eee-fd2b02855fe0
related:
  - type: obsoletes
    id: 6545ce61-a1bd-4119-b9be-fcbee42c0cf3
status: test
description: Detects execution of msdt.exe using the "cab" flag which could indicates
    suspicious diagcab files with embedded answer files leveraging CVE-2022-30190
author: Nasreddine Bencherchali (Nextron Systems), GossiTheDog, frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/21 17:45:31
references:
  - https://twitter.com/nas_bench/status/1537896324837781506
  - https://github.com/GossiTheDog/ThreatHunting/blob/e85884abbf05d5b41efc809ea6532b10b45bd05c/AdvancedHuntingQueries/DogWalk-DiagCab
  - https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-9015912909545e72ed42cbac4d1e96295e8964579c406d23fd9c47a8091576a0
  - https://irsl.medium.com/the-trouble-with-microsofts-troubleshooters-6e32fc80b8bd
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cmd:
        CommandLine|contains|windash: ' -cab '
    selection_img:
      - Image|endswith: \msdt.exe
      - OriginalFileName: msdt.exe
falsepositives: Legitimate usage of ".diagcab" files
level: medium
customer: 'demo'
modified: 2024/03/13
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
