
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - Potential Impacket Lateral Movement Activity
id: 10c14723-61c7-4c75-92ca-9af245723ad2
related:
  - type: obsoletes
    id: e31f89f7-36fb-4697-8ab6-48823708353b
status: stable
description: Detects wmiexec/dcomexec/atexec/smbexec from Impacket framework
author: Ecco, oscd.community, Jonhnathan Ribeiro, Tim Rauch
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/09/03 20:23:31
references:
  - https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/wmiexec.py
  - https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/atexec.py
  - https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/smbexec.py
  - https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/dcomexec.py
  - https://www.elastic.co/guide/en/security/current/suspicious-cmd-execution-via-wmi.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_atexec:
        CommandLine|contains|all:
          - cmd.exe
          - /C
          - Windows\Temp\
          - '&1'
        ParentCommandLine|contains:
          - svchost.exe -k netsvcs
          - taskeng.exe
    selection_other:
        CommandLine|contains|all:
          - cmd.exe
          - /Q
          - /c
          - \\\\127.0.0.1\\
          - '&1'
        ParentImage|endswith:
          - \wmiprvse.exe
          - \mmc.exe
          - \explorer.exe
          - \services.exe
fields:
  - CommandLine
  - ParentCommandLine
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/21
tags:
  - attack.execution
  - attack.t1047
  - attack.lateral_movement
  - attack.t1021.003
  - DEMO
