
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Winnti Malware HK University Campaign
id: 3121461b-5aa0-4a41-b910-66d25524edbb
status: test
description: Detects specific process characteristics of Winnti malware noticed in
    Dec/Jan 2020 in a campaign against Honk Kong universities
author: Florian Roth (Nextron Systems), Markus Neis
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/02/01 15:45:11
references:
  - https://www.welivesecurity.com/2020/01/31/winnti-group-targeting-universities-hong-kong/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection*
    selection1:
        Image|startswith: C:\ProgramData\DRM
        ParentImage|contains:
          - C:\Windows\Temp
          - \hpqhvind.exe
    selection2:
        Image|endswith: \wmplayer.exe
        ParentImage|startswith: C:\ProgramData\DRM
    selection3:
        Image|endswith: \wmplayer.exe
        ParentImage|endswith: \Test.exe
    selection4:
        Image: C:\ProgramData\DRM\CLR\CLR.exe
    selection5:
        Image|endswith: \SearchFilterHost.exe
        ParentImage|startswith: C:\ProgramData\DRM\Windows
falsepositives: Unlikely
level: critical
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.defense_evasion
  - attack.t1574.002
  - attack.g0044
  - detection.emerging_threats
  - DEMO
