
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Suspicious Registry File Imported Via Reg.EXE
id: 62e0298b-e994-4189-bc87-bc699aa62d97
related:
  - type: derived
    id: 73bba97f-a82d-42ce-b315-9182e76c57b1
status: test
description: Detects the import of '.reg' files from suspicious paths using the 'reg.exe'
    utility
author: frack113, Nasreddine Bencherchali
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/01 20:16:21
references:
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/reg-import
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains: ' import '
    selection_img:
      - Image|endswith: \reg.exe
      - OriginalFileName: reg.exe
    selection_paths:
        CommandLine|contains:
          - C:\Users\
          - '%temp%'
          - '%tmp%'
          - '%appdata%'
          - \AppData\Local\Temp\
          - C:\Windows\Temp\
          - C:\ProgramData\
falsepositives: Legitimate import of keys
level: medium
customer: 'demo'
modified: 2023/02/05
tags:
  - attack.t1112
  - attack.defense_evasion
  - DEMO
