
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Copy From or To System Directory
id: fff9d2b7-e11c-4a69-93d3-40ef66189767
related:
  - type: derived
    id: 855bc8b5-2ae8-402e-a9ed-b889e6df1900
status: test
description: |
    Detects a suspicious copy operation that tries to copy a program from system (System32, SysWOW64, WinSxS) directories to another on disk.
    Often used to move LOLBINs such as 'certutil' or 'desktopimgdownldr' to a different location with a different name in order to bypass detections based on locations.
author: Florian Roth (Nextron Systems), Markus Neis, Tim Shelton (HAWK.IO), Nasreddine
    Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/07/03 17:23:21
references:
  - https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120
  - https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
  - https://thedfirreport.com/2023/08/28/html-smuggling-leads-to-domain-wide-ransomware/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_* and target
    selection_cmd:
        CommandLine|contains: 'copy '
        Image|endswith: \cmd.exe
    selection_other:
      - Image|endswith:
          - \robocopy.exe
          - \xcopy.exe
      - OriginalFileName:
          - robocopy.exe
          - XCOPY.EXE
    selection_pwsh:
        CommandLine|contains:
          - copy-item
          - ' copy '
          - 'cpi '
          - ' cp '
        Image|endswith:
          - \powershell.exe
          - \pwsh.exe
    target:
        CommandLine|contains:
          - \System32
          - \SysWOW64
          - \WinSxS
falsepositives:
  - Depend on scripts and administrative tools used in the monitored environment (For
    example an admin scripts like https://www.itexperience.net/sccm-batch-files-and-32-bits-processes-on-64-bits-os/)
  - When cmd.exe and xcopy.exe are called directly
  - When the command contains the keywords but not in the correct order
level: medium
customer: 'demo'
modified: 2023/08/29
tags:
  - attack.defense_evasion
  - attack.t1036.003
  - DEMO
