
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Browser Started with Remote Debugging
id: b3d34dc5-2efd-4ae3-845f-8ec14921f449
related:
  - type: derived
    id: 3e8207c5-fcd2-4ea6-9418-15d45b4890e4
status: test
description: Detects browsers starting with the remote debugging flags. Which is a
    technique often used to perform browser injection attacks
author: pH-T (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/27 15:54:31
references:
  - https://yoroi.company/wp-content/uploads/2022/05/EternityGroup_report_compressed.pdf
  - https://www.mdsec.co.uk/2022/10/analysing-lastpass-part-1/
  - https://github.com/defaultnamehere/cookie_crimes/
  - https://github.com/wunderwuzzi23/firefox-cookiemonster
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_chromium_based:
        CommandLine|contains: ' --remote-debugging-'
    selection_firefox:
        CommandLine|contains: ' -start-debugger-server'
        Image|endswith: \firefox.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/12/23
tags:
  - attack.credential_access
  - attack.t1185
  - DEMO
