
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Execute Code with Pester.bat as Parent
id: 18988e1b-9087-4f8a-82fe-0414dce49878
related:
  - type: similar
    id: 59e938ff-0d6d-4dc3-b13f-36cc28734d4e
status: test
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for
    testing)
author: frack113, Nasreddine Bencherchali
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/20 15:46:41
references:
  - https://twitter.com/Oddvarmoe/status/993383596244258816
  - https://twitter.com/_st0pp3r_/status/1560072680887525378
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        ParentCommandLine|contains:
          - '{ Invoke-Pester -EnableExit ;'
          - '{ Get-Help "'
    selection_module:
        ParentCommandLine|contains: \WindowsPowerShell\Modules\Pester\
        ParentImage|endswith:
          - \powershell.exe
          - \pwsh.exe
falsepositives: Legitimate use of Pester for writing tests for Powershell scripts
    and modules
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.t1059.001
  - attack.defense_evasion
  - attack.t1216
  - DEMO
