
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Electron Application Child Processes
id: f26eb764-fd89-464b-85e2-dc4a8e6e77b8
related:
  - type: similar
    id: 378a05d8-963c-46c9-bcce-13c7657eac99
status: experimental
description: |
    Detects suspicious child processes of electron apps (teams, discord, slack, etc.). This could be a potential sign of ".asar" file tampering (See reference section for more information) or binary execution proxy through specific CLI arguments (see related rule)
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/21 18:48:21
references:
  - https://taggart-tech.com/quasar-electron/
  - https://github.com/mttaggart/quasar
  - https://positive.security/blog/ms-officecmd-rce
  - https://lolbas-project.github.io/lolbas/Binaries/Msedge/
  - https://lolbas-project.github.io/lolbas/Binaries/Teams/
  - https://lolbas-project.github.io/lolbas/Binaries/msedgewebview2/
  - https://medium.com/@MalFuzzer/one-electron-to-rule-them-all-dc2e9b263daf
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_parent and 1 of selection_child_* and not 1 of filter_main_*
        and not 1 of filter_optional_*
    filter_main_chrome:
        Image|endswith: \chrome.exe
        ParentImage|endswith: \chrome.exe
    filter_main_discord:
        Image|endswith: \discord.exe
        ParentImage|endswith: \discord.exe
    filter_main_githubdesktop:
        Image|endswith: \GitHubDesktop.exe
        ParentImage|endswith: \GitHubDesktop.exe
    filter_main_keybase:
        Image|endswith: \keybase.exe
        ParentImage|endswith: \keybase.exe
    filter_main_msedge:
        Image|endswith: \msedge.exe
        ParentImage|endswith: \msedge.exe
    filter_main_msedgewebview:
        Image|endswith: \msedgewebview2.exe
        ParentImage|endswith: \msedgewebview2.exe
    filter_main_msteams:
        Image|endswith: \msteams.exe
        ParentImage|endswith: \msteams.exe
    filter_main_slack:
        Image|endswith: \slack.exe
        ParentImage|endswith: \slack.exe
    filter_main_teams:
        Image|endswith: \teams.exe
        ParentImage|endswith: \teams.exe
    filter_main_werfault:
        Image:
          - C:\Windows\SysWOW64\WerFault.exe
          - C:\Windows\System32\WerFault.exe
    filter_optional_discord:
        CommandLine|contains: \NVSMI\nvidia-smi.exe
        ParentImage|endswith: \Discord.exe
    selection_child_image:
        Image|endswith:
          - \cmd.exe
          - \cscript.exe
          - \mshta.exe
          - \powershell.exe
          - \pwsh.exe
          - \regsvr32.exe
          - \wscript.exe
    selection_child_paths:
        Image|contains:
          - \AppData\Local\Temp\
          - \Users\Public\
          - \Windows\Temp\
          - :\Temp\
    selection_parent:
        ParentImage|endswith:
          - \chrome.exe
          - \discord.exe
          - \GitHubDesktop.exe
          - \keybase.exe
          - \msedge.exe
          - \msedgewebview2.exe
          - \msteams.exe
          - \slack.exe
          - \Teams.exe
falsepositives: Legitimate child processes can occur in cases of debugging
level: medium
customer: 'demo'
modified: 2023/09/05
tags:
  - attack.execution
  - DEMO
