
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Arbitrary Command Execution Using WSL
id: dec44ca7-61ad-493c-bfd7-8819c5faa09b
related:
  - type: similar
    id: 2267fe65-0681-42ad-9a6d-46553d3f3480
status: test
description: Detects potential abuse of Windows Subsystem for Linux (WSL) binary as
    a LOLBIN to execute arbitrary Linux or Windows commands
author: oscd.community, Zach Stanford @svch0st, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/05 15:41:11
references:
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/
  - https://twitter.com/nas_bench/status/1535431474429808642
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_main_*
    filter_main_kill:
        CommandLine|contains|all:
          - ' -d '
          - ' -e kill '
        ParentImage|endswith: \cmd.exe
    selection_cli:
        CommandLine|contains:
          - ' -e '
          - ' --exec'
          - ' --system'
          - ' --shell-type '
          - ' /mnt/c'
          - ' --user root'
          - ' -u root'
          - --debug-shell
    selection_img:
      - Image|endswith: \wsl.exe
      - OriginalFileName: wsl.exe
falsepositives:
  - Automation and orchestration scripts may use this method to execute scripts etc.
  - Legitimate use by Windows to kill processes opened via WSL (example VsCode WSL
    server)
level: medium
customer: 'demo'
modified: 2023/04/12
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218
  - attack.t1202
  - DEMO
