
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Execution Location Of Wermgr.EXE
id: 5394fcc7-aeb2-43b5-9a09-cac9fc5edcd5
related:
  - type: similar
    id: 396f6630-f3ac-44e3-bfc8-1b161bc00c4e
status: experimental
description: Detects suspicious Windows Error Reporting manager (wermgr.exe) execution
    location.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/14 17:16:51
references:
  - https://www.trendmicro.com/en_us/research/22/j/black-basta-infiltrates-networks-via-qakbot-brute-ratel-and-coba.html
  - https://www.echotrail.io/insights/search/wermgr.exe
  - https://github.com/binderlabs/DirCreate2System
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_legit_location:
        Image|startswith:
          - C:\Windows\System32\
          - C:\Windows\SysWOW64\
          - C:\Windows\WinSxS\
    selection:
        Image|endswith: \wermgr.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/23
tags:
  - attack.execution
  - DEMO
