
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Modification Of Scheduled Tasks
id: 1c0e41cd-21bb-4433-9acc-4a2cd6367b9b
related:
  - type: similar
    id: 614cf376-6651-47c4-9dcc-6b9527f749f4
status: test
description: |
    Detects when an attacker tries to modify an already existing scheduled tasks to run from a suspicious location
    Attackers can create a simple looking task in order to avoid detection on creation as it's often the most focused on
    Instead they modify the task after creation to include their malicious payload
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/28 17:16:11
references:
  - Internal Research
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_schtasks:
        CommandLine|contains|all:
          - ' /Change '
          - ' /TN '
        Image|endswith: \schtasks.exe
    selection_susp_images:
        CommandLine|contains:
          - regsvr32
          - rundll32
          - 'cmd /c '
          - 'cmd /k '
          - 'cmd /r '
          - 'cmd.exe /c '
          - 'cmd.exe /k '
          - 'cmd.exe /r '
          - powershell
          - mshta
          - wscript
          - cscript
          - certutil
          - bitsadmin
          - bash.exe
          - 'bash '
          - scrcons
          - 'wmic '
          - wmic.exe
          - forfiles
          - scriptrunner
          - hh.exe
          - 'hh '
    selection_susp_locations:
        CommandLine|contains:
          - \AppData\Local\Temp
          - \AppData\Roaming\
          - \Users\Public\
          - \WINDOWS\Temp\
          - \Desktop\
          - \Downloads\
          - \Temporary Internet
          - C:\ProgramData\
          - C:\Perflogs\
          - '%ProgramData%'
          - '%appdata%'
          - '%comspec%'
          - '%localappdata%'
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/11/18
tags:
  - attack.execution
  - attack.t1053.005
  - DEMO
