
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Explorer Process Tree Break
id: 949f1ffb-6e85-4f00-ae1e-c3c5b190d605
status: test
description: |
    Detects a command line process that uses explorer.exe to launch arbitrary commands or binaries,
    which is similar to cmd.exe /c, only it breaks the process tree and makes its parent a new instance of explorer spawning from "svchost"
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems),
    @gott_cyber
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/06/29 13:07:31
references:
  - https://twitter.com/CyberRaiju/status/1273597319322058752
  - https://twitter.com/bohops/status/1276357235954909188?s=12
  - https://twitter.com/nas_bench/status/1535322450858233858
  - https://securityboulevard.com/2019/09/deobfuscating-ostap-trickbots-34000-line-javascript-downloader/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - CommandLine|contains: /factory,{75dff2b7-6936-4c06-a8bb-676a7b00b24b}
      - CommandLine|contains|all:
          - explorer.exe
          - ' /root,'
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/09/20
tags:
  - attack.defense_evasion
  - attack.t1036
  - DEMO
