
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: MsiExec Web Install
id: f7b5f842-a6af-4da5-9e95-e32478f3cd2f
related:
  - type: similar
    id: 8150732a-0c9d-4a99-82b9-9efb9b90c40c
status: test
description: Detects suspicious msiexec process starts with web addresses as parameter
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/02/09 10:53:51
references:
  - https://blog.trendmicro.com/trendlabs-security-intelligence/attack-using-windows-installer-msiexec-exe-leads-lokibot/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - ' msiexec'
          - ://
falsepositives: False positives depend on scripts and administrative tools used in
    the monitored environment
level: medium
customer: 'demo'
modified: 2022/01/07
tags:
  - attack.defense_evasion
  - attack.t1218.007
  - attack.command_and_control
  - attack.t1105
  - DEMO
