
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Serv-U Process Pattern
id: 58f4ea09-0fc2-4520-ba18-b85c540b0eaf
status: test
description: Detects a suspicious process pattern which could be a sign of an exploited
    Serv-U service
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/07/14 14:51:41
references:
  - https://www.microsoft.com/security/blog/2021/07/13/microsoft-discovers-threat-actor-targeting-solarwinds-serv-u-software-with-0-day-exploit/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - \cmd.exe
          - \powershell.exe
          - \pwsh.exe
          - \wscript.exe
          - \cscript.exe
          - \sh.exe
          - \bash.exe
          - \schtasks.exe
          - \regsvr32.exe
          - \wmic.exe
          - \mshta.exe
          - \rundll32.exe
          - \msiexec.exe
          - \forfiles.exe
          - \scriptrunner.exe
        ParentImage|endswith: \Serv-U.exe
falsepositives: Legitimate uses in which users or programs use the SSH service of
    Serv-U for remote command execution
level: high
customer: 'demo'
modified: 2022/07/14
tags:
  - attack.credential_access
  - attack.t1555
  - cve.2021.35211
  - DEMO
