
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Malicious Base64 Encoded PowerShell Keywords in Command Lines
id: f26c6093-6f14-4b12-800f-0fcb46f5ffd0
status: test
description: Detects base64 encoded strings used in hidden malicious PowerShell command
    lines
author: John Lambert (rule)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/01/16 21:40:31
references:
  - http://www.leeholmes.com/blog/2017/09/21/searching-for-content-in-base-64-strings/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_encoded:
        CommandLine|contains:
          - AGkAdABzAGEAZABtAGkAbgAgAC8AdAByAGEAbgBzAGYAZQByA
          - aXRzYWRtaW4gL3RyYW5zZmVy
          - IAaQB0AHMAYQBkAG0AaQBuACAALwB0AHIAYQBuAHMAZgBlAHIA
          - JpdHNhZG1pbiAvdHJhbnNmZX
          - YgBpAHQAcwBhAGQAbQBpAG4AIAAvAHQAcgBhAG4AcwBmAGUAcg
          - Yml0c2FkbWluIC90cmFuc2Zlc
          - AGMAaAB1AG4AawBfAHMAaQB6AGUA
          - JABjAGgAdQBuAGsAXwBzAGkAegBlA
          - JGNodW5rX3Npem
          - QAYwBoAHUAbgBrAF8AcwBpAHoAZQ
          - RjaHVua19zaXpl
          - Y2h1bmtfc2l6Z
          - AE8ALgBDAG8AbQBwAHIAZQBzAHMAaQBvAG4A
          - kATwAuAEMAbwBtAHAAcgBlAHMAcwBpAG8Abg
          - lPLkNvbXByZXNzaW9u
          - SQBPAC4AQwBvAG0AcAByAGUAcwBzAGkAbwBuA
          - SU8uQ29tcHJlc3Npb2
          - Ty5Db21wcmVzc2lvb
          - AE8ALgBNAGUAbQBvAHIAeQBTAHQAcgBlAGEAbQ
          - kATwAuAE0AZQBtAG8AcgB5AFMAdAByAGUAYQBtA
          - lPLk1lbW9yeVN0cmVhb
          - SQBPAC4ATQBlAG0AbwByAHkAUwB0AHIAZQBhAG0A
          - SU8uTWVtb3J5U3RyZWFt
          - Ty5NZW1vcnlTdHJlYW
          - 4ARwBlAHQAQwBoAHUAbgBrA
          - 5HZXRDaHVua
          - AEcAZQB0AEMAaAB1AG4Aaw
          - LgBHAGUAdABDAGgAdQBuAGsA
          - LkdldENodW5r
          - R2V0Q2h1bm
          - AEgAUgBFAEEARABfAEkATgBGAE8ANgA0A
          - QASABSAEUAQQBEAF8ASQBOAEYATwA2ADQA
          - RIUkVBRF9JTkZPNj
          - SFJFQURfSU5GTzY0
          - VABIAFIARQBBAEQAXwBJAE4ARgBPADYANA
          - VEhSRUFEX0lORk82N
          - AHIAZQBhAHQAZQBSAGUAbQBvAHQAZQBUAGgAcgBlAGEAZA
          - cmVhdGVSZW1vdGVUaHJlYW
          - MAcgBlAGEAdABlAFIAZQBtAG8AdABlAFQAaAByAGUAYQBkA
          - NyZWF0ZVJlbW90ZVRocmVhZ
          - Q3JlYXRlUmVtb3RlVGhyZWFk
          - QwByAGUAYQB0AGUAUgBlAG0AbwB0AGUAVABoAHIAZQBhAGQA
          - 0AZQBtAG0AbwB2AGUA
          - 1lbW1vdm
          - AGUAbQBtAG8AdgBlA
          - bQBlAG0AbQBvAHYAZQ
          - bWVtbW92Z
          - ZW1tb3Zl
    selection_hidden:
        CommandLine|contains: ' hidden '
    selection_img:
      - Image|endswith:
          - \powershell.exe
          - \pwsh.exe
      - OriginalFileName:
          - PowerShell.EXE
          - pwsh.dll
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/05
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
