
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Powershell Defender Exclusion
id: 17769c90-230e-488b-a463-e05c08e9d48f
related:
  - type: similar
    id: c1344fa2-323b-4d2e-9176-84b4d4821c88
status: test
description: Detects requests to exclude files, folders or processes from Antivirus
    scanning using PowerShell cmdlets
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/04/29 13:59:21
references:
  - https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/configure-process-opened-file-exclusions-microsoft-defender-antivirus
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
  - https://twitter.com/AdamTheAnalyst/status/1483497517119590403
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection1:
        CommandLine|contains:
          - 'Add-MpPreference '
          - 'Set-MpPreference '
    selection2:
        CommandLine|contains:
          - ' -ExclusionPath '
          - ' -ExclusionExtension '
          - ' -ExclusionProcess '
          - ' -ExclusionIpAddress '
falsepositives:
  - Possible Admin Activity
  - Other Cmdlets that may use the same parameters
level: medium
customer: 'demo'
modified: 2022/05/12
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - DEMO
