
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Mpclient.DLL Sideloading Via OfflineScannerShell.EXE Execution
id: 02b18447-ea83-4b1b-8805-714a8a34546a
status: test
description: |
    Detects execution of Windows Defender "OfflineScannerShell.exe" from its non standard directory.
    The "OfflineScannerShell.exe" binary is vulnerable to DLL side loading and will load any DLL named "mpclient.dll" from the current working directory.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/06 00:45:41
references:
  - https://lolbas-project.github.io/lolbas/Binaries/OfflineScannerShell/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_empty:
        CurrentDirectory: ""
    filter_main_legit_dir:
        CurrentDirectory: C:\Program Files\Windows Defender\Offline\
    filter_main_null:
        CurrentDirectory: []
    selection:
      - Image|endswith: \OfflineScannerShell.exe
      - OriginalFileName: OfflineScannerShell.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/08/03
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
