
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Disable of ETW Trace
id: a238b5d0-ce2d-4414-a676-7a531b3d13d6
status: test
description: Detects a command that clears or disables any ETW trace log which could
    indicate a logging evasion.
author: '@neu5ron, Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/03/22 10:49:21
references:
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil
  - https://abuse.io/lockergoga.txt
  - https://medium.com/palantir/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection*
    selection_clear_1:
        CommandLine|contains|all:
          - cl
          - /Trace
    selection_clear_2:
        CommandLine|contains|all:
          - clear-log
          - /Trace
    selection_disable_1:
        CommandLine|contains|all:
          - sl
          - /e:false
    selection_disable_2:
        CommandLine|contains|all:
          - set-log
          - /e:false
    selection_disable_3:
        CommandLine|contains|all:
          - logman
          - update
          - trace
          - --p
          - -ets
    selection_pwsh_remove:
        CommandLine|contains: Remove-EtwTraceProvider
    selection_pwsh_set:
        CommandLine|contains|all:
          - Set-EtwTraceProvider
          - "0x11"
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/06/28
tags:
  - attack.defense_evasion
  - attack.t1070
  - attack.t1562.006
  - car.2016-04-002
  - DEMO
