
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Arbitrary DLL Load Using Winword
id: f7375e28-5c14-432f-b8d1-1db26c832df3
related:
  - type: obsoletes
    id: 2621b3a6-3840-4810-ac14-a02426086171
status: test
description: Detects potential DLL sideloading using the Microsoft Office winword
    process via the '/l' flag.
author: Victor Sergeev, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/09 16:52:41
references:
  - https://github.com/D4Vinci/One-Lin3r/blob/9fdfa5f0b9c698dfbd4cdfe7d2473192777ae1c6/one_lin3r/core/liners/windows/cmd/dll_loader_word.py
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_dll:
        CommandLine|contains|all:
          - '/l '
          - .dll
    selection_img:
      - Image|endswith: \WINWORD.exe
      - OriginalFileName: WinWord.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/03/29
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
