
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Security Tools Keyword Lookup Via Findstr.EXE
id: 4fe074b4-b833-4081-8f24-7dcfeca72b42
related:
  - type: derived
    id: fe63010f-8823-4864-a96b-a7b4a0f7b929
status: experimental
description: |
    Detects execution of "findstr" to search for common names of security tools. Attackers often pipe the results of recon commands such as "tasklist" or "whoami" to "findstr" in order to filter out the results.
    This detection focuses on the keywords that the attacker might use as a filter.
author: Nasreddine Bencherchali (Nextron Systems), frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/20 17:41:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/987e3ca988ae3cff4b9f6e388c139c05bf44bbb8/atomics/T1518.001/T1518.001.md#atomic-test-1---security-software-discovery
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
  - https://www.hhs.gov/sites/default/files/manage-engine-vulnerability-sector-alert-tlpclear.pdf
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|endswith:
          - ' avira'
          - ' avira"'
          - ' cb'
          - ' cb"'
          - ' cylance'
          - ' cylance"'
          - ' defender'
          - ' defender"'
          - ' kaspersky'
          - ' kaspersky"'
          - ' kes'
          - ' kes"'
          - ' mc'
          - ' mc"'
          - ' sec'
          - ' sec"'
          - ' sentinel'
          - ' sentinel"'
          - ' symantec'
          - ' symantec"'
          - ' virus'
          - ' virus"'
    selection_img:
      - Image|endswith:
          - \find.exe
          - \findstr.exe
      - OriginalFileName:
          - FIND.EXE
          - FINDSTR.EXE
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/11/14
tags:
  - attack.discovery
  - attack.t1518.001
  - DEMO
