
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Encoded And Obfuscated Reflection Assembly Load Function Call
id: 9c0295ce-d60d-40bd-bd74-84673b7592b1
related:
  - type: similar
    id: 62b7ccc9-23b4-471e-aa15-6da3663c4d59
status: test
description: Detects suspicious base64 encoded and obfuscated "LOAD" keyword used
    in .NET "reflection.assembly"
author: pH-T (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/01 00:52:11
references:
  - https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/mal_revil.yar
  - https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
  - https://learn.microsoft.com/en-us/dotnet/api/system.appdomain.load?view=net-7.0
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - OgA6ACgAIgBMACIAKwAiAG8AYQBkACIAKQ
          - oAOgAoACIATAAiACsAIgBvAGEAZAAiACkA
          - 6ADoAKAAiAEwAIgArACIAbwBhAGQAIgApA
          - OgA6ACgAIgBMAG8AIgArACIAYQBkACIAKQ
          - oAOgAoACIATABvACIAKwAiAGEAZAAiACkA
          - 6ADoAKAAiAEwAbwAiACsAIgBhAGQAIgApA
          - OgA6ACgAIgBMAG8AYQAiACsAIgBkACIAKQ
          - oAOgAoACIATABvAGEAIgArACIAZAAiACkA
          - 6ADoAKAAiAEwAbwBhACIAKwAiAGQAIgApA
          - OgA6ACgAJwBMACcAKwAnAG8AYQBkACcAKQ
          - oAOgAoACcATAAnACsAJwBvAGEAZAAnACkA
          - 6ADoAKAAnAEwAJwArACcAbwBhAGQAJwApA
          - OgA6ACgAJwBMAG8AJwArACcAYQBkACcAKQ
          - oAOgAoACcATABvACcAKwAnAGEAZAAnACkA
          - 6ADoAKAAnAEwAbwAnACsAJwBhAGQAJwApA
          - OgA6ACgAJwBMAG8AYQAnACsAJwBkACcAKQ
          - oAOgAoACcATABvAGEAJwArACcAZAAnACkA
          - 6ADoAKAAnAEwAbwBhACcAKwAnAGQAJwApA
fields:
  - CommandLine
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/04/06
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1059.001
  - attack.t1027
  - DEMO
