
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Security Service Disabled Via Reg.EXE
id: 5e95028c-5229-4214-afae-d653d573d0ec
status: test
description: Detects execution of "reg.exe" to disable security services such as Windows
    Defender.
author: Florian Roth (Nextron Systems), John Lambert (idea), elhoim
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/07/14 15:17:11
references:
  - https://twitter.com/JohnLaTwC/status/1415295021041979392
  - https://github.com/gordonbay/Windows-On-Reins/blob/e587ac7a0407847865926d575e3c46f68cf7c68d/wor.ps1
  - https://vms.drweb.fr/virus/?i=24144899
  - https://bidouillesecurity.com/disable-windows-defender-in-powershell/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_reg_add and 1 of selection_cli_*
    selection_cli_reg_start:
        CommandLine|contains:
          - \AppIDSvc
          - \MsMpSvc
          - \NisSrv
          - \SecurityHealthService
          - \Sense
          - \UsoSvc
          - \WdBoot
          - \WdFilter
          - \WdNisDrv
          - \WdNisSvc
          - \WinDefend
          - \wscsvc
          - \wuauserv
        CommandLine|contains|all:
          - d 4
          - v Start
    selection_reg_add:
        CommandLine|contains|all:
          - reg
          - add
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/06/05
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - DEMO
