
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Odbcconf.EXE Suspicious DLL Location
id: 6b65c28e-11f3-46cb-902a-68f2cafaf474
status: experimental
description: Detects execution of "odbcconf" where the path of the DLL being registered
    is located in a potentially suspicious location.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/22 15:08:21
references:
  - https://learn.microsoft.com/en-us/sql/odbc/odbcconf-exe?view=sql-server-ver16
  - https://www.trendmicro.com/en_us/research/17/h/backdoor-carrying-emails-set-sights-on-russian-speaking-businesses.html
  - https://securityintelligence.com/posts/raspberry-robin-worm-dridex-malware/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains:
          - :\PerfLogs\
          - :\ProgramData\
          - :\Temp\
          - :\Users\Public\
          - :\Windows\Registration\CRMLog
          - :\Windows\System32\com\dmp\
          - :\Windows\System32\FxsTmp\
          - :\Windows\System32\Microsoft\Crypto\RSA\MachineKeys\
          - :\Windows\System32\spool\drivers\color\
          - :\Windows\System32\spool\PRINTERS\
          - :\Windows\System32\spool\SERVERS\
          - :\Windows\System32\Tasks_Migrated\
          - :\Windows\System32\Tasks\Microsoft\Windows\SyncCenter\
          - :\Windows\SysWOW64\com\dmp\
          - :\Windows\SysWOW64\FxsTmp\
          - :\Windows\SysWOW64\Tasks\Microsoft\Windows\PLA\System\
          - :\Windows\SysWOW64\Tasks\Microsoft\Windows\SyncCenter\
          - :\Windows\Tasks\
          - :\Windows\Temp\
          - :\Windows\Tracing\
          - \AppData\Local\Temp\
          - \AppData\Roaming\
    selection_img:
      - Image|endswith: \odbcconf.exe
      - OriginalFileName: odbcconf.exe
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/05/26
tags:
  - attack.defense_evasion
  - attack.t1218.008
  - DEMO
