
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Persistence Via Microsoft Compatibility Appraiser
id: f548a603-c9f2-4c89-b511-b089f7e94549
related:
  - type: derived
    id: 73a883d0-0348-4be4-a8d8-51031c2564f8
status: test
description: |
    Detects manual execution of the "Microsoft Compatibility Appraiser" task via schtasks.
    In order to trigger persistence stored in the "\AppCompatFlags\TelemetryController" registry key.
author: Sreeman
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/09/29 22:07:21
references:
  - https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains|all:
          - 'run '
          - \Application Experience\Microsoft Compatibility Appraiser
    selection_img:
      - Image|endswith: \schtasks.exe
      - OriginalFileName: schtasks.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/02/10
tags:
  - attack.persistence
  - attack.t1053.005
  - DEMO
