
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Tampering With RDP Related Registry Keys Via Reg.EXE
id: 0d5675be-bc88-4172-86d3-1e96a4476536
status: test
description: Detects the execution of "reg.exe" for enabling/disabling the RDP service
    on the host by tampering with the 'CurrentControlSet\Control\Terminal Server'
    values
author: pH-T (Nextron Systems), @Kostastsale, @TheDFIRReport
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/12 21:32:51
references:
  - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_main_* and 1 of selection_values_*
    selection_main_cli:
        CommandLine|contains|all:
          - ' add '
          - \CurrentControlSet\Control\Terminal Server
          - REG_DWORD
          - ' /f'
    selection_main_img:
      - Image|endswith: \reg.exe
      - OriginalFileName: reg.exe
    selection_values_1:
        CommandLine|contains|all:
          - Licensing Core
          - EnableConcurrentSessions
    selection_values_2:
        CommandLine|contains:
          - WinStations\RDP-Tcp
          - MaxInstanceCount
          - fEnableWinStation
          - TSUserEnabled
          - TSEnabled
          - TSAppCompat
          - IdleWinStationPoolCount
          - TSAdvertise
          - AllowTSConnections
          - fSingleSessionPerUser
          - fDenyTSConnections
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/05
tags:
  - attack.defense_evasion
  - attack.lateral_movement
  - attack.t1021.001
  - attack.t1112
  - DEMO
