
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Exchange PowerShell Snap-Ins Usage
id: 25676e10-2121-446e-80a4-71ff8506af47
status: test
description: Detects adding and using Exchange PowerShell snap-ins to export mailbox
    data. As seen used by HAFNIUM and APT27
author: FPT.EagleEye, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/03/03 14:49:01
references:
  - https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/
  - https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/
  - https://www.intrinsec.com/apt27-analysis/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_*
    filter_msiexec:
        CommandLine|contains: $exserver=Get-ExchangeServer ([Environment]::MachineName)
            -ErrorVariable exerr 2> $null
        ParentImage: C:\Windows\System32\msiexec.exe
    selection_cli:
        CommandLine|contains: Add-PSSnapin
    selection_img:
      - Image|endswith:
          - \powershell.exe
          - \pwsh.exe
      - OriginalFileName:
          - PowerShell.EXE
          - pwsh.dll
    selection_module:
        CommandLine|contains:
          - Microsoft.Exchange.Powershell.Snapin
          - Microsoft.Exchange.Management.PowerShell.SnapIn
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/03/24
tags:
  - attack.execution
  - attack.t1059.001
  - attack.collection
  - attack.t1114
  - DEMO
