
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-06-21 19:00
# Generated for User: demo
# Number of Rules: 3228
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Uncommon Child Process Of Defaultpack.EXE
id: b2309017-4235-44fe-b5af-b15363011957
status: test
description: Detects uncommon child processes of "DefaultPack.EXE" binary as a proxy
    to launch other programs
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/31 16:28:01
references:
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/DefaultPack/
  - https://www.echotrail.io/insights/search/defaultpack.exe
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        ParentImage|endswith: \DefaultPack.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2024/04/22
tags:
  - attack.t1218
  - attack.defense_evasion
  - attack.execution
  - DEMO
