
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Chopper Webshell Process Pattern
id: fa3c117a-bc0d-416e-a31b-0c0e80653efb
status: test
description: Detects patterns found in process executions cause by China Chopper like
    tiny (ASPX) webshells
author: Florian Roth (Nextron Systems), MSTI (query)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/01 14:38:01
references:
  - https://www.microsoft.com/security/blog/2022/09/30/analyzing-attacks-using-the-exchange-vulnerabilities-cve-2022-41040-and-cve-2022-41082/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cmdline:
        CommandLine|contains:
          - '&ipconfig&echo'
          - '&quser&echo'
          - '&whoami&echo'
          - '&c:&echo'
          - '&cd&echo'
          - '&dir&echo'
          - '&echo [E]'
          - '&echo [S]'
    selection_origin:
      - Image|endswith: \w3wp.exe
      - ParentImage|endswith: \w3wp.exe
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.persistence
  - attack.t1505.003
  - attack.t1018
  - attack.t1033
  - attack.t1087
  - DEMO
