
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Password Protected Compressed File Extraction Via 7Zip
id: b717b8fd-6467-4d7d-b3d3-27f9a463af77
status: test
description: Detects usage of 7zip utilities (7z.exe, 7za.exe and 7zr.exe) to extract
    password protected zip files.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/03/10 20:12:51
references:
  - https://blog.cyble.com/2022/06/07/bumblebee-loader-on-the-rise/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_img:
      - Description|contains: 7-Zip
      - Image|endswith:
          - \7z.exe
          - \7zr.exe
          - \7za.exe
      - OriginalFileName:
          - 7z.exe
          - 7za.exe
    selection_password:
        CommandLine|contains|all:
          - ' -p'
          - ' x '
          - ' -o'
falsepositives: Legitimate activity is expected since extracting files with a password
    can be common in some environment.
level: medium
customer: 'demo'
tags:
  - attack.collection
  - attack.t1560.001
  - DEMO
