
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Insecure Transfer Via Curl.EXE
id: cb9cc1d1-e84e-4bdc-b7ad-c31b1b7908ec
status: experimental
description: Detects execution of "curl.exe" with the "--insecure" flag.
author: X__Junior (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/30 13:34:51
references:
  - https://curl.se/docs/manpage.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
      - CommandLine|re: \s-k\s
      - CommandLine|contains: --insecure
    selection_img:
      - Image|endswith: \curl.exe
      - OriginalFileName: curl.exe
falsepositives: Access to badly maintained internal or development systems
level: medium
customer: 'demo'
tags:
  - attack.execution
  - DEMO
