
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious Call To Win32_NTEventlogFile Class
id: caf201a9-c2ce-4a26-9c3a-2b9525413711
related:
  - type: similar
    id: e2812b49-bae0-4b21-b366-7c142eafcde2
status: experimental
description: Detects usage of the WMI class "Win32_NTEventlogFile" in a potentially
    suspicious way (delete, backup, change permissions, etc.) from a PowerShell script
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/07/13 20:54:51
references:
  - https://learn.microsoft.com/en-us/previous-versions/windows/desktop/legacy/aa394225(v=vs.85)
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_class:
        CommandLine|contains: Win32_NTEventlogFile
    selection_function:
        CommandLine|contains:
          - .BackupEventlog(
          - .ChangeSecurityPermissions(
          - .ChangeSecurityPermissionsEx(
          - .ClearEventLog(
          - .Delete(
          - .DeleteEx(
          - .Rename(
          - .TakeOwnerShip(
          - .TakeOwnerShipEx(
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - DEMO
