
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Insensitive Subfolder Search Via Findstr.EXE
id: 04936b66-3915-43ad-a8e5-809eadfd1141
related:
  - type: obsoletes
    id: bf6c39fc-e203-45b9-9538-05397c1b4f3f
status: experimental
description: |
    Detects execution of findstr with the "s" and "i" flags for a "subfolder" and "insensitive" search respectively. Attackers sometimes leverage this built-in utility to search the system for interesting files or filter through results of commands.
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative, Nasreddine Bencherchali
    (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/05 17:26:31
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Findstr/
  - https://oddvar.moe/2018/04/11/putting-data-in-alternate-data-streams-and-how-to-execute-it-part-2/
  - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_findstr and all of selection_cli_search_*
    selection_cli_search_insensitive:
        CommandLine|contains|windash: ' -i '
    selection_cli_search_subfolder:
        CommandLine|contains|windash: ' -s '
    selection_findstr:
      - CommandLine|contains: findstr
      - Image|endswith: findstr.exe
      - OriginalFileName: FINDSTR.EXE
falsepositives: Administrative or software activity
level: low
customer: 'demo'
modified: 2024/03/05
tags:
  - attack.defense_evasion
  - attack.t1218
  - attack.t1564.004
  - attack.t1552.001
  - attack.t1105
  - DEMO
