
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Configuration And Service Reconnaissance Via Reg.EXE
id: 970007b7-ce32-49d0-a4a4-fbef016950bd
status: test
description: Detects the usage of "reg.exe" in order to query reconnaissance information
    from the registry. Adversaries may interact with the Windows registry to gather
    information about credentials, the system, configuration, and installed software.
author: Timur Zinniatullin, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/21 22:06:21
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1012/T1012.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_flag:
        CommandLine|contains: query
    selection_img:
      - Image|endswith: \reg.exe
      - OriginalFileName: reg.exe
    selection_key:
        CommandLine|contains:
          - currentVersion\windows
          - winlogon\
          - currentVersion\shellServiceObjectDelayLoad
          - currentVersion\run
          - currentVersion\policies\explorer\run
          - currentcontrolset\services
falsepositives: Discord
level: medium
customer: 'demo'
modified: 2023/02/05
tags:
  - attack.discovery
  - attack.t1012
  - attack.t1007
  - DEMO
