
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Renamed MegaSync Execution
id: 643bdcac-8b82-49f4-9fd9-25a90b929f3b
status: test
description: Detects the execution of a renamed MegaSync.exe as seen used by ransomware
    families like Nefilim, Sodinokibi, Pysa, and Conti.
author: Sittikorn S
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/06/22 12:57:11
references:
  - https://redcanary.com/blog/rclone-mega-extortion/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter
    filter:
        Image|endswith: \megasync.exe
    selection:
        OriginalFileName: megasync.exe
falsepositives:
  - Software that illegally integrates MegaSync in a renamed form
  - Administrators that have renamed MegaSync
level: high
customer: 'demo'
modified: 2023/02/03
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
