
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Binary Proxy Execution Via VSDiagnostics.EXE
id: ac1c92b4-ac81-405a-9978-4604d78cc47e
status: experimental
description: Detects execution of "VSDiagnostics.exe" with the "start" command in
    order to launch and proxy arbitrary binaries.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/03 20:07:21
references:
  - https://twitter.com/0xBoku/status/1679200664013135872
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli_launch:
        CommandLine|contains:
          - ' /launch:'
          - ' -launch:'
    selection_cli_start:
        CommandLine|contains: start
    selection_img:
      - Image|endswith: \VSDiagnostics.exe
      - OriginalFileName: VSDiagnostics.exe
falsepositives: Legitimate usage for tracing and diagnostics purposes
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
