
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Memory Dumping Activity Via LiveKD
id: a85f7765-698a-4088-afa0-ecfbf8d01fa4
status: experimental
description: Detects execution of LiveKD based on PE metadata or image name
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/15 17:29:31
references:
  - https://learn.microsoft.com/en-us/sysinternals/downloads/livekd
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - Image|endswith:
          - \livekd.exe
          - \livekd64.exe
      - OriginalFileName: livekd.exe
falsepositives: Administration and debugging activity (must be investigated)
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - DEMO
