
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Certificate Exported Via Certutil.EXE
id: 3ffd6f51-e6c1-47b7-94b4-c1e61d4117c5
status: test
description: Detects the execution of the certutil with the "exportPFX" flag which
    allows the utility to export certificates.
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community, Nasreddine
    Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/02/15 15:37:41
references:
  - https://www.splunk.com/en_us/blog/security/a-golden-saml-journey-solarwinds-continued.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains|windash: '-exportPFX '
    selection_img:
      - Image|endswith: \certutil.exe
      - OriginalFileName: CertUtil.exe
falsepositives: There legitimate reasons to export certificates. Investigate the activity
    to determine if it's benign
level: medium
customer: 'demo'
modified: 2024/03/05
tags:
  - attack.defense_evasion
  - attack.t1027
  - DEMO
