
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Disable Windows Defender AV Security Monitoring
id: a7ee1722-c3c5-aeff-3212-c777e4733217
status: test
description: Detects attackers attempting to disable Windows Defender using Powershell
author: ok @securonix invrep-de, oscd.community, frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/12 18:24:11
references:
  - https://research.nccgroup.com/2020/06/23/wastedlocker-a-new-ransomware-variant-developed-by-the-evil-corp-group/
  - https://rvsec0n.wordpress.com/2020/01/24/malwares-that-bypass-windows-defender/
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_pwsh_* or (selection_sc_binary and 1 of selection_sc_tamper_*)
    selection_pwsh_binary:
      - Image|endswith:
          - \powershell.exe
          - \pwsh.exe
      - OriginalFileName:
          - PowerShell.EXE
          - pwsh.dll
    selection_pwsh_cli:
        CommandLine|contains:
          - -DisableBehaviorMonitoring $true
          - -DisableRuntimeMonitoring $true
    selection_sc_binary:
      - Image|endswith: \sc.exe
      - OriginalFileName: sc.exe
    selection_sc_tamper_cmd_delete:
        CommandLine|contains|all:
          - delete
          - WinDefend
    selection_sc_tamper_cmd_disabled:
        CommandLine|contains|all:
          - config
          - WinDefend
          - start=disabled
    selection_sc_tamper_cmd_stop:
        CommandLine|contains|all:
          - stop
          - WinDefend
falsepositives: Minimal, for some older versions of dev tools, such as pycharm, developers
    were known to sometimes disable Windows Defender to improve performance, but this
    generally is not considered a good security practice.
level: high
customer: 'demo'
modified: 2022/11/18
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - DEMO
