
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PUA - AdvancedRun Suspicious Execution
id: fa00b701-44c6-4679-994d-5a18afa8a707
related:
  - type: similar
    id: d2b749ee-4225-417e-b20e-a8d2193cbb84
status: test
description: Detects the execution of AdvancedRun utility in the context of the TrustedInstaller,
    SYSTEM, Local Service or Network Service accounts
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/20 15:48:11
references:
  - https://twitter.com/splinter_code/status/1483815103279603714
  - https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
  - https://elastic.github.io/security-research/malware/2022/01/01.operation-bleeding-bear/article/
  - https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection:
        CommandLine|contains:
          - /EXEFilename
          - /CommandLine
    selection_runas:
      - CommandLine|contains:
          - ' /RunAs 8 '
          - ' /RunAs 4 '
          - ' /RunAs 10 '
          - ' /RunAs 11 '
      - CommandLine|endswith:
          - /RunAs 8
          - /RunAs 4
          - /RunAs 10
          - /RunAs 11
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/21
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1134.002
  - DEMO
