
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious RASdial Activity
id: 6bba49bf-7f8c-47d6-a1bb-6b4dece4640e
status: test
description: Detects suspicious process related to rasdial.exe
author: juju4
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/01/16 13:18:01
references:
  - https://twitter.com/subTee/status/891298217907830785
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith: rasdial.exe
falsepositives: False positives depend on scripts and administrative tools used in
    the monitored environment
level: medium
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.defense_evasion
  - attack.execution
  - attack.t1059
  - DEMO
