
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: TAIDOOR RAT DLL Load
id: d1aa3382-abab-446f-96ea-4de52908210b
status: test
description: Detects specific process characteristics of Chinese TAIDOOR RAT malware
    load
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/07/30 10:03:31
references:
  - https://us-cert.cisa.gov/ncas/analysis-reports/ar20-216a
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection1 or ( selection2a and selection2b )
    selection1:
        CommandLine|contains:
          - dll,MyStart
          - dll MyStart
    selection2a:
        CommandLine|endswith: ' MyStart'
    selection2b:
        CommandLine|contains: rundll32.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.execution
  - attack.t1055.001
  - detection.emerging_threats
  - DEMO
