
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Powershell Inline Execution From A File
id: ee218c12-627a-4d27-9e30-d6fb2fe22ed2
status: test
description: Detects inline execution of PowerShell code from a file
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/25 16:04:51
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=50
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_exec:
        CommandLine|contains:
          - 'iex '
          - 'Invoke-Expression '
          - 'Invoke-Command '
          - 'icm '
    selection_raw:
        CommandLine|contains: ' -raw'
    selection_read:
        CommandLine|contains:
          - 'cat '
          - 'get-content '
          - 'type '
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
