
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Indirect Inline Command Execution Via Bash.EXE
id: 5edc2273-c26f-406c-83f3-f4d948e740dd
related:
  - type: similar
    id: 2d22a514-e024-4428-9dba-41505bd63a5b
status: experimental
description: |
    Detects execution of Microsoft bash launcher with the "-c" flag.
    This can be used to potentially bypass defenses and execute Linux or Windows-based binaries directly via bash.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/11/24 17:36:21
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Bash/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains: ' -c '
    selection_img:
      - Image|endswith:
          - :\Windows\System32\bash.exe
          - :\Windows\SysWOW64\bash.exe
      - OriginalFileName: Bash.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/08/15
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
