
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious Office Document Executed From Trusted Location
id: f99abdf0-6283-4e71-bd2b-b5c048a94743
status: experimental
description: Detects the execution of an Office application that points to a document
    that is located in a trusted location. Attackers often used this to avoid macro
    security and execute their malicious code.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/21 00:35:41
references:
  - Internal Research
  - https://twitter.com/Max_Mal_/status/1633863678909874176
  - https://techcommunity.microsoft.com/t5/microsoft-365-blog/new-security-hardening-policies-for-trusted-documents/ba-p/3023465
  - https://twitter.com/_JohnHammond/status/1588155401752788994
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_main_*
    filter_main_dotx:
        CommandLine|endswith:
          - .dotx
          - .xltx
          - .potx
    selection_img:
      - Image|endswith:
          - \EXCEL.EXE
          - \POWERPNT.EXE
          - \WINWORD.exe
      - OriginalFileName:
          - Excel.exe
          - POWERPNT.EXE
          - WinWord.exe
    selection_parent:
        ParentImage|endswith:
          - \explorer.exe
          - \dopus.exe
    selection_trusted_location:
        CommandLine|contains:
          - \AppData\Roaming\Microsoft\Templates
          - \AppData\Roaming\Microsoft\Word\Startup\
          - \Microsoft Office\root\Templates\
          - \Microsoft Office\Templates\
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/10/18
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
