
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Renamed Rundll32 Execution
id: 2569ed8c-1147-498a-9b8c-2ad3656b10ed
related:
  - type: derived
    id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
status: test
description: Detects when 'DllRegisterServer' is called in the commandline and the
    image is not rundll32. This could mean that the 'rundll32' utility has been renamed
    in order to avoid detection
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/22 15:29:01
references:
  - https://twitter.com/swisscom_csirt/status/1331634525722521602?s=20
  - https://app.any.run/tasks/f74c5157-8508-4ac6-9805-d63fe7b0d399/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter
    filter:
        Image|endswith: \rundll32.exe
    selection:
        CommandLine|contains: DllRegisterServer
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/02/03
tags:
  - attack.execution
  - DEMO
