
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious Regsvr32 HTTP/FTP Pattern
id: 867356ee-9352-41c9-a8f2-1be690d78216
related:
  - type: obsoletes
    id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
status: experimental
description: Detects regsvr32 execution to download/install/register new DLLs that
    are hosted on Web or FTP servers.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/24 18:21:31
references:
  - https://twitter.com/mrd0x/status/1461041276514623491
  - https://twitter.com/tccontre18/status/1480950986650832903
  - https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_flag:
        CommandLine|contains:
          - ' /i'
          - ' -i'
    selection_img:
      - Image|endswith: \regsvr32.exe
      - OriginalFileName: REGSVR32.EXE
    selection_protocol:
        CommandLine|contains:
          - ftp
          - http
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/05/26
tags:
  - attack.defense_evasion
  - attack.t1218.010
  - DEMO
