
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: WmiPrvSE Spawned A Process
id: d21374ff-f574-44a7-9998-4a8c8bf33d7d
related:
  - type: similar
    id: 8a582fe2-0882-4b89-a82a-da6b2dc32937
  - type: similar
    id: 692f0bec-83ba-4d04-af7e-e884a96059b6
status: stable
description: Detects WmiPrvSE spawning a process
author: Roberto Rodriguez @Cyb3rWard0g
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/08/15 12:37:11
references:
  - https://threathunterplaybook.com/hunts/windows/190815-RemoteServiceInstallation/notebook.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_*
    filter_logonid:
        LogonId:
          - "0x3e7"
          - "null"
    filter_null:
        LogonId: []
    filter_system_user:
        User|contains:
          - AUTHORI
          - AUTORI
    filter_werfault:
        Image|endswith: \WerFault.exe
    filter_wmiprvse:
        Image|endswith: \WmiPrvSE.exe
    selection:
        ParentImage|endswith: \WmiPrvSe.exe
falsepositives: False positives are expected (e.g. in environments where WinRM is
    used legitimately)
level: medium
customer: 'demo'
modified: 2023/03/23
tags:
  - attack.execution
  - attack.t1047
  - DEMO
