
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious PowerShell Parent Process
id: 754ed792-634f-40ae-b3bc-e0448d33f695
related:
  - type: derived
    id: 692f0bec-83ba-4d04-af7e-e884a96059b6
status: test
description: Detects a suspicious or uncommon parent processes of PowerShell
author: Teymur Kheirkhabarov, Harish Segar
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/03/20 15:52:51
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=26
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_parent:
      - ParentImage|contains: tomcat
      - ParentImage|endswith:
          - \amigo.exe
          - \browser.exe
          - \chrome.exe
          - \firefox.exe
          - \httpd.exe
          - \iexplore.exe
          - \jbosssvc.exe
          - \microsoftedge.exe
          - \microsoftedgecp.exe
          - \MicrosoftEdgeSH.exe
          - \mshta.exe
          - \nginx.exe
          - \outlook.exe
          - \php-cgi.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \safari.exe
          - \services.exe
          - \sqlagent.exe
          - \sqlserver.exe
          - \sqlservr.exe
          - \vivaldi.exe
          - \w3wp.exe
    selection_powershell:
      - Image|endswith:
          - \powershell.exe
          - \pwsh.exe
      - CommandLine|contains:
          - /c powershell
          - /c pwsh
      - Description: Windows PowerShell
      - Product: PowerShell Core 6
      - OriginalFileName:
          - PowerShell.EXE
          - pwsh.dll
falsepositives: Other scripts
level: high
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
