
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Child Process Of Wermgr.EXE
id: 396f6630-f3ac-44e3-bfc8-1b161bc00c4e
related:
  - type: similar
    id: 5394fcc7-aeb2-43b5-9a09-cac9fc5edcd5
status: experimental
description: Detects suspicious Windows Error Reporting manager (wermgr.exe) child
    process
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/14 15:44:31
references:
  - https://www.trendmicro.com/en_us/research/22/j/black-basta-infiltrates-networks-via-qakbot-brute-ratel-and-coba.html
  - https://www.echotrail.io/insights/search/wermgr.exe
  - https://github.com/binderlabs/DirCreate2System
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - \cmd.exe
          - \cscript.exe
          - \ipconfig.exe
          - \mshta.exe
          - \net.exe
          - \net1.exe
          - \netstat.exe
          - \nslookup.exe
          - \powershell_ise.exe
          - \powershell.exe
          - \pwsh.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \systeminfo.exe
          - \whoami.exe
          - \wscript.exe
        ParentImage|endswith: \wermgr.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/23
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1055
  - attack.t1036
  - DEMO
