
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Bypass UAC via CMSTP
id: e66779cc-383e-4224-a3a4-267eeb585c40
status: test
description: Detect commandline usage of Microsoft Connection Manager Profile Installer
    (cmstp.exe) to install specially formatted local .INF files
author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/24 10:35:01
references:
  - https://eqllib.readthedocs.io/en/latest/analytics/e584f1a1-c303-4885-8a66-21360c90995b.html
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.003/T1218.003.md
  - https://lolbas-project.github.io/lolbas/Binaries/Cmstp/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_cli:
        CommandLine|contains:
          - /s
          - -s
          - /au
          - -au
          - /ni
          - -ni
    selection_img:
      - Image|endswith: \cmstp.exe
      - OriginalFileName: CMSTP.EXE
fields:
  - ComputerName
  - User
  - CommandLine
falsepositives: Legitimate use of cmstp.exe utility by legitimate user
level: high
customer: 'demo'
modified: 2022/08/30
tags:
  - attack.privilege_escalation
  - attack.defense_evasion
  - attack.t1548.002
  - attack.t1218.003
  - DEMO
