
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious CustomShellHost Execution
id: 84b14121-9d14-416e-800b-f3b829c5a14d
status: test
description: Detects the execution of CustomShellHost binary where the child isn't
    located in 'C:\Windows\explorer.exe'
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/19 16:07:21
references:
  - https://github.com/LOLBAS-Project/LOLBAS/pull/180
  - https://lolbas-project.github.io/lolbas/Binaries/CustomShellHost/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter
    filter:
        Image: C:\Windows\explorer.exe
    selection:
        ParentImage|endswith: \CustomShellHost.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1216
  - DEMO
