
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: New User Created Via Net.EXE
id: cd219ff3-fa99-45d4-8380-a7d15116c6dc
related:
  - type: similar
    id: b9f0e6f5-09b4-4358-bae4-08408705bd5c
status: test
description: Identifies the creation of local users via the net.exe command.
author: Endgame, JHasenbusch (adapted to Sigma for oscd.community)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/10/30 12:38:41
references:
  - https://eqllib.readthedocs.io/en/latest/analytics/014c3f51-89c6-40f1-ac9c-5688f26090ab.html
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1136.001/T1136.001.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains|all:
          - user
          - add
    selection_img:
      - Image|endswith:
          - \net.exe
          - \net1.exe
      - OriginalFileName:
          - net.exe
          - net1.exe
falsepositives:
  - Legitimate user creation.
  - Better use event IDs for user creation rather than command line rules.
level: medium
customer: 'demo'
modified: 2023/02/21
tags:
  - attack.persistence
  - attack.t1136.001
  - DEMO
