
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Microsoft IIS Service Account Password Dumped
id: 2d3cdeec-c0db-45b4-aa86-082f7eb75701
status: test
description: Detects the Internet Information Services (IIS) command-line tool, AppCmd,
    being used to list passwords
author: Tim Rauch, Janantha Marasinghe, Elastic (original idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/11/08 17:45:51
references:
  - https://www.elastic.co/guide/en/security/current/microsoft-iis-service-account-password-dumped.html
  - https://twitter.com/0gtweet/status/1588815661085917186?cxt=HHwWhIDUyaDbzYwsAAAA
  - https://www.netspi.com/blog/technical/network-penetration-testing/decrypting-iis-passwords-to-break-out-of-the-dmz-part-2/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_base_* and (selection_standalone or all of selection_cmd_*)
    selection_base_list:
        CommandLine|contains: 'list '
    selection_base_name:
      - Image|endswith: \appcmd.exe
      - OriginalFileName: appcmd.exe
    selection_cmd_flags:
        CommandLine|contains:
          - ' /@t'
          - ' /text'
          - ' /show'
          - ' -@t'
          - ' -text'
          - ' -show'
    selection_cmd_grep:
        CommandLine|contains:
          - :\*
          - password
    selection_standalone:
        CommandLine|contains:
          - ' /config'
          - ' /xml'
          - ' -config'
          - ' -xml'
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/22
tags:
  - attack.credential_access
  - attack.t1003
  - DEMO
