
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential RDP Session Hijacking Activity
id: 224f140f-3553-4cd1-af78-13d81bf9f7cc
status: test
description: Detects potential RDP Session Hijacking activity on Windows systems
author: '@juju4'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/27 16:31:51
references:
  - https://twitter.com/Moti_B/status/909449115477659651
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_img:
      - Image|endswith: \tscon.exe
      - OriginalFileName: tscon.exe
    selection_integrity:
        IntegrityLevel: SYSTEM
falsepositives: Administrative activity
level: medium
customer: 'demo'
tags:
  - attack.execution
  - DEMO
