
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Imports Registry Key From a File
id: 73bba97f-a82d-42ce-b315-9182e76c57b1
related:
  - type: similar
    id: 0b80ade5-6997-4b1d-99a1-71701778ea61
status: test
description: Detects the import of the specified file to the registry with regedit.exe.
author: Oddvar Moe, Sander Wiebing, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/07 14:11:31
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Regedit/
  - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not all of filter_*
    filter_1:
        CommandLine|contains|windash:
          - ' -e '
          - ' -a '
          - ' -c '
    filter_2:
        CommandLine|re: :[^ \\]
    selection_cli:
        CommandLine|contains:
          - ' /i '
          - ' /s '
          - .reg
    selection_img:
      - Image|endswith: \regedit.exe
      - OriginalFileName: REGEDIT.EXE
fields:
  - ParentImage
  - CommandLine
falsepositives:
  - Legitimate import of keys
  - Evernote
level: medium
customer: 'demo'
modified: 2024/03/13
tags:
  - attack.t1112
  - attack.defense_evasion
  - DEMO
