
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PUA - NSudo Execution
id: 771d1eb5-9587-4568-95fb-9ec44153a012
status: test
description: Detects the use of NSudo tool for command execution
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/24 11:01:21
references:
  - https://nsudo.m2team.org/en-us/
  - https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains:
          - '-U:S '
          - '-U:T '
          - '-U:E '
          - '-P:E '
          - '-M:S '
          - '-M:H '
          - '-U=S '
          - '-U=T '
          - '-U=E '
          - '-P=E '
          - '-M=S '
          - '-M=H '
          - -ShowWindowMode:Hide
    selection_img:
      - Image|endswith:
          - \NSudo.exe
          - \NSudoLC.exe
          - \NSudoLG.exe
      - OriginalFileName:
          - NSudo.exe
          - NSudoLC.exe
          - NSudoLG.exe
falsepositives: Legitimate use by administrators
level: high
customer: 'demo'
modified: 2023/02/13
tags:
  - attack.execution
  - attack.t1569.002
  - attack.s0029
  - DEMO
