
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-06-21 19:00
# Generated for User: demo
# Number of Rules: 3228
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Arbitrary File Download Via Cmdl32.EXE
id: f37aba28-a9e6-4045-882c-d5004043b337
status: test
description: |
    Detects execution of Cmdl32 with the "/vpn" and "/lan" flags.
    Attackers can abuse this utility in order to download arbitrary files via a configuration file.
    Inspect the location and the content of the file passed as an argument in order to determine if it is suspicious.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/11/03 17:56:51
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Cmdl32/
  - https://twitter.com/SwiftOnSecurity/status/1455897435063074824
  - https://github.com/LOLBAS-Project/LOLBAS/pull/151
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains|all:
          - /vpn
          - /lan
    selection_img:
      - Image|endswith: \cmdl32.exe
      - OriginalFileName: CMDL32.EXE
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2024/04/22
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218
  - attack.t1202
  - DEMO
