
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious Child Process Of VsCode
id: 5a3164f2-b373-4152-93cf-090b13c12d27
status: experimental
description: Detects uncommon or suspicious child processes spawning from a VsCode
    "code.exe" process. This could indicate an attempt of persistence via VsCode tasks
    or terminal profiles.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/26 18:12:01
references:
  - https://twitter.com/nas_bench/status/1618021838407495681
  - https://twitter.com/nas_bench/status/1618021415852335105
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_parent and 1 of selection_children_*
    selection_children_cli:
        CommandLine|contains:
          - Invoke-Expressions
          - IEX
          - Invoke-Command
          - ICM
          - DownloadString
          - rundll32
          - regsvr32
          - wscript
          - cscript
        Image|endswith:
          - \powershell.exe
          - \pwsh.exe
          - \cmd.exe
    selection_children_images:
        Image|endswith:
          - \calc.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \cscript.exe
          - \wscript.exe
    selection_children_paths:
        Image|contains:
          - :\Users\Public\
          - :\Windows\Temp\
          - :\Temp\
    selection_parent:
        ParentImage|endswith: \code.exe
falsepositives: In development environment where VsCode is used heavily. False positives
    may occur when developers use task to compile or execute different types of code.
    Remove or add processes accordingly
level: medium
customer: 'demo'
modified: 2023/10/25
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218
  - attack.t1202
  - DEMO
