
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Cookies Session Hijacking
id: 5a6e1e16-07de-48d8-8aae-faa766c05e88
status: experimental
description: Detects execution of "curl.exe" with the "-c" flag in order to save cookie
    data.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/07/27 15:26:51
references:
  - https://curl.se/docs/manpage.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
      - CommandLine|re: \s-c\s
      - CommandLine|contains: --cookie-jar
    selection_img:
      - Image|endswith: \curl.exe
      - OriginalFileName: curl.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.execution
  - DEMO
