
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential SysInternals ProcDump Evasion
id: 79b06761-465f-4f88-9ef2-150e24d3d737
status: test
description: Detects uses of the SysInternals ProcDump utility in which ProcDump or
    its output get renamed, or a dump file is moved or copied to a different name
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/11 16:39:41
references:
  - https://twitter.com/mrd0x/status/1480785527901204481
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_1:
        CommandLine|contains:
          - copy procdump
          - move procdump
    selection_2:
        CommandLine|contains:
          - 2.dmp
          - lsass
          - out.dmp
        CommandLine|contains|all:
          - 'copy '
          - '.dmp '
    selection_3:
        CommandLine|contains:
          - copy lsass.exe_
          - move lsass.exe_
falsepositives: False positives are expected in cases in which ProcDump just gets
    copied to a different directory without any renaming
level: high
customer: 'demo'
modified: 2023/05/09
tags:
  - attack.defense_evasion
  - attack.t1036
  - attack.t1003.001
  - DEMO
