
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Scheduled Task Creation via Masqueraded XML File
id: dd2a821e-3b07-4d3b-a9ac-929fe4c6ca0c
status: test
description: Detects the creation of a scheduled task using the "-XML" flag with a
    file without the '.xml' extension. This behavior could be indicative of potential
    defense evasion attempt during persistence
author: Swachchhanda Shrawan Poudel, Elastic (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/20 21:19:31
references:
  - https://docs.microsoft.com/en-us/windows/win32/taskschd/daily-trigger-example--xml-
  - https://github.com/elastic/protections-artifacts/blob/084067123d3328a823b1c3fdde305b694275c794/behavior/rules/persistence_suspicious_scheduled_task_creation_via_masqueraded_xml_file.toml
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_extension_xml:
        CommandLine|contains: .xml
    filter_main_rundll32:
        ParentCommandLine|contains|all:
          - :\WINDOWS\Installer\MSI
          - .tmp,zzzzInvokeManagedCustomActionOutOfProc
        ParentImage|endswith: \rundll32.exe
    filter_main_system_process:
        IntegrityLevel: System
    filter_optional_third_party:
        ParentImage|endswith:
          - :\ProgramData\OEM\UpgradeTool\CareCenter_*\BUnzip\Setup_msi.exe
          - :\Program Files\Axis Communications\AXIS Camera Station\SetupActions.exe
          - :\Program Files\Axis Communications\AXIS Device Manager\AdmSetupActions.exe
          - :\Program Files (x86)\Zemana\AntiMalware\AntiMalware.exe
          - :\Program Files\Dell\SupportAssist\pcdrcui.exe
    selection_cli_create:
        CommandLine|contains:
          - /create
          - -create
    selection_cli_xml:
        CommandLine|contains:
          - /xml
          - -xml
    selection_img:
      - Image|endswith: \schtasks.exe
      - OriginalFileName: schtasks.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.t1036.005
  - attack.t1053.005
  - DEMO
