
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious Child Process Of ClickOnce Application
id: 67bc0e75-c0a9-4cfc-8754-84a505b63c04
status: experimental
description: Detects potentially suspicious child processes of a ClickOnce deployment
    application
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/12 22:16:31
references:
  - https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - \calc.exe
          - \cmd.exe
          - \cscript.exe
          - \explorer.exe
          - \mshta.exe
          - \net.exe
          - \net1.exe
          - \nltest.exe
          - \notepad.exe
          - \powershell.exe
          - \pwsh.exe
          - \reg.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \schtasks.exe
          - \werfault.exe
          - \wscript.exe
        ParentImage|contains: \AppData\Local\Apps\2.0\
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.defense_evasion
  - DEMO
