
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Conhost Spawned By Uncommon Parent Process
id: cbb9e3d1-2386-4e59-912e-62f1484f7a89
status: test
description: Detects when the Console Window Host (conhost.exe) process is spawned
    by an uncommon parent process, which could be indicative of potential code injection
    activity.
author: Tim Rauch, Elastic (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/28 17:06:41
references:
  - https://www.elastic.co/guide/en/security/current/conhost-spawned-by-suspicious-parent-process.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_svchost:
        ParentCommandLine|contains:
          - -k apphost -s AppHostSvc
          - -k imgsvc
          - -k localService -p -s RemoteRegistry
          - -k LocalSystemNetworkRestricted -p -s NgcSvc
          - -k NetSvcs -p -s NcaSvc
          - -k netsvcs -p -s NetSetupSvc
          - -k netsvcs -p -s wlidsvc
          - -k NetworkService -p -s DoSvc
          - -k wsappx -p -s AppXSvc
          - -k wsappx -p -s ClipSVC
    filter_optional_dropbox:
        ParentCommandLine|contains:
          - C:\Program Files (x86)\Dropbox\Client\
          - C:\Program Files\Dropbox\Client\
    selection:
        Image|endswith: \conhost.exe
        ParentImage|endswith:
          - \explorer.exe
          - \lsass.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \services.exe
          - \smss.exe
          - \spoolsv.exe
          - \svchost.exe
          - \userinit.exe
          - \wininit.exe
          - \winlogon.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/03/29
tags:
  - attack.execution
  - attack.t1059
  - DEMO
