
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Over Permissive Permissions Granted Using Dsacls.EXE
id: 01c42d3c-242d-4655-85b2-34f1739632f7
status: test
description: Detects usage of Dsacls to grant over permissive permissions
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/20 23:00:11
references:
  - https://ss64.com/nt/dsacls.html
  - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_flag:
        CommandLine|contains: ' /G '
    selection_img:
      - Image|endswith: \dsacls.exe
      - OriginalFileName: DSACLS.EXE
    selection_permissions:
        CommandLine|contains:
          - GR
          - GE
          - GW
          - GA
          - WP
          - WD
falsepositives: Legitimate administrators granting over permissive permissions to
    users
level: medium
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
