
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Turla Group Lateral Movement
id: c601f20d-570a-4cde-a7d6-e17f99cb8e7f
status: test
description: Detects automated lateral movement by Turla group
author: Markus Neis
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/11/07 13:28:51
references:
  - https://securelist.com/the-epic-turla-operation/65545/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine:
          - net use \\\\%DomainController%\C$ "P@ssw0rd" *
          - dir c:\\*.doc* /s
          - dir %TEMP%\\*.exe
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.g0010
  - attack.execution
  - attack.t1059
  - attack.lateral_movement
  - attack.t1021.002
  - attack.discovery
  - attack.t1083
  - attack.t1135
  - detection.emerging_threats
  - DEMO
