
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious High IntegrityLevel Conhost Legacy Option
id: 3037d961-21e9-4732-b27a-637bcc7bf539
status: test
description: ForceV1 asks for information directly from the kernel space. Conhost
    connects to the console application. High IntegrityLevel means the process is
    running with elevated privileges, such as an Administrator context.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/09 20:01:41
references:
  - https://cybercryptosec.medium.com/covid-19-cyber-infection-c615ead7c29
  - https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/
  - https://learn.microsoft.com/en-us/windows/win32/secauthz/mandatory-integrity-control
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - conhost.exe
          - "0xffffffff"
          - -ForceV1
        IntegrityLevel: High
falsepositives: Very Likely, including launching cmd.exe via Run As Administrator
level: informational
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
