
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Privilege Escalation via Named Pipe Impersonation
id: 9bd04a79-dabe-4f1f-a5ff-92430265c96b
related:
  - type: derived
    id: f35c5d71-b489-4e22-a115-f003df287317
status: test
description: Detects a remote file copy attempt to a hidden network share. This may
    indicate lateral movement or data staging activity.
author: Tim Rauch, Elastic (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/27 19:04:51
references:
  - https://www.elastic.co/guide/en/security/current/privilege-escalation-via-named-pipe-impersonation.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_args:
        CommandLine|contains|all:
          - echo
          - '>'
          - \\\\.\\pipe\\
    selection_name:
      - Image|endswith:
          - \cmd.exe
          - \powershell.exe
      - OriginalFileName:
          - Cmd.Exe
          - PowerShell.EXE
falsepositives: Other programs that cause these patterns (please report)
level: high
customer: 'demo'
modified: 2022/12/30
tags:
  - attack.lateral_movement
  - attack.t1021
  - DEMO
