
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Credential Dumping Via WER
id: 9a4ccd1a-3526-4d99-b980-9f9c5d3a6ff3
status: test
description: Detects potential credential dumping via Windows Error Reporting LSASS
    Shtinkering technique which uses the Windows Error Reporting to dump lsass
author: '@pbssubhash , Nasreddine Bencherchali'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/08 15:16:51
references:
  - https://github.com/deepinstinct/Lsass-Shtinkering
  - https://media.defcon.org/DEF%20CON%2030/DEF%20CON%2030%20presentations/Asaf%20Gilboa%20-%20LSASS%20Shtinkering%20Abusing%20Windows%20Error%20Reporting%20to%20Dump%20LSASS.pdf
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_*
    filter_lsass:
        ParentImage: C:\Windows\System32\lsass.exe
    selection_cli:
        CommandLine|contains|all:
          - ' -u -p '
          - ' -ip '
          - ' -s '
        ParentUser|contains:
          - AUTHORI
          - AUTORI
        User|contains:
          - AUTHORI
          - AUTORI
    selection_img:
      - Image|endswith: \Werfault.exe
      - OriginalFileName: WerFault.exe
falsepositives: Windows Error Reporting might produce similar behavior. In that case,
    check the PID associated with the "-p" parameter in the CommandLine.
level: high
customer: 'demo'
modified: 2022/12/09
tags:
  - attack.credential_access
  - attack.t1003.001
  - DEMO
