
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - SharPersist Execution
id: 26488ad0-f9fd-4536-876f-52fea846a2e4
status: test
description: Detects the execution of the hacktool SharPersist - used to deploy various
    different kinds of persistence mechanisms
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/15 14:23:41
references:
  - https://www.mandiant.com/resources/blog/sharpersist-windows-persistence-toolkit
  - https://github.com/mandiant/SharPersist
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_cli_1:
        CommandLine|contains:
          - ' -t schtask -c '
          - ' -t startupfolder -c '
    selection_cli_2:
        CommandLine|contains|all:
          - ' -t reg -c '
          - ' -m add'
    selection_cli_3:
        CommandLine|contains|all:
          - ' -t service -c '
          - ' -m add'
    selection_cli_4:
        CommandLine|contains|all:
          - ' -t schtask -c '
          - ' -m add'
    selection_img:
      - Image|endswith: \SharPersist.exe
      - Product: SharPersist
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.persistence
  - attack.t1053
  - DEMO
