
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Windows Firewall Disabled via PowerShell
id: 12f6b752-042d-483e-bf9c-915a6d06ad75
related:
  - type: similar
    id: 488b44e7-3781-4a71-888d-c95abfacf44d
status: test
description: Detects attempts to disable the Windows Firewall using PowerShell
author: Tim Rauch, Elastic (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/14 16:39:41
references:
  - https://www.elastic.co/guide/en/security/current/windows-firewall-disabled-via-powershell.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_args:
        CommandLine|contains|all:
          - 'Set-NetFirewallProfile '
          - ' -Enabled '
          - ' False'
    selection_name:
      - Image|endswith:
          - \powershell.exe
          - \pwsh.exe
          - \powershell_ise.exe
      - OriginalFileName:
          - PowerShell.EXE
          - pwsh.dll
    selection_opt:
        CommandLine|contains:
          - ' -All '
          - Public
          - Domain
          - Private
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/02/13
tags:
  - attack.defense_evasion
  - attack.t1562
  - DEMO
