
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Shadow Copies Deletion Using Operating Systems Utilities
id: c947b146-0abc-4c87-9c64-b17e9d7274a2
status: stable
description: Shadow Copies deletion using operating systems utilities
author: Florian Roth (Nextron Systems), Michael Haag, Teymur Kheirkhabarov, Daniil
    Yugoslavskiy, oscd.community, Andreas Hunkeler (@Karneades)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/22 21:01:21
references:
  - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
  - https://blog.talosintelligence.com/2017/05/wannacry.html
  - https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/new-teslacrypt-ransomware-arrives-via-spam/
  - https://www.bleepingcomputer.com/news/security/why-everyone-should-disable-vssadmin-exe-now/
  - https://www.hybrid-analysis.com/sample/ed01ebfbc9eb5bbea545af4d01bf5f1071661840480439c6e5babe8e080e41aa?environmentId=100
  - https://github.com/Neo23x0/Raccine#the-process
  - https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/gen_ransomware_command_lines.yar
  - https://redcanary.com/blog/intelligence-insights-october-2021/
  - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/blackbyte-exbyte-ransomware
logsource:
    category: process_creation
    product: windows
detection:
    condition: (all of selection1*) or (all of selection2*) or (all of selection3*)
    selection1_cli:
        CommandLine|contains|all:
          - shadow
          - delete
    selection1_img:
      - Image|endswith:
          - \powershell.exe
          - \pwsh.exe
          - \wmic.exe
          - \vssadmin.exe
          - \diskshadow.exe
      - OriginalFileName:
          - PowerShell.EXE
          - pwsh.dll
          - wmic.exe
          - VSSADMIN.EXE
          - diskshadow.exe
    selection2_cli:
        CommandLine|contains|all:
          - delete
          - catalog
          - quiet
    selection2_img:
      - Image|endswith: \wbadmin.exe
      - OriginalFileName: WBADMIN.EXE
    selection3_cli:
        CommandLine|contains:
          - unbounded
          - /MaxSize=
        CommandLine|contains|all:
          - resize
          - shadowstorage
    selection3_img:
      - Image|endswith: \vssadmin.exe
      - OriginalFileName: VSSADMIN.EXE
fields:
  - CommandLine
  - ParentCommandLine
falsepositives:
  - Legitimate Administrator deletes Shadow Copies using operating systems utilities
    for legitimate reason
  - LANDesk LDClient Ivanti-PSModule (PS EncodedCommand)
level: high
customer: 'demo'
modified: 2022/11/03
tags:
  - attack.defense_evasion
  - attack.impact
  - attack.t1070
  - attack.t1490
  - DEMO
