
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Hiding Files with Attrib.exe
id: 4281cb20-2994-4580-aa63-c8b86d019934
status: test
description: Detects usage of attrib.exe to hide files from users.
author: Sami Ruohonen
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/01/16 13:16:01
references:
  - https://unit42.paloaltonetworks.com/unit42-sure-ill-take-new-combojack-malware-alters-clipboards-steal-cryptocurrency/
  - https://www.uptycs.com/blog/lolbins-are-no-laughing-matter
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_*
    filter_intel:
        CommandLine: +R +H +S +A \\\*.cui
        ParentCommandLine: C:\\WINDOWS\\system32\\\*.bat
        ParentImage|endswith: \cmd.exe
    filter_msiexec:
        CommandLine|contains: '\desktop.ini '
    selection_cli:
        CommandLine|contains: ' +h '
    selection_img:
      - Image|endswith: \attrib.exe
      - OriginalFileName: ATTRIB.EXE
falsepositives:
  - IgfxCUIService.exe hiding *.cui files via .bat script (attrib.exe a child of cmd.exe
    and igfxCUIService.exe is the parent of the cmd.exe)
  - Msiexec.exe hiding desktop.ini
level: medium
customer: 'demo'
modified: 2023/03/14
tags:
  - attack.defense_evasion
  - attack.t1564.001
  - DEMO
