
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious Regsvr32 HTTP IP Pattern
id: 2dd2c217-bf68-437a-b57c-fe9fd01d5de8
status: experimental
description: Detects regsvr32 execution to download and install DLLs located remotely
    where the address is an IP address.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/11 18:05:31
references:
  - https://twitter.com/mrd0x/status/1461041276514623491
  - https://twitter.com/tccontre18/status/1480950986650832903
  - https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_img:
      - Image|endswith: \regsvr32.exe
      - OriginalFileName: REGSVR32.EXE
    selection_ip:
        CommandLine|contains:
          - ' /i:http://1'
          - ' /i:http://2'
          - ' /i:http://3'
          - ' /i:http://4'
          - ' /i:http://5'
          - ' /i:http://6'
          - ' /i:http://7'
          - ' /i:http://8'
          - ' /i:http://9'
          - ' /i:https://1'
          - ' /i:https://2'
          - ' /i:https://3'
          - ' /i:https://4'
          - ' /i:https://5'
          - ' /i:https://6'
          - ' /i:https://7'
          - ' /i:https://8'
          - ' /i:https://9'
          - ' -i:http://1'
          - ' -i:http://2'
          - ' -i:http://3'
          - ' -i:http://4'
          - ' -i:http://5'
          - ' -i:http://6'
          - ' -i:http://7'
          - ' -i:http://8'
          - ' -i:http://9'
          - ' -i:https://1'
          - ' -i:https://2'
          - ' -i:https://3'
          - ' -i:https://4'
          - ' -i:https://5'
          - ' -i:https://6'
          - ' -i:https://7'
          - ' -i:https://8'
          - ' -i:https://9'
falsepositives: FQDNs that start with a number such as "7-Zip"
level: high
customer: 'demo'
modified: 2023/05/24
tags:
  - attack.defense_evasion
  - attack.t1218.010
  - DEMO
