
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PowerShell Base64 Encoded IEX Cmdlet
id: 88f680b8-070e-402c-ae11-d2914f2257f1
status: test
description: Detects usage of a base64 encoded "IEX" cmdlet in a process command line
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/08/23 14:47:11
references:
  - Internal Research
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - CommandLine|base64offset|contains:
          - IEX ([
          - iex ([
          - iex (New
          - IEX (New
          - IEX([
          - iex([
          - iex(New
          - IEX(New
          - IEX(('
          - iex(('
      - CommandLine|contains:
          - SQBFAFgAIAAoAFsA
          - kARQBYACAAKABbA
          - JAEUAWAAgACgAWw
          - aQBlAHgAIAAoAFsA
          - kAZQB4ACAAKABbA
          - pAGUAeAAgACgAWw
          - aQBlAHgAIAAoAE4AZQB3A
          - kAZQB4ACAAKABOAGUAdw
          - pAGUAeAAgACgATgBlAHcA
          - SQBFAFgAIAAoAE4AZQB3A
          - kARQBYACAAKABOAGUAdw
          - JAEUAWAAgACgATgBlAHcA
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/04/06
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
