
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Remote File Download Via Desktopimgdownldr Utility
id: 214641c2-c579-4ecb-8427-0cf19df6842e
status: test
description: Detects the desktopimgdownldr utility being used to download a remote
    file. An adversary may use desktopimgdownldr to download arbitrary files as an
    alternative to certutil.
author: Tim Rauch, Elastic (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/27 19:26:51
references:
  - https://www.elastic.co/guide/en/security/current/remote-file-download-via-desktopimgdownldr-utility.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains: /lockscreenurl:http
        Image|endswith: \desktopimgdownldr.exe
        ParentImage|endswith: \desktopimgdownldr.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
