
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Use Short Name Path in Image
id: a96970af-f126-420d-90e1-d37bf25e50e1
related:
  - type: similar
    id: 349d891d-fef0-4fe4-bc53-eee623a15969
status: test
description: Detect use of the Windows 8.3 short name. Which could be used as a method
    to avoid Image detection
author: frack113, Nasreddine Bencherchali
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/07 12:51:31
references:
  - https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
  - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN
  - https://twitter.com/frack113/status/1555830623633375232
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter*
    filter_installers:
      - Image|contains|all:
          - \AppData\
          - \Temp\
      - Image|endswith:
          - ~1\unzip.exe
          - ~1\7zG.exe
    filter1:
      - ParentImage:
          - C:\Windows\System32\Dism.exe
          - C:\Windows\System32\cleanmgr.exe
      - ParentImage|endswith:
          - \WebEx\WebexHost.exe
          - \thor\thor64.exe
      - Product: InstallShield (R)
      - Description: InstallShield (R) Setup Engine
      - Company: InstallShield Software Corporation
    selection:
        Image|contains:
          - ~1\
          - ~2\
falsepositives: Applications could use this notation occasionally which might generate
    some false positives. In that case Investigate the parent and child process.
level: medium
customer: 'demo'
modified: 2023/03/21
tags:
  - attack.defense_evasion
  - attack.t1564.004
  - DEMO
