
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Suspicious Activity Using SeCEdit
id: c2c76b77-32be-4d1f-82c9-7e544bdfe0eb
status: test
description: Detects potential suspicious behaviour using secedit.exe. Such as exporting
    or modifying the security policy
author: Janantha Marasinghe
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/11/18 17:32:31
references:
  - https://blueteamops.medium.com/secedit-and-i-know-it-595056dee53d
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/secedit
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_img and (1 of selection_flags_*)
    selection_flags_configure:
        CommandLine|contains|all:
          - /configure
          - /db
    selection_flags_discovery:
        CommandLine|contains|all:
          - /export
          - /cfg
    selection_img:
      - Image|endswith: \secedit.exe
      - OriginalFileName: SeCEdit
falsepositives: Legitimate administrative use
level: medium
customer: 'demo'
modified: 2022/12/30
tags:
  - attack.discovery
  - attack.persistence
  - attack.defense_evasion
  - attack.credential_access
  - attack.privilege_escalation
  - attack.t1562.002
  - attack.t1547.001
  - attack.t1505.005
  - attack.t1556.002
  - attack.t1562
  - attack.t1574.007
  - attack.t1564.002
  - attack.t1546.008
  - attack.t1546.007
  - attack.t1547.014
  - attack.t1547.010
  - attack.t1547.002
  - attack.t1557
  - attack.t1082
  - DEMO
