
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - SharpView Execution
id: b2317cfa-4a47-4ead-b3ff-297438c0bc2d
related:
  - type: similar
    id: dcd74b95-3f36-4ed9-9598-0490951643aa
status: test
description: Adversaries may look for details about the network configuration and
    settings of systems they access or through information discovery of remote systems
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/10 13:46:31
references:
  - https://github.com/tevora-threat/SharpView/
  - https://github.com/PowerShellMafia/PowerSploit/blob/dev/Recon/PowerView.ps1
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md#atomic-test-4---system-discovery-using-sharpview
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - OriginalFileName: SharpView.exe
      - Image|endswith: \SharpView.exe
      - CommandLine|contains:
          - Add-RemoteConnection
          - Convert-ADName
          - ConvertFrom-SID
          - ConvertFrom-UACValue
          - Convert-SidToName
          - Export-PowerViewCSV
          - Find-DomainObjectPropertyOutlier
          - Find-DomainProcess
          - Find-DomainShare
          - Find-DomainUserEvent
          - Find-DomainUserLocation
          - Find-ForeignGroup
          - Find-ForeignUser
          - Find-GPOComputerAdmin
          - Find-GPOLocation
          - Find-Interesting
          - Find-LocalAdminAccess
          - Find-ManagedSecurityGroups
          - Get-CachedRDPConnection
          - Get-DFSshare
          - Get-DomainComputer
          - Get-DomainController
          - Get-DomainDFSShare
          - Get-DomainDNSRecord
          - Get-DomainFileServer
          - Get-DomainForeign
          - Get-DomainGPO
          - Get-DomainGroup
          - Get-DomainGUIDMap
          - Get-DomainManagedSecurityGroup
          - Get-DomainObject
          - Get-DomainOU
          - Get-DomainPolicy
          - Get-DomainSID
          - Get-DomainSite
          - Get-DomainSPNTicket
          - Get-DomainSubnet
          - Get-DomainTrust
          - Get-DomainUserEvent
          - Get-ForestDomain
          - Get-ForestGlobalCatalog
          - Get-ForestTrust
          - Get-GptTmpl
          - Get-GroupsXML
          - Get-LastLoggedOn
          - Get-LoggedOnLocal
          - Get-NetComputer
          - Get-NetDomain
          - Get-NetFileServer
          - Get-NetForest
          - Get-NetGPO
          - Get-NetGroupMember
          - Get-NetLocalGroup
          - Get-NetLoggedon
          - Get-NetOU
          - Get-NetProcess
          - Get-NetRDPSession
          - Get-NetSession
          - Get-NetShare
          - Get-NetSite
          - Get-NetSubnet
          - Get-NetUser
          - Get-PathAcl
          - Get-PrincipalContext
          - Get-RegistryMountedDrive
          - Get-RegLoggedOn
          - Get-WMIRegCachedRDPConnection
          - Get-WMIRegLastLoggedOn
          - Get-WMIRegMountedDrive
          - Get-WMIRegProxy
          - Invoke-ACLScanner
          - Invoke-CheckLocalAdminAccess
          - Invoke-Kerberoast
          - Invoke-MapDomainTrust
          - Invoke-RevertToSelf
          - Invoke-Sharefinder
          - Invoke-UserImpersonation
          - Remove-DomainObjectAcl
          - Remove-RemoteConnection
          - Request-SPNTicket
          - Set-DomainObject
          - Test-AdminAccess
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/14
tags:
  - attack.discovery
  - attack.t1049
  - attack.t1069.002
  - attack.t1482
  - attack.t1135
  - attack.t1033
  - DEMO
