
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Use of Setres.exe
id: 835e75bf-4bfd-47a4-b8a6-b766cac8bcb7
status: test
description: Detects the use of Setres.exe to set the screen resolution and then potentially
    launch a file named "choice" (with any executable extension such as ".cmd" or
    ".exe") from the current execution path
author: '@gott_cyber'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/11 10:22:41
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Setres/
  - https://twitter.com/0gtweet/status/1583356502340870144
  - https://strontic.github.io/xcyclopedia/library/setres.exe-0E30E4C09637D7A128A37B59A3BC4D09.html
  - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731033(v=ws.11)
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith: \choice
        ParentImage|endswith: \setres.exe
falsepositives: Legitimate usage of Setres
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218
  - attack.t1202
  - DEMO
