
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: SystemStateBackup Deleted Using Wbadmin.EXE
id: 89f75308-5b1b-4390-b2d8-d6b2340efaf8
status: test
description: |
    Deletes the Windows systemstatebackup using wbadmin.exe.
    This technique is used by numerous ransomware families.
    This may only be successful on server platforms that have Windows Backup enabled.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/13 17:13:51
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-5---windows---delete-volume-shadow-copies-via-wmi-with-powershell
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains|all:
          - 'delete '
          - 'systemstatebackup '
          - -keepVersions:0
    selection_img:
      - Image|endswith: \wbadmin.exe
      - OriginalFileName: WBADMIN.EXE
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.impact
  - attack.t1490
  - DEMO
