
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential DLL File Download Via PowerShell Invoke-WebRequest
id: 0f0450f3-8b47-441e-a31b-15a91dc243e2
status: test
description: Detects potential DLL files being downloaded using the PowerShell Invoke-WebRequest
    cmdlet
author: Florian Roth (Nextron Systems), Hieu Tran
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/03/13 21:29:31
references:
  - https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - 'Invoke-WebRequest '
          - 'IWR '
        CommandLine|contains|all:
          - http
          - OutFile
          - .dll
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.command_and_control
  - attack.execution
  - attack.t1059.001
  - attack.t1105
  - DEMO
