
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Nltest.EXE Execution
id: 903076ff-f442-475a-b667-4f246bcc203b
related:
  - type: similar
    id: 5cc90652-4cbd-4241-aa3b-4b462fa5a248
  - type: obsoletes
    id: eeb66bbb-3dde-4582-815a-584aee9fe6d1
status: test
description: Detects nltest commands that can be used for information discovery
author: Arun Chauhan
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/02/03 11:14:21
references:
  - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/nltest.htm
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - Image|endswith: \nltest.exe
      - OriginalFileName: nltestrk.exe
falsepositives: Legitimate administration activity
level: low
customer: 'demo'
tags:
  - attack.discovery
  - attack.t1016
  - attack.t1018
  - attack.t1482
  - DEMO
