
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Dosfuscation Activity
id: a77c1610-fc73-4019-8e29-0f51efc04a51
status: test
description: Detects possible payload obfuscation via the commandline
author: frack113, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/15 14:39:51
references:
  - https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/dosfuscation-report.pdf
  - https://github.com/danielbohannon/Invoke-DOSfuscation
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - ^^
          - ^|^
          - ',;,'
          - ;;;;
          - ;; ;;
          - (,(,
          - '%COMSPEC:~'
          - ' c^m^d'
          - ^c^m^d
          - ' c^md'
          - ' cm^d'
          - ^cm^d
          - ' s^et '
          - ' s^e^t '
          - ' se^t '
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/03/06
tags:
  - attack.execution
  - attack.t1059
  - DEMO
