
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Use Icacls to Hide File to Everyone
id: 4ae81040-fc1c-4249-bfa3-938d260214d9
status: test
description: Detect use of icacls to deny access for everyone in Users folder sometimes
    used to hide malicious files
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/18 14:44:11
references:
  - https://app.any.run/tasks/1df999e6-1cb8-45e3-8b61-499d1b7d5a9b/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_cmd:
        CommandLine|contains|all:
          - C:\Users\
          - /deny
          - '*S-1-1-0:'
    selection_icacls:
      - OriginalFileName: iCACLS.EXE
      - Image|endswith: \icacls.exe
falsepositives: Legitimate use
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1564.001
  - DEMO
