
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Deletion of Volume Shadow Copies via WMI with PowerShell
id: 21ff4ca9-f13a-41ad-b828-0077b2af2e40
related:
  - type: derived
    id: e17121b4-ef2a-4418-8a59-12fb1631fa9e
  - type: similar
    id: c1337eb8-921a-4b59-855b-4ba188ddcc42
status: test
description: Detects deletion of Windows Volume Shadow Copies with PowerShell code
    and Get-WMIObject. This technique is used by numerous ransomware families such
    as Sodinokibi/REvil
author: Tim Rauch, Elastic (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/20 20:22:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-5---windows---delete-volume-shadow-copies-via-wmi-with-powershell
  - https://www.elastic.co/guide/en/security/current/volume-shadow-copy-deletion-via-powershell.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_delete:
        CommandLine|contains:
          - .Delete()
          - Remove-WmiObject
          - rwmi
          - Remove-CimInstance
          - rcim
    selection_get:
        CommandLine|contains:
          - Get-WmiObject
          - gwmi
          - Get-CimInstance
          - gcim
    selection_shadowcopy:
        CommandLine|contains: Win32_Shadowcopy
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/12/30
tags:
  - attack.impact
  - attack.t1490
  - DEMO
