
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: New Root Certificate Installed Via Certutil.EXE
id: d2125259-ddea-4c1c-9c22-977eb5b29cf0
related:
  - type: derived
    id: 42821614-9264-4761-acfc-5772c3286f76
  - type: obsoletes
    id: 46591fae-7a4c-46ea-aec3-dff5e6d785dc
status: test
description: |
    Detects execution of "certutil" with the "addstore" flag in order to install a new certificate on the system.
    Adversaries may install a root certificate on a compromised system to avoid warnings when connecting to adversary controlled web servers.
author: oscd.community, @redcanary, Zach Stanford @svch0st
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/03/05 18:02:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli_add:
        CommandLine|contains|windash: -addstore
    selection_cli_store:
        CommandLine|contains: root
    selection_img:
      - Image|endswith: \certutil.exe
      - OriginalFileName: CertUtil.exe
falsepositives: Help Desk or IT may need to manually add a corporate Root CA on occasion.
    Need to test if GPO push doesn't trigger FP
level: medium
customer: 'demo'
modified: 2024/03/05
tags:
  - attack.defense_evasion
  - attack.t1553.004
  - DEMO
