
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Visual Studio Code Tunnel Execution
id: 90d6bd71-dffb-4989-8d86-a827fedd6624
status: experimental
description: Detects Visual Studio Code tunnel execution. Attackers can abuse this
    functionality to establish a C2 channel
author: Nasreddine Bencherchali (Nextron Systems), citron_ninja
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/25 15:17:31
references:
  - https://ipfyx.fr/post/visual-studio-code-tunnel/
  - https://badoption.eu/blog/2023/01/31/code_c2.html
  - https://code.visualstudio.com/docs/remote/tunnels
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_only_tunnel:
        CommandLine|endswith: .exe tunnel
        OriginalFileName: []
    selection_parent_tunnel:
        CommandLine|contains|all:
          - '/d /c '
          - \servers\Stable-
          - code-server.cmd
        Image|endswith: \cmd.exe
        ParentCommandLine|endswith: ' tunnel'
    selection_tunnel_args:
        CommandLine|contains|all:
          - .exe tunnel
          - '--name '
          - --accept-server-license-terms
falsepositives: Legitimate use of Visual Studio Code tunnel
level: medium
customer: 'demo'
tags:
  - attack.command_and_control
  - attack.t1071.001
  - DEMO
