
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Whoami.EXE Execution From Privileged Process
id: 79ce34ca-af29-4d0e-b832-fc1b377020db
related:
  - type: obsoletes
    id: 80167ada-7a12-41ed-b8e9-aa47195c66a1
status: experimental
description: Detects the execution of "whoami.exe" by privileged accounts that are
    often abused by threat actors
author: Florian Roth (Nextron Systems), Teymur Kheirkhabarov
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/28 17:29:11
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
  - https://nsudo.m2team.org/en-us/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_img:
      - OriginalFileName: whoami.exe
      - Image|endswith: \whoami.exe
    selection_user:
        User|contains:
          - AUTHORI
          - AUTORI
          - TrustedInstaller
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/12/04
tags:
  - attack.privilege_escalation
  - attack.discovery
  - attack.t1033
  - DEMO
