
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Findstr Launching .lnk File
id: 33339be3-148b-4e16-af56-ad16ec6c7e7b
status: test
description: Detects usage of findstr to identify and execute a lnk file as seen within
    the HHS redirect attack
author: Trent Liffick
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/05/01 12:57:01
references:
  - https://www.bleepingcomputer.com/news/security/hhsgov-open-redirect-used-by-coronavirus-phishing-to-spread-malware/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|endswith:
          - .lnk
          - .lnk"
          - .lnk'
    selection_img:
      - Image|endswith:
          - \find.exe
          - \findstr.exe
      - OriginalFileName:
          - FIND.EXE
          - FINDSTR.EXE
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2024/01/15
tags:
  - attack.defense_evasion
  - attack.t1036
  - attack.t1202
  - attack.t1027.003
  - DEMO
