
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: VeeamBackup Database Credentials Dump Via Sqlcmd.EXE
id: b57ba453-b384-4ab9-9f40-1038086b4e53
status: test
description: Detects dump of credentials in VeeamBackup dbo
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/20 19:12:11
references:
  - https://thedfirreport.com/2021/12/13/diavol-ransomware/
  - https://forums.veeam.com/veeam-backup-replication-f2/recover-esxi-password-in-veeam-t34630.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_query:
        CommandLine|contains|all:
          - SELECT
          - TOP
          - '[VeeamBackup].[dbo].[Credentials]'
    selection_tools:
        Image|endswith: \sqlcmd.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/13
tags:
  - attack.collection
  - attack.t1005
  - DEMO
