
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Terminal Service Process Spawn
id: 1012f107-b8f1-4271-af30-5aed2de89b39
status: test
description: Detects a process spawned by the terminal service server process (this
    could be an indicator for an exploitation of CVE-2019-0708)
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/05/22 14:03:31
references:
  - https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/rdp-stands-for-really-do-patch-understanding-the-wormable-rdp-vulnerability-cve-2019-0708/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_*
    filter_img:
        Image|endswith:
          - \rdpclip.exe
          - :\Windows\System32\csrss.exe
          - :\Windows\System32\wininit.exe
          - :\Windows\System32\winlogon.exe
    filter_null:
        Image: []
    selection:
        ParentCommandLine|contains|all:
          - \svchost.exe
          - termsvcs
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/25
tags:
  - attack.initial_access
  - attack.t1190
  - attack.lateral_movement
  - attack.t1210
  - car.2013-07-002
  - DEMO
