
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Download from Office Domain
id: 00d49ed5-4491-4271-a8db-650a4ef6f8c1
status: test
description: Detects suspicious ways to download files from Microsoft domains that
    are used to store attachments in Emails or OneNote documents
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/27 16:09:11
references:
  - https://twitter.com/an0n_r0/status/1474698356635193346?s=12
  - https://twitter.com/mrd0x/status/1475085452784844803?s=12
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_domains:
        CommandLine|contains:
          - https://attachment.outlook.live.net/owa/
          - https://onenoteonlinesync.onenote.com/onenoteonlinesync/
    selection_download:
      - Image|endswith:
          - \curl.exe
          - \wget.exe
      - CommandLine|contains:
          - Invoke-WebRequest
          - 'iwr '
          - 'curl '
          - 'wget '
          - Start-BitsTransfer
          - .DownloadFile(
          - .DownloadString(
falsepositives: Scripts or tools that download attachments from these domains (OneNote,
    Outlook 365)
level: high
customer: 'demo'
modified: 2022/08/02
tags:
  - attack.command_and_control
  - attack.t1105
  - attack.t1608
  - DEMO
