
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious WMIC Execution Via Office Process
id: e1693bc8-7168-4eab-8718-cdcaa68a1738
related:
  - type: derived
    id: 438025f9-5856-4663-83f7-52f878a70a50
  - type: obsoletes
    id: 518643ba-7d9c-4fa5-9f37-baed36059f6a
  - type: obsoletes
    id: 9d1c72f5-43f0-4da5-9320-648cf2099dd0
  - type: obsoletes
    id: c0e1c3d5-4381-4f18-8145-2583f06a1fe5
  - type: obsoletes
    id: 04f5363a-6bca-42ff-be70-0d28bf629ead
status: test
description: Office application called wmic to proxye execution through a LOLBIN process.
    This is often used to break suspicious parent-child chain (Office app spawns LOLBin).
author: Vadim Khrykov, Cyb3rEng
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/23 17:23:41
references:
  - https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
  - https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_parent:
        ParentImage|endswith:
          - \WINWORD.EXE
          - \EXCEL.EXE
          - \POWERPNT.exe
          - \MSPUB.exe
          - \VISIO.exe
          - \MSACCESS.EXE
          - \EQNEDT32.EXE
          - \ONENOTE.EXE
          - \wordpad.exe
          - \wordview.exe
    selection_wmic_cli:
        CommandLine|contains:
          - regsvr32
          - rundll32
          - msiexec
          - mshta
          - verclsid
          - wscript
          - cscript
        CommandLine|contains|all:
          - process
          - create
          - call
    selection_wmic_img:
      - Image|endswith: \wbem\WMIC.exe
      - OriginalFileName: wmic.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/14
tags:
  - attack.t1204.002
  - attack.t1047
  - attack.t1218.010
  - attack.execution
  - attack.defense_evasion
  - DEMO
