
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential RDP Tunneling Via Plink
id: f38ce0b9-5e97-4b47-a211-7dc8d8b871da
related:
  - type: similar
    id: f7d7ebd5-a016-46e2-9c54-f9932f2d386d
status: test
description: Execution of plink to perform data exfiltration and tunneling
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/04 14:28:01
references:
  - https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_a or all of selection_b*
    selection_a:
        CommandLine|contains: :127.0.0.1:3389
        Image|endswith: \plink.exe
    selection_b1:
        CommandLine|contains: :3389
        Image|endswith: \plink.exe
    selection_b2:
        CommandLine|contains:
          - ' -P 443'
          - ' -P 22'
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/27
tags:
  - attack.command_and_control
  - attack.t1572
  - DEMO
