
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Copy From VolumeShadowCopy Via Cmd.EXE
id: c73124a7-3e89-44a3-bdc1-25fe4df754b1
status: test
description: Detects the execution of the builtin "copy" command that targets a shadow
    copy (sometimes used to copy registry hives that are in use)
author: Max Altgelt (Nextron Systems), Tobias Michalski (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/09 15:32:41
references:
  - https://twitter.com/vxunderground/status/1423336151860002816?s=20
  - https://www.virustotal.com/gui/file/03e9b8c2e86d6db450e5eceec057d7e369ee2389b9daecaf06331a95410aa5f8/detection
  - https://pentestlab.blog/2018/07/04/dumping-domain-password-hashes/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - 'copy '
          - \\\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy
falsepositives: Backup scenarios using the commandline
level: high
customer: 'demo'
modified: 2023/03/07
tags:
  - attack.impact
  - attack.t1490
  - DEMO
