
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Crypto Mining Activity
id: 66c3b204-9f88-4d0a-a7f7-8a57d521ca55
status: stable
description: Detects command line parameters or strings often used by crypto miners
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/10/26 14:42:41
references:
  - https://www.poolwatch.io/coin/monero
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter
    filter:
        CommandLine|contains:
          - ' pool.c '
          - ' pool.o '
          - gcc -
    selection:
        CommandLine|contains:
          - ' --cpu-priority='
          - --donate-level=0
          - ' -o pool.'
          - ' --nicehash'
          - ' --algo=rx/0 '
          - stratum+tcp://
          - stratum+udp://
          - LS1kb25hdGUtbGV2ZWw9
          - 0tZG9uYXRlLWxldmVsP
          - tLWRvbmF0ZS1sZXZlbD
          - c3RyYXR1bSt0Y3A6Ly
          - N0cmF0dW0rdGNwOi8v
          - zdHJhdHVtK3RjcDovL
          - c3RyYXR1bSt1ZHA6Ly
          - N0cmF0dW0rdWRwOi8v
          - zdHJhdHVtK3VkcDovL
falsepositives:
  - Legitimate use of crypto miners
  - Some build frameworks
level: high
customer: 'demo'
modified: 2023/02/13
tags:
  - attack.impact
  - attack.t1496
  - DEMO
