
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: LOLBIN Execution Of The FTP.EXE Binary
id: 06b401f4-107c-4ff9-947f-9ec1e7649f1e
status: test
description: Detects execution of ftp.exe script execution with the "-s" or "/s" flag
    and any child processes ran by ftp.exe
author: Victor Sergeev, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/09 14:44:11
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Ftp/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_parent or all of selection_ftp_*
    selection_ftp_cli:
        CommandLine|contains:
          - '-s:'
          - '/s:'
    selection_ftp_img:
      - Image|endswith: \ftp.exe
      - OriginalFileName: ftp.exe
    selection_parent:
        ParentImage|endswith: \ftp.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/08/11
tags:
  - attack.execution
  - attack.t1059
  - attack.defense_evasion
  - attack.t1202
  - DEMO
