
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PUA- IOX Tunneling Tool Execution
id: d7654f02-e04b-4934-9838-65c46f187ebc
status: test
description: Detects the use of IOX - a tool for port forwarding and intranet proxy
    purposes
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/08 14:12:11
references:
  - https://github.com/EddieIvan01/iox
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection*
    selection:
        Image|endswith: \iox.exe
    selection_commandline:
        CommandLine|contains:
          - '.exe fwd -l '
          - '.exe fwd -r '
          - '.exe proxy -l '
          - '.exe proxy -r '
    selection_hashes:
      - Hashes|contains:
          - MD5=9DB2D314DD3F704A02051EF5EA210993
          - SHA1=039130337E28A6623ECF9A0A3DA7D92C5964D8DD
          - SHA256=C6CF82919B809967D9D90EA73772A8AA1C1EB3BC59252D977500F64F1A0D6731
      - md5: 9db2d314dd3f704a02051ef5ea210993
      - sha1: 039130337e28a6623ecf9a0a3da7d92c5964d8dd
      - sha256: c6cf82919b809967d9d90ea73772a8aa1c1eb3bc59252d977500f64f1a0d6731
falsepositives: Legitimate use
level: high
customer: 'demo'
modified: 2023/02/08
tags:
  - attack.command_and_control
  - attack.t1090
  - DEMO
