
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Mstsc.EXE Execution With Local RDP File
id: 6e22722b-dfb1-4508-a911-49ac840b40f8
status: test
description: Detects potential RDP connection via Mstsc using a local ".rdp" file
    located in suspicious locations.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/18 18:35:01
references:
  - https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
  - https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_extension:
        CommandLine|endswith:
          - .rdp
          - .rdp"
    selection_img:
      - Image|endswith: \mstsc.exe
      - OriginalFileName: mstsc.exe
    selection_paths:
        CommandLine|contains:
          - :\Users\Public\
          - :\Windows\System32\spool\drivers\color
          - ':\Windows\System32\Tasks_Migrated '
          - :\Windows\Tasks\
          - :\Windows\Temp\
          - :\Windows\Tracing\
          - \AppData\Local\Temp\
          - \Downloads\
falsepositives: Likelihood is related to how often the paths are used in the environment
level: high
customer: 'demo'
tags:
  - attack.command_and_control
  - attack.t1219
  - DEMO
