
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: New Generic Credentials Added Via Cmdkey.EXE
id: b1ec66c6-f4d1-4b5c-96dd-af28ccae7727
status: test
description: |
    Detects usage of "cmdkey.exe" to add generic credentials.
    As an example, this can be used before connecting to an RDP session via command line interface.
author: frack113, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/02/03 16:54:01
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#t1021001---remote-desktop-protocol
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli_generic:
        CommandLine|contains|windash: ' -g'
    selection_cli_password:
        CommandLine|contains|windash: ' -p'
    selection_cli_user:
        CommandLine|contains|windash: ' -u'
    selection_img:
      - Image|endswith: \cmdkey.exe
      - OriginalFileName: cmdkey.exe
falsepositives: Legitimate usage for administration purposes
level: medium
customer: 'demo'
modified: 2024/03/05
tags:
  - attack.credential_access
  - attack.t1003.005
  - DEMO
