
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Kernel Memory Dump Via LiveKD
id: c7746f1c-47d3-43d6-8c45-cd1e54b6b0a2
status: experimental
description: Detects execution of LiveKD with the "-m" flag to potentially dump the
    kernel memory
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/16 13:14:31
references:
  - https://learn.microsoft.com/en-us/sysinternals/downloads/livekd
  - https://4sysops.com/archives/creating-a-complete-memory-dump-without-a-blue-screen/
  - https://kb.acronis.com/content/60892
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains|windash: ' -m'
    selection_img:
      - Image|endswith:
          - \livekd.exe
          - \livekd64.exe
      - OriginalFileName: livekd.exe
falsepositives: Unlikely in production environment
level: high
customer: 'demo'
modified: 2024/03/13
tags:
  - attack.defense_evasion
  - DEMO
