
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Defense Evasion Via Rename Of Highly Relevant Binaries
id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
related:
  - type: similar
    id: 36480ae1-a1cb-4eaa-a0d6-29801d7e9142
  - type: derived
    id: 2569ed8c-1147-498a-9b8c-2ad3656b10ed
  - type: obsoletes
    id: a7a7e0e5-1d57-49df-9c58-9fe5bc0346a2
  - type: obsoletes
    id: d178a2d7-129a-4ba4-8ee6-d6e1fecd5d20
  - type: obsoletes
    id: d4d2574f-ac17-4d9e-b986-aeeae0dc8fe2
status: test
description: Detects the execution of a renamed binary often used by attackers or
    malware leveraging new Sysmon OriginalFileName datapoint.
author: Matthew Green - @mgreen27, Florian Roth (Nextron Systems), frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/06/15 22:31:51
references:
  - https://mgreen27.github.io/posts/2019/05/12/BinaryRename.html
  - https://mgreen27.github.io/posts/2019/05/29/BinaryRename2.html
  - https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/megacortex-ransomware-spotted-attacking-enterprise-networks
  - https://twitter.com/christophetd/status/1164506034720952320
  - https://threatresearch.ext.hp.com/svcready-a-new-loader-reveals-itself/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not filter
    filter:
        Image|endswith:
          - \certutil.exe
          - \cmstp.exe
          - \cscript.exe
          - \mshta.exe
          - \msiexec.exe
          - \powershell_ise.exe
          - \powershell.exe
          - \psexec.exe
          - \psexec64.exe
          - \PSEXESVC.exe
          - \pwsh.exe
          - \reg.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \wermgr.exe
          - \wmic.exe
          - \wscript.exe
    selection:
      - Description: Execute processes remotely
      - Product: Sysinternals PsExec
      - Description|startswith:
          - Windows PowerShell
          - pwsh
      - OriginalFileName:
          - certutil.exe
          - cmstp.exe
          - cscript.exe
          - mshta.exe
          - msiexec.exe
          - powershell_ise.exe
          - powershell.exe
          - psexec.c
          - psexec.exe
          - psexesvc.exe
          - pwsh.dll
          - reg.exe
          - regsvr32.exe
          - rundll32.exe
          - WerMgr
          - wmic.exe
          - wscript.exe
falsepositives:
  - Custom applications use renamed binaries adding slight change to binary name.
    Typically this is easy to spot and add to whitelist
  - PsExec installed via Windows Store doesn't contain original filename field (False
    negative)
level: high
customer: 'demo'
modified: 2023/08/23
tags:
  - attack.defense_evasion
  - attack.t1036.003
  - car.2013-05-009
  - DEMO
