
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Enumeration for 3rd Party Creds From CLI
id: 87a476dc-0079-4583-a985-dee7a20a03de
related:
  - type: derived
    id: e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1
status: test
description: Detects processes that query known 3rd party registry keys that holds
    credentials via commandline
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/20 15:58:01
references:
  - https://isc.sans.edu/diary/More+Data+Exfiltration/25698
  - https://github.com/synacktiv/Radmin3-Password-Cracker/blob/acfc87393e4b7c06353973a14a6c7126a51f36ac/regkey.txt
  - https://github.com/HyperSine/how-does-MobaXterm-encrypt-password
  - https://book.hacktricks.xyz/windows-hardening/windows-local-privilege-escalation#inside-the-registry
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - \Software\SimonTatham\PuTTY\Sessions
          - \Software\\SimonTatham\PuTTY\SshHostKeys\
          - \Software\Mobatek\MobaXterm\
          - \Software\WOW6432Node\Radmin\v3.0\Server\Parameters\Radmin
          - \Software\Aerofox\FoxmailPreview
          - \Software\Aerofox\Foxmail\V3.1
          - \Software\IncrediMail\Identities
          - \Software\Qualcomm\Eudora\CommandLine
          - \Software\RimArts\B2\Settings
          - \Software\OpenVPN-GUI\configs
          - \Software\Martin Prikryl\WinSCP 2\Sessions
          - \Software\FTPWare\COREFTP\Sites
          - \Software\DownloadManager\Passwords
          - \Software\OpenSSH\Agent\Keys
          - \Software\TightVNC\Server
          - \Software\ORL\WinVNC3\Password
          - \Software\RealVNC\WinVNC4
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1552.002
  - DEMO
