
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: WSL Child Process Anomaly
id: 2267fe65-0681-42ad-9a6d-46553d3f3480
related:
  - type: derived
    id: dec44ca7-61ad-493c-bfd7-8819c5faa09b
status: experimental
description: Detects uncommon or suspicious child processes spawning from a WSL process.
    This could indicate an attempt to evade parent/child relationship detections or
    persistence attempts via cron using WSL
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/23 12:20:21
references:
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/
  - https://twitter.com/nas_bench/status/1535431474429808642
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_parent and 1 of selection_children_*
    selection_children_images:
        Image|endswith:
          - \calc.exe
          - \cmd.exe
          - \cscript.exe
          - \mshta.exe
          - \powershell.exe
          - \pwsh.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \wscript.exe
    selection_children_paths:
        Image|contains:
          - \AppData\Local\Temp\
          - C:\Users\Public\
          - C:\Windows\Temp\
          - C:\Temp\
          - \Downloads\
          - \Desktop\
    selection_parent:
        ParentImage|endswith:
          - \wsl.exe
          - \wslhost.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/08/15
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218
  - attack.t1202
  - DEMO
