
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: ImagingDevices Unusual Parent/Child Processes
id: f11f2808-adb4-46c0-802a-8660db50fa99
status: test
description: Detects unusual parent or children of the ImagingDevices.exe (Windows
    Contacts) process as seen being used with Bumblebee activity
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/27 18:05:21
references:
  - https://thedfirreport.com/2022/09/26/bumblebee-round-two/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_child:
        ParentImage|endswith: \ImagingDevices.exe
    selection_parent:
        Image|endswith: \ImagingDevices.exe
        ParentImage|endswith:
          - \WmiPrvSE.exe
          - \svchost.exe
          - \dllhost.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/12/29
tags:
  - attack.defense_evasion
  - attack.execution
  - DEMO
