
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-06-21 19:00
# Generated for User: demo
# Number of Rules: 3228
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: COM Object Execution via Xwizard.EXE
id: 53d4bb30-3f36-4e8a-b078-69d36c4a79ff
status: test
description: |
    Detects the execution of Xwizard tool with the "RunWizard" flag and a GUID like argument.
    This utility can be abused in order to run custom COM object created in the registry.
author: Ensar Şamil, @sblmsrsn, @oscd_initiative, Nasreddine Bencherchali (Nextron
    Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/07 14:59:11
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
  - https://www.elastic.co/guide/en/security/current/execution-of-com-object-via-xwizard.html
  - https://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* or (selection_cli and not selection_img)
    selection_cli:
        CommandLine: RunWizard
        CommandLine|re: \{[a-fA-F0-9]{8}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{12}\}
    selection_img:
      - Image|endswith: \xwizard.exe
      - OriginalFileName: xwizard.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2024/04/22
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
