
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Tasks Folder Evasion
id: cc4e02ba-9c06-48e2-b09e-2500cace9ae0
status: test
description: |
    The Tasks folder in system32 and syswow64 are globally writable paths.
    Adversaries can take advantage of this and load or influence any script hosts or ANY .NET Application
    in Tasks to load and execute a custom assembly into cscript, wscript, regsvr32, mshta, eventvwr
author: Sreeman
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/01/13 11:18:31
references:
  - https://twitter.com/subTee/status/1216465628946563073
  - https://gist.github.com/am0nsec/8378da08f848424e4ab0cc5b317fdd26
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection1:
        CommandLine|contains:
          - 'echo '
          - 'copy '
          - 'type '
          - file createnew
    selection2:
        CommandLine|contains:
          - ' C:\Windows\System32\Tasks\'
          - ' C:\Windows\SysWow64\Tasks\'
fields:
  - CommandLine
  - ParentProcess
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/12/25
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.execution
  - attack.t1574.002
  - DEMO
