
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: MSHTA Suspicious Execution 01
id: cc7abbd0-762b-41e3-8a26-57ad50d2eea3
status: test
description: Detection for mshta.exe suspicious execution patterns sometimes involving
    file polyglotism
author: Diego Perez (@darkquassar), Markus Neis, Swisscom (Improve Rule)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/02/22 13:13:31
references:
  - http://blog.sevagas.com/?Hacking-around-HTA-files
  - https://0x00sec.org/t/clientside-exploitation-in-2018-how-pentesting-has-changed/7356
  - https://docs.microsoft.com/en-us/dotnet/standard/data/xml/xslt-stylesheet-scripting-using-msxsl-script
  - https://medium.com/tsscyber/pentesting-and-hta-bypassing-powershell-constrained-language-mode-53a42856c997
  - https://twitter.com/mattifestation/status/1326228491302563846
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - vbscript
          - .jpg
          - .png
          - .lnk
          - .xls
          - .doc
          - .zip
          - .dll
        Image|endswith: \mshta.exe
falsepositives: False positives depend on scripts and administrative tools used in
    the monitored environment
level: high
customer: 'demo'
modified: 2022/11/07
tags:
  - attack.defense_evasion
  - attack.t1140
  - attack.t1218.005
  - attack.execution
  - attack.t1059.007
  - cve.2020.1599
  - DEMO
