
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Rar Usage with Password and Compression Level
id: faa48cae-6b25-4f00-a094-08947fef582f
status: test
description: Detects the use of rar.exe, on the command line, to create an archive
    with password protection or with a specific compression level. This is pretty
    indicative of malicious actions.
author: '@ROxPinTeddy'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/05/12 17:50:21
references:
  - https://labs.sentinelone.com/the-anatomy-of-an-apt-attack-and-cobaltstrike-beacons-encoded-configuration/
  - https://ss64.com/bash/rar.html
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_password and selection_other
    selection_other:
        CommandLine|contains:
          - ' -m'
          - ' a '
    selection_password:
        CommandLine|contains: ' -hp'
falsepositives:
  - Legitimate use of Winrar command line version
  - Other command line tools, that use these flags
level: high
customer: 'demo'
modified: 2022/03/16
tags:
  - attack.collection
  - attack.t1560.001
  - DEMO
