
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Wusa Extracting Cab Files
id: 59b39960-5f9d-4a49-9cef-1e4d2c1d0cb9
status: test
description: Detects usage of the "wusa.exe" (Windows Update Standalone Installer)
    utility to extract cab using the "/extract" argument which is not longer supported.
    This could indicate an attacker using an old technique
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/04 12:27:01
references:
  - https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains: '/extract:'
        Image|endswith: \wusa.exe
falsepositives: The "extract" flag still works on older 'wusa.exe' versions, which
    could be a legitimate use (monitor the path of the cab being extracted)
level: medium
customer: 'demo'
tags:
  - attack.execution
  - DEMO
