
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - Inveigh Execution
id: b99a1518-1ad5-4f65-bc95-1ffff97a8fd0
status: test
description: Detects the use of Inveigh a cross-platform .NET IPv4/IPv6 machine-in-the-middle
    tool
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/24 13:12:01
references:
  - https://github.com/Kevin-Robertson/Inveigh
  - https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - Image|endswith: \Inveigh.exe
      - OriginalFileName:
          - \Inveigh.exe
          - \Inveigh.dll
      - Description: Inveigh
      - CommandLine|contains:
          - ' -SpooferIP'
          - ' -ReplyToIPs '
          - ' -ReplyToDomains '
          - ' -ReplyToMACs '
          - ' -SnifferIP'
falsepositives: Very unlikely
level: critical
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.credential_access
  - attack.t1003.001
  - DEMO
