
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Sysinternals PsSuspend Execution
id: 48bbc537-b652-4b4e-bd1d-281172df448f
related:
  - type: similar
    id: 4beb6ae0-f85b-41e2-8f18-8668abc8af78
status: test
description: Detects usage of Sysinternals PsSuspend which can be abused to suspend
    critical processes
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/03/23 15:00:01
references:
  - https://learn.microsoft.com/en-us/sysinternals/downloads/pssuspend
  - https://twitter.com/0gtweet/status/1638069413717975046
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - OriginalFileName: pssuspend.exe
      - Image|endswith:
          - \pssuspend.exe
          - \pssuspend64.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.discovery
  - attack.persistence
  - attack.t1543.003
  - DEMO
