
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Indirect Command Execution From Script File Via Bash.EXE
id: 2d22a514-e024-4428-9dba-41505bd63a5b
related:
  - type: similar
    id: 5edc2273-c26f-406c-83f3-f4d948e740dd
status: experimental
description: |
    Detects execution of Microsoft bash launcher without any flags to execute the content of a bash script directly.
    This can be used to potentially bypass defenses and execute Linux or Windows-based binaries directly via bash.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/15 20:02:01
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Bash/
  - https://linux.die.net/man/1/bash
  - Internal Research
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_cli_flag:
        CommandLine|contains:
          - bash.exe -
          - bash -
    filter_main_empty:
        CommandLine: ""
    filter_main_no_cli:
        CommandLine: []
    filter_main_no_flag:
        CommandLine:
          - bash.exe
          - bash
    selection:
      - Image|endswith:
          - :\Windows\System32\bash.exe
          - :\Windows\SysWOW64\bash.exe
      - OriginalFileName: Bash.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1202
  - DEMO
