
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Schtasks Schedule Type With High Privileges
id: 7a02e22e-b885-4404-b38b-1ddc7e65258a
related:
  - type: similar
    id: 24c8392b-aa3c-46b7-a545-43f71657fe98
status: test
description: Detects scheduled task creations or modification to be run with high
    privileges on a suspicious schedule type
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/31 20:24:01
references:
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-change
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_img:
      - Image|endswith: \schtasks.exe
      - OriginalFileName: schtasks.exe
    selection_privs:
        CommandLine|contains:
          - NT AUT
          - ' SYSTEM'
          - HIGHEST
    selection_time:
        CommandLine|contains:
          - ' ONLOGON '
          - ' ONSTART '
          - ' ONCE '
          - ' ONIDLE '
falsepositives: Some installers were seen using this method of creation unfortunately.
    Filter them in your environment
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.t1053.005
  - DEMO
