
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Procdump Execution
id: 2e65275c-8288-4ab4-aeb7-6274f58b6b20
status: test
description: Detects usage of the SysInternals Procdump utility
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/16 11:03:41
references:
  - https://learn.microsoft.com/en-us/sysinternals/downloads/procdump
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - \procdump.exe
          - \procdump64.exe
falsepositives: Legitimate use of procdump by a developer or administrator
level: medium
customer: 'demo'
modified: 2023/02/28
tags:
  - attack.defense_evasion
  - attack.t1036
  - attack.t1003.001
  - DEMO
