
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: New Process Created Via Taskmgr.EXE
id: 3d7679bd-0c00-440c-97b0-3f204273e6c7
status: test
description: Detects the creation of a process via the Windows task manager. This
    might be an attempt to bypass UAC
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/03/13 14:44:21
references:
  - https://twitter.com/ReneFreingruber/status/1172244989335810049
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_generic:
        Image|endswith:
          - :\Windows\System32\mmc.exe
          - :\Windows\System32\resmon.exe
          - :\Windows\System32\Taskmgr.exe
    selection:
        ParentImage|endswith: \taskmgr.exe
falsepositives: Administrative activity
level: low
customer: 'demo'
modified: 2024/01/18
tags:
  - attack.defense_evasion
  - attack.t1036
  - DEMO
