
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Greedy Compression Using Rar.EXE
id: afe52666-401e-4a02-b4ff-5d128990b8cb
status: experimental
description: Detects RAR usage that creates an archive from a suspicious folder, either
    a system folder or one of the folders often used by attackers for staging purposes
author: X__Junior (Nextron Systems), Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/15 17:18:01
references:
  - https://decoded.avast.io/martinchlumecky/png-steganography
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_opt_* and all of selection_cli_*
    selection_cli_flags:
        CommandLine|contains|all:
          - ' -hp'
          - ' -r '
    selection_cli_folders:
        CommandLine|contains:
          - ' ?:\\\*.'
          - ' ?:\\\\\*.'
          - ' ?:\$Recycle.bin\'
          - ' ?:\PerfLogs\'
          - ' ?:\Temp'
          - ' ?:\Users\Public\'
          - ' ?:\Windows\'
          - ' %public%'
    selection_opt_1:
      - Image|endswith: \rar.exe
      - Description: Command line RAR
    selection_opt_2:
        CommandLine|contains:
          - '.exe a '
          - ' a -m'
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2024/01/02
tags:
  - attack.execution
  - attack.t1059
  - DEMO
