
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DumpStack.log Defender Evasion
id: 4f647cfa-b598-4e12-ad69-c68dd16caef8
status: test
description: Detects the use of the filename DumpStack.log to evade Microsoft Defender
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/06 13:57:01
references:
  - https://twitter.com/mrd0x/status/1479094189048713219
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection*
    selection:
        Image|endswith: \DumpStack.log
    selection_download:
        CommandLine|contains: ' -o DumpStack.log'
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2022/06/17
tags:
  - attack.defense_evasion
  - DEMO
