
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Renamed PingCastle Binary Execution
id: 2433a154-bb3d-42e4-86c3-a26bdac91c45
status: experimental
description: Detects the execution of a renamed "PingCastle" binary based on the PE
    metadata fields.
author: Nasreddine Bencherchali (Nextron Systems), X__Junior (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/01/11 15:19:51
references:
  - https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
  - https://www.pingcastle.com/documentation/scanner/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_img:
        Image|endswith:
          - \PingCastleReporting.exe
          - \PingCastleCloud.exe
          - \PingCastle.exe
    selection:
      - OriginalFileName:
          - PingCastleReporting.exe
          - PingCastleCloud.exe
          - PingCastle.exe
      - CommandLine|contains:
          - --scanner aclcheck
          - --scanner antivirus
          - --scanner computerversion
          - --scanner foreignusers
          - --scanner laps_bitlocker
          - --scanner localadmin
          - --scanner nullsession
          - --scanner nullsession-trust
          - --scanner oxidbindings
          - --scanner remote
          - --scanner share
          - --scanner smb
          - --scanner smb3querynetwork
          - --scanner spooler
          - --scanner startup
          - --scanner zerologon
      - CommandLine|contains: --no-enum-limit
      - CommandLine|contains|all:
          - --healthcheck
          - --level Full
      - CommandLine|contains|all:
          - --healthcheck
          - '--server '
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.execution
  - attack.t1059
  - attack.defense_evasion
  - attack.t1202
  - DEMO
