
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Delete Important Scheduled Task
id: dbc1f800-0fe0-4bc0-9c66-292c2abe3f78
related:
  - type: similar
    id: 9e3cb244-bdb8-4632-8c90-6079c8f4f16d
  - type: similar
    id: 7595ba94-cf3b-4471-aa03-4f6baa9e5fad
status: test
description: Detects when adversaries stop services or processes by deleting their
    respective scheduled tasks in order to conduct data destructive activities
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/09 14:14:11
references:
  - Internal Research
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of schtasks_*
    schtasks_exe:
        CommandLine|contains:
          - \Windows\SystemRestore\SR
          - \Windows\Windows Defender\
          - \Windows\BitLocker
          - \Windows\WindowsBackup\
          - \Windows\WindowsUpdate\
          - \Windows\UpdateOrchestrator\
          - \Windows\ExploitGuard
        CommandLine|contains|all:
          - /delete
          - /tn
        Image|endswith: \schtasks.exe
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.impact
  - attack.t1489
  - DEMO
