
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Allow Service Access Using Security Descriptor Tampering Via Sc.EXE
id: 6c8fbee5-dee8-49bc-851d-c3142d02aa47
related:
  - type: similar
    id: a537cfc3-4297-4789-92b5-345bfd845ad0
status: test
description: Detects suspicious DACL modifications to allow access to a service from
    a suspicious trustee. This can be used to override access restrictions set by
    previous ACLs.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/02/28 23:11:21
references:
  - https://twitter.com/0gtweet/status/1628720819537936386
  - https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
  - https://learn.microsoft.com/en-us/windows/win32/secauthz/sid-strings
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_sc:
      - Image|endswith: \sc.exe
      - OriginalFileName: sc.exe
    selection_sdset:
        CommandLine|contains|all:
          - sdset
          - A;
    selection_trustee:
        CommandLine|contains:
          - ;IU
          - ;SU
          - ;BA
          - ;SY
          - ;WD
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.persistence
  - attack.t1543.003
  - DEMO
