
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - GMER Rootkit Detector and Remover Execution
id: 9082ff1f-88ab-4678-a3cc-5bcff99fc74d
status: test
description: Detects the execution GMER tool based on image and hash fields.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/05 19:40:21
references:
  - http://www.gmer.net/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_img:
        Image|endswith: \gmer.exe
    selection_other:
      - md5: e9dc058440d321aa17d0600b3ca0ab04
      - sha1: 539c228b6b332f5aa523e5ce358c16647d8bbe57
      - sha256: e8a3e804a96c716a3e9b69195db6ffb0d33e2433af871e4d4e1eab3097237173
    selection_sysmon_hash:
        Hashes|contains:
          - MD5=E9DC058440D321AA17D0600B3CA0AB04
          - SHA1=539C228B6B332F5AA523E5CE358C16647D8BBE57
          - SHA256=E8A3E804A96C716A3E9B69195DB6FFB0D33E2433AF871E4D4E1EAB3097237173
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/02/13
tags:
  - attack.defense_evasion
  - DEMO
