
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: UNC2452 PowerShell Pattern
id: b7155193-8a81-4d8f-805d-88de864ca50c
status: test
description: Detects a specific PowerShell command line pattern used by the UNC2452
    actors as mentioned in Microsoft and Symantec reports
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/01/20 12:17:01
references:
  - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/solarwinds-raindrop-malware
  - https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1047/T1047.md#atomic-test-7---create-a-process-using-wmi-query-and-an-encoded-command
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_cli_1:
        CommandLine|contains|all:
          - Invoke-WMIMethod win32_process -name create -argumentlist
          - rundll32 c:\windows
    selection_cli_2:
        CommandLine|contains|all:
          - 'wmic /node:'
          - process call create "rundll32 c:\windows
falsepositives: Unlikely
level: critical
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.execution
  - attack.t1059.001
  - attack.t1047
  - detection.emerging_threats
  - DEMO
