
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Scheduled Task Name As GUID
id: ff2fff64-4cd6-4a2b-ba7d-e28a30bbe66b
status: test
description: Detects creation of a scheduled task with a GUID like name
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/31 15:29:31
references:
  - https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/
  - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_end:
        CommandLine|contains:
          - '}"'
          - '}'''
          - '} '
    selection_img:
        CommandLine|contains: '/Create '
        Image|endswith: \schtasks.exe
    selection_tn:
        CommandLine|contains:
          - /TN "{
          - /TN '{
          - /TN {
falsepositives: Legitimate software naming their tasks as GUIDs
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.t1053.005
  - DEMO
