
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - UACMe Akagi Execution
id: d38d2fa4-98e6-4a24-aff1-410b0c9ad177
status: test
description: Detects the execution of UACMe, a tool used for UAC bypasses, via default
    PE metadata
author: Christian Burkard (Nextron Systems), Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/30 13:43:41
references:
  - https://github.com/hfiref0x/UACME
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_hashes_other:
        Imphash:
          - 767637c23bb42cd5d7397cf58b0be688
          - 14c4e4c72ba075e9069ee67f39188ad8
          - 3c782813d4afce07bbfc5a9772acdbdc
          - 7d010c6bb6a3726f327f7e239166d127
          - 89159ba4dd04e4ce5559f132a9964eb3
          - 6f33f4a5fc42b8cec7314947bd13f30f
          - 5834ed4291bdeb928270428ebbaf7604
          - 5a8a8a43f25485e7ee1b201edcbc7a38
          - dc7d30b90b2d8abf664fbed2b1b59894
          - 41923ea1f824fe63ea5beb84db7a3e74
          - 3de09703c8e79ed2ca3f01074719906b
    selection_hashes_sysmon:
        Hashes|contains:
          - IMPHASH=767637C23BB42CD5D7397CF58B0BE688
          - IMPHASH=14C4E4C72BA075E9069EE67F39188AD8
          - IMPHASH=3C782813D4AFCE07BBFC5A9772ACDBDC
          - IMPHASH=7D010C6BB6A3726F327F7E239166D127
          - IMPHASH=89159BA4DD04E4CE5559F132A9964EB3
          - IMPHASH=6F33F4A5FC42B8CEC7314947BD13F30F
          - IMPHASH=5834ED4291BDEB928270428EBBAF7604
          - IMPHASH=5A8A8A43F25485E7EE1B201EDCBC7A38
          - IMPHASH=DC7D30B90B2D8ABF664FBED2B1B59894
          - IMPHASH=41923EA1F824FE63EA5BEB84DB7A3E74
          - IMPHASH=3DE09703C8E79ED2CA3F01074719906B
    selection_img:
        Image|endswith:
          - \Akagi64.exe
          - \Akagi.exe
    selection_pe:
      - Product: UACMe
      - Company:
          - REvol Corp
          - APT 92
          - UG North
          - Hazardous Environments
          - CD Project Rekt
      - Description:
          - UACMe main module
          - Pentesting utility
      - OriginalFileName:
          - Akagi.exe
          - Akagi64.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/11/19
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1548.002
  - DEMO
