
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious DLL Loaded via CertOC.EXE
id: 84232095-ecca-4015-b0d7-7726507ee793
related:
  - type: similar
    id: 242301bc-f92f-4476-8718-78004a6efd9f
status: test
description: Detects when a user installs certificates by using CertOC.exe to load
    the target DLL file.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/02/15 14:44:41
references:
  - https://twitter.com/sblmsrsn/status/1445758411803480072?s=20
  - https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-fe98e74189873d6df72a15df2eaa0315c59ba9cdaca93ecd68afc4ea09194ef2
  - https://lolbas-project.github.io/lolbas/Binaries/Certoc/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains|windash: ' -LoadDLL '
    selection_img:
      - Image|endswith: \certoc.exe
      - OriginalFileName: CertOC.exe
    selection_paths:
        CommandLine|contains:
          - \Appdata\Local\Temp\
          - \Desktop\
          - \Downloads\
          - \Users\Public\
          - C:\Windows\Tasks\
          - C:\Windows\Temp\
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2024/03/05
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
