
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Direct Autorun Keys Modification
id: 24357373-078f-44ed-9ac4-6d334a668a11
status: test
description: Detects direct modification of autostart extensibility point (ASEP) in
    registry using reg.exe.
author: Victor Sergeev, Daniil Yugoslavskiy, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/25 14:36:31
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_1:
        CommandLine|contains: add
        Image|endswith: \reg.exe
    selection_2:
        CommandLine|contains:
          - \software\Microsoft\Windows\CurrentVersion\Run
          - \software\Microsoft\Windows NT\CurrentVersion\Winlogon\Userinit
          - \software\Microsoft\Windows NT\CurrentVersion\Winlogon\Shell
          - \software\Microsoft\Windows NT\CurrentVersion\Windows
          - \software\Microsoft\Windows\CurrentVersion\Explorer\User Shell Folders
          - \system\CurrentControlSet\Control\SafeBoot\AlternateShell
fields:
  - CommandLine
  - ParentCommandLine
falsepositives:
  - Legitimate software automatically (mostly, during installation) sets up autorun
    keys for legitimate reasons.
  - Legitimate administrator sets up autorun keys for legitimate reasons.
  - Discord
level: medium
customer: 'demo'
modified: 2022/08/04
tags:
  - attack.persistence
  - attack.t1547.001
  - DEMO
