
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Visual Studio Code Tunnel Shell Execution
id: f4a623c2-4ef5-4c33-b811-0642f702c9f1
status: experimental
description: Detects the execution of a shell (powershell, bash, wsl...) via Visual
    Studio Code tunnel. Attackers can abuse this functionality to establish a C2 channel
    and execute arbitrary commands on the system.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/25 16:46:51
references:
  - https://ipfyx.fr/post/visual-studio-code-tunnel/
  - https://badoption.eu/blog/2023/01/31/code_c2.html
  - https://code.visualstudio.com/docs/remote/tunnels
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_parent and 1 of selection_child_*
    selection_child_1:
        CommandLine|contains: \terminal\browser\media\shellIntegration.ps1
        Image|endswith:
          - \powershell.exe
          - \pwsh.exe
    selection_child_2:
        Image|endswith:
          - \wsl.exe
          - \bash.exe
    selection_parent:
        ParentCommandLine|contains: .vscode-server
        ParentImage|contains: \servers\Stable-
        ParentImage|endswith: \server\node.exe
falsepositives: Legitimate use of Visual Studio Code tunnel and running code from
    there
level: medium
customer: 'demo'
tags:
  - attack.command_and_control
  - attack.t1071.001
  - DEMO
