
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Obfuscated PowerShell Code
id: 8d01b53f-456f-48ee-90f6-bc28e67d4e35
status: test
description: Detects suspicious UTF16 and base64 encoded and often obfuscated PowerShell
    code often used in command lines
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/11 16:01:11
references:
  - https://app.any.run/tasks/fcadca91-3580-4ede-aff4-4d2bf809bf99/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - IAAtAGIAeABvAHIAIAAwAHgA
          - AALQBiAHgAbwByACAAMAB4A
          - gAC0AYgB4AG8AcgAgADAAeA
          - AC4ASQBuAHYAbwBrAGUAKAApACAAfAAg
          - AuAEkAbgB2AG8AawBlACgAKQAgAHwAI
          - ALgBJAG4AdgBvAGsAZQAoACkAIAB8AC
          - AHsAMQB9AHsAMAB9ACIAIAAtAGYAI
          - B7ADEAfQB7ADAAfQAiACAALQBmAC
          - AewAxAH0AewAwAH0AIgAgAC0AZgAg
          - AHsAMAB9AHsAMwB9ACIAIAAtAGYAI
          - B7ADAAfQB7ADMAfQAiACAALQBmAC
          - AewAwAH0AewAzAH0AIgAgAC0AZgAg
          - AHsAMgB9AHsAMAB9ACIAIAAtAGYAI
          - B7ADIAfQB7ADAAfQAiACAALQBmAC
          - AewAyAH0AewAwAH0AIgAgAC0AZgAg
          - AHsAMQB9AHsAMAB9ACcAIAAtAGYAI
          - B7ADEAfQB7ADAAfQAnACAALQBmAC
          - AewAxAH0AewAwAH0AJwAgAC0AZgAg
          - AHsAMAB9AHsAMwB9ACcAIAAtAGYAI
          - B7ADAAfQB7ADMAfQAnACAALQBmAC
          - AewAwAH0AewAzAH0AJwAgAC0AZgAg
          - AHsAMgB9AHsAMAB9ACcAIAAtAGYAI
          - B7ADIAfQB7ADAAfQAnACAALQBmAC
          - AewAyAH0AewAwAH0AJwAgAC0AZgAg
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/14
tags:
  - attack.defense_evasion
  - DEMO
