
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PUA - DIT Snapshot Viewer
id: d3b70aad-097e-409c-9df2-450f80dc476b
status: test
description: Detects the use of Ditsnap tool, an inspection tool for Active Directory
    database, ntds.dit.
author: Furkan Caliskan (@caliskanfurkan_)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/07/04 11:50:21
references:
  - https://thedfirreport.com/2020/06/21/snatch-ransomware/
  - https://web.archive.org/web/20201124182207/https://github.com/yosqueoy/ditsnap
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
      - Image|endswith: \ditsnap.exe
      - CommandLine|contains: ditsnap.exe
falsepositives: Legitimate admin usage
level: high
customer: 'demo'
modified: 2023/02/21
tags:
  - attack.credential_access
  - attack.t1003.003
  - DEMO
