
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential PowerShell Execution Policy Tampering - ProcCreation
id: cf2e938e-9a3e-4fe8-a347-411642b28a9f
related:
  - type: similar
    id: fad91067-08c5-4d1a-8d8c-d96a21b37814
  - type: similar
    id: 87e3c4e8-a6a8-4ad9-bb4f-46e7ff99a180
  - type: similar
    id: 61d0475c-173f-4844-86f7-f3eebae1c66b
status: test
description: Detects changes to the PowerShell execution policy registry key in order
    to bypass signing requirements for script execution from the CommandLine
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/11 22:30:21
references:
  - https://learn.microsoft.com/de-de/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.3
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_path:
        CommandLine|contains:
          - \ShellIds\Microsoft.PowerShell\ExecutionPolicy
          - \Policies\Microsoft\Windows\PowerShell\ExecutionPolicy
    selection_values:
        CommandLine|contains:
          - Bypass
          - RemoteSigned
          - Unrestricted
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - DEMO
