
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Response File Execution Via Odbcconf.EXE
id: 2d32dd6f-3196-4093-b9eb-1ad8ab088ca5
related:
  - type: derived
    id: 5f03babb-12db-4eec-8c82-7b4cb5580868
  - type: obsoletes
    id: 65d2be45-8600-4042-b4c0-577a1ff8a60e
status: experimental
description: Detects execution of "odbcconf" with the "-f" flag in order to load a
    response file with a non-".rsp" extension.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/22 19:16:01
references:
  - https://learn.microsoft.com/en-us/sql/odbc/odbcconf-exe?view=sql-server-ver16
  - https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/
  - https://www.trendmicro.com/en_us/research/17/h/backdoor-carrying-emails-set-sights-on-russian-speaking-businesses.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_* and not 1 of filter_main_*
    filter_main_rsp_ext:
        CommandLine|contains: .rsp
    filter_main_runonce_odbc:
        CommandLine|contains: .exe /E /F "C:\WINDOWS\system32\odbcconf.tmp"
        Image: C:\Windows\System32\odbcconf.exe
        ParentImage: C:\Windows\System32\runonce.exe
    selection_cli:
        CommandLine|contains|windash: ' -f '
    selection_img:
      - Image|endswith: \odbcconf.exe
      - OriginalFileName: odbcconf.exe
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2024/03/13
tags:
  - attack.defense_evasion
  - attack.t1218.008
  - DEMO
