
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Firewall Configuration Discovery Via Netsh.EXE
id: 0e4164da-94bc-450d-a7be-a4b176179f1f
status: experimental
description: Adversaries may look for details about the network configuration and
    settings of systems they access or through information discovery of remote systems
author: frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/07 18:04:01
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md#atomic-test-2---list-windows-firewall-rules
  - https://ss64.com/nt/netsh.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains:
          - 'config '
          - 'state '
          - 'rule '
          - name=all
        CommandLine|contains|all:
          - 'netsh '
          - 'show '
          - 'firewall '
    selection_img:
      - Image|endswith: \netsh.exe
      - OriginalFileName: netsh.exe
falsepositives: Administrative activity
level: low
customer: 'demo'
modified: 2023/12/11
tags:
  - attack.discovery
  - attack.t1016
  - DEMO
