
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PUA - 3Proxy Execution
id: f38a82d2-fba3-4781-b549-525efbec8506
status: test
description: Detects the use of 3proxy, a tiny free proxy server
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/13 11:19:21
references:
  - https://github.com/3proxy/3proxy
  - https://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_img:
        Image|endswith: \3proxy.exe
    selection_params:
        CommandLine|contains: .exe -i127.0.0.1 -p
    selection_pe:
        Description: 3proxy - tiny proxy server
falsepositives: Administrative activity
level: high
customer: 'demo'
modified: 2023/02/21
tags:
  - attack.command_and_control
  - attack.t1572
  - DEMO
