
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Data Stealing Via Chromium Headless Debugging
id: 3e8207c5-fcd2-4ea6-9418-15d45b4890e4
related:
  - type: derived
    id: b3d34dc5-2efd-4ae3-845f-8ec14921f449
status: test
description: Detects chromium based browsers starting in headless and debugging mode
    and pointing to a user profile. This could be a sign of data stealing or remote
    control
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/23 20:23:01
references:
  - https://github.com/defaultnamehere/cookie_crimes/
  - https://mango.pdf.zone/stealing-chrome-cookies-without-a-password
  - https://embracethered.com/blog/posts/2020/cookie-crimes-on-mirosoft-edge/
  - https://embracethered.com/blog/posts/2020/chrome-spy-remote-control/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - --remote-debugging-
          - --user-data-dir
          - --headless
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1185
  - DEMO
