
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Sigverif Execution
id: 7d4aaec2-08ed-4430-8b96-28420e030e04
status: test
description: Detects the execution of sigverif binary as a parent process which could
    indicate it being used as a LOLBIN to proxy execution
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/19 14:07:01
references:
  - https://www.hexacorn.com/blog/2018/04/27/i-shot-the-sigverif-exe-the-gui-based-lolbin/
  - https://twitter.com/0gtweet/status/1457676633809330184
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        ParentImage|endswith: \sigverif.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1216
  - DEMO
