
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: LSASS Process Reconnaissance Via Findstr.EXE
id: fe63010f-8823-4864-a96b-a7b4a0f7b929
status: experimental
description: Detects findstring commands that include the keyword lsass, which indicates
    recon actviity for the LSASS process PID
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/12 17:05:51
references:
  - https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_findstr_* or selection_special
    selection_findstr_cli:
        CommandLine|contains: lsass
    selection_findstr_img:
      - Image|endswith:
          - \find.exe
          - \findstr.exe
      - OriginalFileName:
          - FIND.EXE
          - FINDSTR.EXE
    selection_special:
        CommandLine|contains:
          - ' /i "lsass'
          - ' /i lsass.exe'
          - findstr "lsass
          - findstr lsass
          - findstr.exe "lsass
          - findstr.exe lsass
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/11/11
tags:
  - attack.credential_access
  - attack.t1552.006
  - DEMO
