
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PUA - Wsudo Suspicious Execution
id: bdeeabc9-ff2a-4a51-be59-bb253aac7891
status: test
description: Detects usage of wsudo (Windows Sudo Utility). Which is a tool that let
    the user execute programs with different permissions (System, Trusted Installer,
    Administrator...etc)
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/02 14:13:21
references:
  - https://github.com/M2Team/Privexec/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_cli:
        CommandLine|contains:
          - -u System
          - -uSystem
          - -u TrustedInstaller
          - -uTrustedInstaller
          - ' --ti '
    selection_metadata:
      - Image|endswith: \wsudo.exe
      - OriginalFileName: wsudo.exe
      - Description: Windows sudo utility
      - ParentImage|endswith: \wsudo-bridge.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/14
tags:
  - attack.execution
  - attack.privilege_escalation
  - attack.t1059
  - DEMO
