
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious DumpMinitool Execution
id: eb1c4225-1c23-4241-8dd4-051389fde4ce
status: test
description: Detects suspicious ways to use the "DumpMinitool.exe" binary
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/06 15:16:41
references:
  - https://twitter.com/mrd0x/status/1511415432888131586
  - https://twitter.com/mrd0x/status/1511489821247684615
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/DumpMinitool/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and ( ( not filter_folder ) or susp_flags or ( cmd_has_flags
        and not filter_cmd_misses_flags ) )
    cmd_has_flags:
        CommandLine|contains:
          - ' Full'
          - ' Mini'
          - ' WithHeap'
    filter_cmd_misses_flags:
        CommandLine|contains: --dumpType
    filter_folder:
        Image|contains:
          - \Microsoft Visual Studio\
          - \Extensions\
    selection:
      - Image|endswith:
          - \DumpMinitool.exe
          - \DumpMinitool.x86.exe
          - \DumpMinitool.arm64.exe
      - OriginalFileName:
          - DumpMinitool.exe
          - DumpMinitool.x86.exe
          - DumpMinitool.arm64.exe
    susp_flags:
        CommandLine|contains: .txt
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/04/12
tags:
  - attack.defense_evasion
  - attack.t1036
  - attack.t1003.001
  - DEMO
