
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Scan Loop Network
id: f8ad2e2c-40b6-4117-84d7-20b89896ab23
status: test
description: Adversaries may attempt to get a listing of other systems by IP address,
    hostname, or other logical identifier on a network that may be used for Lateral
    Movement from the current system
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/12 13:33:21
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md
  - https://ss64.com/nt/for.html
  - https://ss64.com/ps/foreach-object.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_loop:
        CommandLine|contains:
          - 'for '
          - 'foreach '
    selection_tools:
        CommandLine|contains:
          - nslookup
          - ping
falsepositives: Legitimate script
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.t1059
  - attack.discovery
  - attack.t1018
  - DEMO
