
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-06-21 19:00
# Generated for User: demo
# Number of Rules: 3228
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Arbitrary Command Execution Via FTP.EXE
id: 06b401f4-107c-4ff9-947f-9ec1e7649f1e
status: test
description: Detects execution of "ftp.exe" script with the "-s" or "/s" flag and
    any child processes ran by "ftp.exe".
author: Victor Sergeev, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/09 18:28:51
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Ftp/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_parent or all of selection_child_*
    selection_child_cli:
        CommandLine|contains|windash: '-s:'
    selection_child_img:
      - Image|endswith: \ftp.exe
      - OriginalFileName: ftp.exe
    selection_parent:
        ParentImage|endswith: \ftp.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2024/04/23
tags:
  - attack.execution
  - attack.t1059
  - attack.defense_evasion
  - attack.t1202
  - DEMO
