
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Forfiles.EXE Child Process Masquerading
id: f53714ec-5077-420e-ad20-907ff9bb2958
status: experimental
description: |
    Detects the execution of "forfiles" from a non-default location, in order to potentially spawn a custom "cmd.exe" from the current working directory.
author: Nasreddine Bencherchali (Nextron Systems), Anish Bogati
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/01/05 16:10:21
references:
  - https://www.hexacorn.com/blog/2023/12/31/1-little-known-secret-of-forfiles-exe/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_parent_not_sys:
        Image|contains:
          - :\Windows\System32\
          - :\Windows\SysWOW64\
        Image|endswith: \cmd.exe
        ParentImage|contains:
          - :\Windows\System32\
          - :\Windows\SysWOW64\
        ParentImage|endswith: \forfiles.exe
    selection:
        CommandLine|startswith: /c echo "
        Image|endswith: \cmd.exe
        ParentCommandLine|endswith:
          - .exe
          - .exe"
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1036
  - DEMO
