
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Microsoft IIS Connection Strings Decryption
id: 97dbf6e2-e436-44d8-abee-4261b24d3e41
status: test
description: Detects use of aspnet_regiis to decrypt Microsoft IIS connection strings.
    An attacker with Microsoft IIS web server access via a webshell or alike can decrypt
    and dump any hardcoded connection strings, such as the MSSQL service account password
    using aspnet_regiis command.
author: Tim Rauch, Elastic (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/28 17:31:41
references:
  - https://www.elastic.co/guide/en/security/current/microsoft-iis-connection-strings-decryption.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_args:
        CommandLine|contains|all:
          - connectionStrings
          - ' -pdf'
    selection_name:
      - Image|endswith: \aspnet_regiis.exe
      - OriginalFileName: aspnet_regiis.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/12/30
tags:
  - attack.credential_access
  - attack.t1003
  - DEMO
