
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Renamed FTP.EXE Execution
id: 277a4393-446c-449a-b0ed-7fdc7795244c
status: test
description: Detects the execution of a renamed "ftp.exe" binary based on the PE metadata
    fields
author: Victor Sergeev, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/09 12:09:41
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Ftp/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_original and not filter_img
    filter_img:
        Image|endswith: \ftp.exe
    selection_original:
        OriginalFileName: ftp.exe
fields:
  - CommandLine
  - ParentImage
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/02/03
tags:
  - attack.execution
  - attack.t1059
  - attack.defense_evasion
  - attack.t1202
  - DEMO
