
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious WmiPrvSE Child Process
id: 8a582fe2-0882-4b89-a82a-da6b2dc32937
related:
  - type: similar
    id: 692f0bec-83ba-4d04-af7e-e884a96059b6
  - type: similar
    id: d21374ff-f574-44a7-9998-4a8c8bf33d7d
  - type: obsoletes
    id: 18cf6cf0-39b0-4c22-9593-e244bdc9a2d4
status: test
description: Detects suspicious and uncommon child processes of WmiPrvSE
author: Vadim Khrykov (ThreatIntel), Cyb3rEng, Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/23 14:46:31
references:
  - https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
  - https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
  - https://blog.osarmor.com/319/onenote-attachment-delivers-asyncrat-malware/
  - https://twitter.com/ForensicITGuy/status/1334734244120309760
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_parent and 1 of selection_children_* and not 1 of filter_main_*
    filter_main_msiexec:
        CommandLine|contains: '/i '
        Image|endswith: \msiexec.exe
    filter_main_werfault:
        Image|endswith: \WerFault.exe
    filter_main_wmiprvse:
        Image|endswith: \WmiPrvSE.exe
    selection_children_1:
        Image|endswith:
          - \certutil.exe
          - \cscript.exe
          - \mshta.exe
          - \msiexec.exe
          - \regsvr32.exe
          - \rundll32.exe
          - \verclsid.exe
          - \wscript.exe
    selection_children_2:
        CommandLine|contains:
          - cscript
          - mshta
          - powershell
          - pwsh
          - regsvr32
          - rundll32
          - wscript
        Image|endswith: \cmd.exe
    selection_parent:
        ParentImage|endswith: \wbem\WmiPrvSE.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/11/10
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1047
  - attack.t1204.002
  - attack.t1218.010
  - DEMO
