
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Shells Spawn by Java Utility Keytool
id: 90fb5e62-ca1f-4e22-b42e-cc521874c938
status: test
description: Detects suspicious shell spawn from Java utility keytool process (e.g.
    adselfservice plus exploitation)
author: Andreas Hunkeler (@Karneades)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/22 18:32:31
references:
  - https://redcanary.com/blog/intelligence-insights-december-2021
  - https://www.synacktiv.com/en/publications/how-to-exploit-cve-2021-40539-on-manageengine-adselfservice-plus.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - \cmd.exe
          - \sh.exe
          - \bash.exe
          - \powershell.exe
          - \pwsh.exe
          - \schtasks.exe
          - \certutil.exe
          - \whoami.exe
          - \bitsadmin.exe
          - \wscript.exe
          - \cscript.exe
          - \scrcons.exe
          - \regsvr32.exe
          - \hh.exe
          - \wmic.exe
          - \mshta.exe
          - \rundll32.exe
          - \forfiles.exe
          - \scriptrunner.exe
          - \mftrace.exe
          - \AppVLP.exe
          - \systeminfo.exe
          - \reg.exe
          - \query.exe
        ParentImage|endswith: \keytool.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/21
tags:
  - attack.initial_access
  - attack.persistence
  - attack.privilege_escalation
  - DEMO
