
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Python Reverse Shell
id: 32e62bc7-3de0-4bb1-90af-532978fe42c0
related:
  - type: similar
    id: c4042d54-110d-45dd-a0e1-05c47822c937
status: test
description: Detects executing python with keywords related to network activity that
    could indicate a potential reverse shell
author: '@d4ns4n_, Nasreddine Bencherchali (Nextron Systems)'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/24 14:06:21
references:
  - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
  - https://www.revshells.com/
logsource:
    category: process_creation
    product: linux
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - ' -c '
          - import
          - pty
          - spawn(
          - .connect
        Image|contains: python
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.execution
  - DEMO
