
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Linux Package Uninstall
id: 95d61234-7f56-465c-6f2d-b562c6fedbc4
status: test
description: Detects linux package removal using builtin tools such as "yum", "apt",
    "apt-get" or "dpkg".
author: Tuan Le (NCSGroup), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/03/09 12:11:41
references:
  - https://sysdig.com/blog/mitre-defense-evasion-falco
  - https://www.tutorialspoint.com/how-to-install-a-software-on-linux-using-yum-command
  - https://linuxhint.com/uninstall_yum_package/
  - https://linuxhint.com/uninstall-debian-packages/
logsource:
    category: process_creation
    product: linux
detection:
    condition: 1 of selection_*
    selection_apt:
        CommandLine|contains:
          - remove
          - purge
        Image|endswith:
          - /apt
          - /apt-get
    selection_dpkg:
        CommandLine|contains:
          - '--remove '
          - ' -r '
        Image|endswith: /dpkg
    selection_rpm:
        CommandLine|contains: ' -e '
        Image|endswith: /rpm
    selection_yum:
        CommandLine|contains:
          - erase
          - remove
        Image|endswith: /yum
falsepositives: Administrator or administrator scripts might delete packages for several
    reasons (debugging, troubleshooting).
level: low
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1070
  - DEMO
