
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Setuid and Setgid
id: c21c4eaa-ba2e-419a-92b2-8371703cbe21
status: test
description: Detects suspicious change of file privileges with chown and chmod commands
author: Ömer Günal
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/06/16 10:26:51
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.001/T1548.001.md
  - https://attack.mitre.org/techniques/T1548/001/
logsource:
    category: process_creation
    product: linux
detection:
    condition: all of selection_*
    selection_perm:
        CommandLine|contains:
          - ' chmod u+s'
          - ' chmod g+s'
    selection_root:
        CommandLine|contains: chown root
falsepositives: Legitimate administration activities
level: low
customer: 'demo'
modified: 2022/10/05
tags:
  - attack.persistence
  - attack.t1548.001
  - DEMO
