
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Terminate Linux Process Via Kill
id: 64c41342-6b27-523b-5d3f-c265f3efcdb3
status: test
description: Detects usage of command line tools such as "kill", "pkill" or "killall"
    to terminate or signal a running process.
author: Tuan Le (NCSGroup)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/03/16 14:22:01
references:
  - https://www.trendmicro.com/en_us/research/23/c/iron-tiger-sysupdate-adds-linux-targeting.html
  - https://www.cyberciti.biz/faq/how-force-kill-process-linux/
logsource:
    category: process_creation
    product: linux
detection:
    condition: selection
    selection:
        Image|endswith:
          - /kill
          - /pkill
          - /killall
falsepositives: Likely
level: low
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1562
  - DEMO
