
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Nohup Execution
id: e4ffe466-6ff8-48d4-94bd-e32d1a6061e2
status: test
description: Detects usage of nohup which could be leveraged by an attacker to keep
    a process running or break out from restricted environments
author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/06 10:10:21
references:
  - https://gtfobins.github.io/gtfobins/nohup/
  - https://en.wikipedia.org/wiki/Nohup
  - https://www.computerhope.com/unix/unohup.htm
logsource:
    category: process_creation
    product: linux
detection:
    condition: selection
    selection:
        Image|endswith: /nohup
falsepositives: Administrators or installed processes that leverage nohup
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.t1059.004
  - DEMO
