
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: System Network Connections Discovery - Linux
id: 4c519226-f0cd-4471-bd2f-6fbb2bb68a79
status: test
description: Detects usage of system utilities to discover system network connections
author: Daniil Yugoslavskiy, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/19 17:45:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md
logsource:
    category: process_creation
    product: linux
detection:
    condition: selection and not 1 of filter_*
    filter_landscape_sysinfo:
        Image|endswith: /who
        ParentCommandLine|contains: /usr/bin/landscape-sysinfo
    selection:
        Image|endswith:
          - /who
          - /w
          - /last
          - /lsof
          - /netstat
falsepositives: Legitimate activities
level: low
customer: 'demo'
modified: 2023/01/17
tags:
  - attack.discovery
  - attack.t1049
  - DEMO
