
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Python Spawning Pretty TTY
id: c4042d54-110d-45dd-a0e1-05c47822c937
related:
  - type: similar
    id: 32e62bc7-3de0-4bb1-90af-532978fe42c0
status: experimental
description: Detects python spawning a pretty tty which could be indicative of potential
    reverse shell activity
author: Nextron Systems
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/03 12:53:41
references:
  - https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/
logsource:
    category: process_creation
    product: linux
detection:
    condition: selection_img and 1 of selection_cli_*
    selection_cli_1:
        CommandLine|contains|all:
          - import pty
          - .spawn(
    selection_cli_2:
        CommandLine|contains: from pty import spawn
    selection_img:
      - Image|endswith:
          - /python
          - /python2
          - /python3
      - Image|contains:
          - /python2.
          - /python3.
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/06/16
tags:
  - attack.execution
  - attack.t1059
  - DEMO
