
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Perl Reverse Shell Execution
id: 259df6bc-003f-4306-9f54-4ff1a08fa38e
status: test
description: Detects execution of the perl binary with the "-e" flag and common strings
    related to potential reverse shell activity
author: '@d4ns4n_, Nasreddine Bencherchali (Nextron Systems)'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/07 16:09:51
references:
  - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
  - https://www.revshells.com/
logsource:
    category: process_creation
    product: linux
detection:
    condition: all of selection_*
    selection_content:
      - CommandLine|contains|all:
          - fdopen(
          - ::Socket::INET
      - CommandLine|contains|all:
          - Socket
          - connect
          - open
          - exec
    selection_img:
        CommandLine|contains: ' -e '
        Image|endswith: /perl
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.execution
  - DEMO
