
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Linux Shell Pipe to Shell
id: 880973f3-9708-491c-a77b-2a35a1921158
status: test
description: Detects suspicious process command line that starts with a shell that
    executes something and finally gets piped into another shell
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/14 12:21:31
references:
  - Internal Research
logsource:
    category: process_creation
    product: linux
detection:
    condition: all of selection*
    selection:
        CommandLine|startswith:
          - 'sh -c '
          - 'bash -c '
    selection_exec:
      - CommandLine|contains:
          - '| bash '
          - '| sh '
          - '|bash '
          - '|sh '
      - CommandLine|endswith:
          - '| bash'
          - '| sh'
          - '|bash'
          - ' |sh'
falsepositives: Legitimate software that uses these patterns
level: medium
customer: 'demo'
modified: 2022/07/26
tags:
  - attack.defense_evasion
  - attack.t1140
  - DEMO
