
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Container Residence Discovery Via Proc Virtual FS
id: 746c86fb-ccda-4816-8997-01386263acc4
status: experimental
description: Detects potential container discovery via listing of certain kernel features
    in the "/proc" virtual filesystem
author: Seth Hanford
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/23 18:42:51
references:
  - https://blog.skyplabs.net/posts/container-detection/
  - https://stackoverflow.com/questions/20010199/how-to-determine-if-a-process-runs-inside-lxc-docker
logsource:
    category: process_creation
    product: linux
detection:
    condition: selection_tools and 1 of selection_procfs_*
    selection_procfs_kthreadd:
        CommandLine|contains: /proc/2/
    selection_procfs_target:
        CommandLine|contains: /proc/
        CommandLine|endswith:
          - /cgroup
          - /sched
    selection_tools:
        Image|endswith:
          - awk
          - /cat
          - grep
          - /head
          - /less
          - /more
          - /nl
          - /tail
falsepositives:
  - Legitimate system administrator usage of these commands
  - Some container tools or deployments may use these techniques natively to determine
    how they proceed with execution, and will need to be filtered
level: low
customer: 'demo'
tags:
  - attack.discovery
  - attack.t1082
  - DEMO
