
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Local Groups Discovery - Linux
id: 676381a6-15ca-4d73-a9c8-6a22e970b90d
status: test
description: Detects enumeration of local system groups. Adversaries may attempt to
    find local system groups and permission settings
author: Ömer Günal, Alejandro Ortuno, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/11 13:44:01
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md
logsource:
    category: process_creation
    product: linux
detection:
    condition: 1 of selection*
    selection_1:
        Image|endswith: /groups
    selection_2:
        CommandLine|contains: /etc/group
        Image|endswith:
          - /cat
          - /head
          - /tail
          - /more
falsepositives: Legitimate administration activities
level: low
customer: 'demo'
modified: 2022/11/27
tags:
  - attack.discovery
  - attack.t1069.001
  - DEMO
