
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Linux Base64 Encoded Pipe to Shell
id: ba592c6d-6888-43c3-b8c6-689b8fe47337
status: experimental
description: Detects suspicious process command line that uses base64 encoded input
    for execution with a shell
author: pH-T (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/26 14:18:41
references:
  - https://github.com/arget13/DDexec
  - https://www.mandiant.com/resources/blog/barracuda-esg-exploited-globally
logsource:
    category: process_creation
    product: linux
detection:
    condition: all of selection_*
    selection_base64:
        CommandLine|contains: 'base64 '
    selection_exec:
      - CommandLine|contains:
          - '| bash '
          - '| sh '
          - '|bash '
          - '|sh '
      - CommandLine|endswith:
          - ' |sh'
          - '| bash'
          - '| sh'
          - '|bash'
falsepositives: Legitimate administration activities
level: medium
customer: 'demo'
modified: 2023/06/16
tags:
  - attack.defense_evasion
  - attack.t1140
  - DEMO
