
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Discovery Activity Using Find - Linux
id: 8344c0e5-5783-47cc-9cf9-a0f7fd03e6cf
related:
  - type: similar
    id: 85de3a19-b675-4a51-bfc6-b11a5186c971
status: test
description: Detects usage of "find" binary in a suspicious manner to perform discovery
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/28 18:14:51
references:
  - https://github.com/SaiSathvik1/Linux-Privilege-Escalation-Notes
logsource:
    category: process_creation
    product: linux
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - -perm -4000
          - -perm -2000
          - -perm 0777
          - -perm -222
          - -perm -o w
          - -perm -o x
          - -perm -u=s
          - -perm -g=s
        Image|endswith: /find
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.discovery
  - attack.t1083
  - DEMO
