
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Disabling Security Tools
id: e3a8a052-111f-4606-9aee-f28ebeb76776
status: test
description: Detects disabling security tools
author: Ömer Günal, Alejandro Ortuno, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/06/17 12:33:01
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md
logsource:
    category: process_creation
    product: linux
detection:
    condition: 1 of selection*
    selection_carbonblack_1:
        CommandLine|contains|all:
          - cbdaemon
          - stop
        Image|endswith: /service
    selection_carbonblack_2:
        CommandLine|contains|all:
          - cbdaemon
          - "off"
        Image|endswith: /chkconfig
    selection_carbonblack_3:
        CommandLine|contains|all:
          - cbdaemon
          - stop
        Image|endswith: /systemctl
    selection_carbonblack_4:
        CommandLine|contains|all:
          - cbdaemon
          - disable
        Image|endswith: /systemctl
    selection_crowdstrike_1:
        CommandLine|contains|all:
          - stop
          - falcon-sensor
        Image|endswith: /systemctl
    selection_crowdstrike_2:
        CommandLine|contains|all:
          - disable
          - falcon-sensor
        Image|endswith: /systemctl
    selection_firewall_1:
        CommandLine|contains|all:
          - firewalld
          - stop
        Image|endswith: /systemctl
    selection_firewall_2:
        CommandLine|contains|all:
          - firewalld
          - disable
        Image|endswith: /systemctl
    selection_iptables_1:
        CommandLine|contains|all:
          - iptables
          - stop
        Image|endswith: /service
    selection_iptables_2:
        CommandLine|contains|all:
          - ip6tables
          - stop
        Image|endswith: /service
    selection_iptables_3:
        CommandLine|contains|all:
          - iptables
          - stop
        Image|endswith: /chkconfig
    selection_iptables_4:
        CommandLine|contains|all:
          - ip6tables
          - stop
        Image|endswith: /chkconfig
    selection_selinux:
        CommandLine|contains: "0"
        Image|endswith: /setenforce
falsepositives: Legitimate administration activities
level: medium
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.defense_evasion
  - attack.t1562.004
  - DEMO
