
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Linux Doas Tool Execution
id: 067d8238-7127-451c-a9ec-fa78045b618b
status: stable
description: Detects the doas tool execution in linux host platform. This utility
    tool allow standard users to perform tasks as root, the same way sudo does.
author: Sittikorn S, Teoderick Contreras
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/20 12:36:11
references:
  - https://research.splunk.com/endpoint/linux_doas_tool_execution/
  - https://www.makeuseof.com/how-to-install-and-use-doas/
logsource:
    category: process_creation
    product: linux
detection:
    condition: selection
    selection:
        Image|endswith: /doas
falsepositives: Unlikely
level: low
customer: 'demo'
tags:
  - attack.privilege_escalation
  - attack.t1548
  - DEMO
