
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Commands to Clear or Remove the Syslog
id: 3fcc9b35-39e4-44c0-a2ad-9e82b6902b31
status: test
description: Detects specific commands commonly used to remove or empty the syslog.
    Which is often used by attacker as a method to hide their tracks
author: Max Altgelt (Nextron Systems), Roberto Rodriguez (Cyb3rWard0g), OTR (Open
    Threat Research), MSTIC
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/10/15 15:48:51
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.002/T1070.002.md
logsource:
    category: process_creation
    product: linux
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - rm /var/log/syslog
          - rm -r /var/log/syslog
          - rm -f /var/log/syslog
          - rm -rf /var/log/syslog
          - unlink /var/log/syslog
          - unlink -r /var/log/syslog
          - unlink -f /var/log/syslog
          - unlink -rf /var/log/syslog
          - mv /var/log/syslog
          - ' >/var/log/syslog'
          - ' > /var/log/syslog'
falsepositives: Log rotation.
level: high
customer: 'demo'
modified: 2022/09/15
tags:
  - attack.defense_evasion
  - attack.t1070.002
  - DEMO
