
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: ESXi System Information Discovery Via ESXCLI
id: e80273e1-9faf-40bc-bd85-dbaff104c4e9
status: experimental
description: Detects execution of the "esxcli" command with the "system" flag in order
    to retrieve information about the different component of the system. Such as accounts,
    modules, NTP, etc.
author: Cedric Maurugeon
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/09/04 17:07:21
references:
  - https://www.crowdstrike.com/blog/hypervisor-jackpotting-ecrime-actors-increase-targeting-of-esxi-servers/
  - https://developer.vmware.com/docs/11743/esxi-7-0-esxcli-command-reference/namespace/esxcli_system.html
logsource:
    category: process_creation
    product: linux
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains:
          - ' get'
          - ' list'
    selection_img:
        CommandLine|contains: system
        Image|endswith: /esxcli
falsepositives: Legitimate administration activities
level: medium
customer: 'demo'
tags:
  - attack.discovery
  - attack.t1033
  - attack.t1007
  - DEMO
