
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Curl File Upload - Linux
id: 00b90cc1-17ec-402c-96ad-3a8117d7a582
related:
  - type: derived
    id: 00bca14a-df4e-4649-9054-3f2aa676bc04
status: test
description: Detects a suspicious curl process start the adds a file to a web request
author: Nasreddine Bencherchali (Nextron Systems), Cedric MAURUGEON (Update)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/15 14:55:51
references:
  - https://twitter.com/d1r4c/status/1279042657508081664
  - https://medium.com/@petehouston/upload-files-with-curl-93064dcccc76
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1105/T1105.md#atomic-test-19---curl-upload-file
  - https://curl.se/docs/manpage.html
  - https://www.trendmicro.com/en_us/research/22/i/how-malicious-actors-abuse-native-linux-tools-in-their-attacks.html
logsource:
    category: process_creation
    product: linux
detection:
    condition: all of selection_* and not 1 of filter_optional_*
    filter_optional_localhost:
        CommandLine|contains:
          - ://localhost
          - ://127.0.0.1
    selection_cli:
      - CommandLine|contains:
          - ' --form'
          - ' --upload-file '
          - ' --data '
          - ' --data-'
      - CommandLine|re: \s-[FTd]\s
    selection_img:
        Image|endswith: /curl
falsepositives: Scripts created by developers and admins
level: medium
customer: 'demo'
modified: 2023/05/02
tags:
  - attack.exfiltration
  - attack.t1567
  - attack.t1105
  - DEMO
