
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: System Network Discovery - Linux
id: e7bd1cfa-b446-4c88-8afb-403bcd79e3fa
status: test
description: Detects enumeration of local network configuration
author: Ömer Günal and remotephone, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/06 14:27:21
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md
logsource:
    category: process_creation
    product: linux
detection:
    condition: 1 of selection_*
    selection_cli:
        CommandLine|contains: /etc/resolv.conf
    selection_img:
        Image|endswith:
          - /firewall-cmd
          - /ufw
          - /iptables
          - /netstat
          - /ss
          - /ip
          - /ifconfig
          - /systemd-resolve
          - /route
falsepositives: Legitimate administration activities
level: informational
customer: 'demo'
modified: 2022/09/15
tags:
  - attack.discovery
  - attack.t1016
  - DEMO
