
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Windows Event Auditing Disabled
id: 69aeb277-f15f-4d2d-b32a-55e883609563
related:
  - type: derived
    id: ab4561b1-6c7e-48a7-ad08-087cfb9ce8f1
status: test
description: |
    Detects scenarios where system auditing (i.e.: Windows event log auditing) is disabled.
    This may be used in a scenario where an entity would want to bypass local logging to evade detection when Windows event logging is enabled and reviewed.
    Also, it is recommended to turn off "Local Group Policy Object Processing" via GPO, which will make sure that Active Directory GPOs take precedence over local/edited computer policies via something such as "gpedit.msc".
    Please note, that disabling "Local Group Policy Object Processing" may cause an issue in scenarios of one off specific GPO modifications - however, it is recommended to perform these modifications in Active Directory anyways.
author: '@neu5ron, Nasreddine Bencherchali (Nextron Systems)'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/11/19 14:15:01
references:
  - https://docs.google.com/presentation/d/1dkrldTTlN3La-OjWtkWJBb4hVk6vfsSMBFBERs6R8zA/edit
logsource:
    product: windows
    service: security
    definition: dfd8c0f4-e6ad-4e07-b91b-f2fca0ddef64
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_guid:
        SubcategoryGuid:
          - '{0CCE9210-69AE-11D9-BED3-505054503030}'
          - '{0CCE9211-69AE-11D9-BED3-505054503030}'
          - '{0CCE9212-69AE-11D9-BED3-505054503030}'
          - '{0CCE9215-69AE-11D9-BED3-505054503030}'
          - '{0CCE9217-69AE-11D9-BED3-505054503030}'
          - '{0CCE921B-69AE-11D9-BED3-505054503030}'
          - '{0CCE922B-69AE-11D9-BED3-505054503030}'
          - '{0CCE922F-69AE-11D9-BED3-505054503030}'
          - '{0CCE9230-69AE-11D9-BED3-505054503030}'
          - '{0CCE9235-69AE-11D9-BED3-505054503030}'
          - '{0CCE9236-69AE-11D9-BED3-505054503030}'
          - '{0CCE9237-69AE-11D9-BED3-505054503030}'
          - '{0CCE923F-69AE-11D9-BED3-505054503030}'
          - '{0CCE9240-69AE-11D9-BED3-505054503030}'
          - '{0CCE9242-69AE-11D9-BED3-505054503030}'
    selection:
        AuditPolicyChanges|contains:
          - '%%8448'
          - '%%8450'
        EventID: "4719"
falsepositives: Unknown
level: low
customer: 'demo'
modified: 2023/11/15
tags:
  - attack.defense_evasion
  - attack.t1562.002
  - DEMO
