
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: User Logoff Event
id: 0badd08f-c6a3-4630-90d3-6875cca440be
status: test
description: Detects a user log-off activity. Could be used for example to correlate
    information during forensic investigations
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/14 10:26:21
references:
  - https://github.com/Yamato-Security/EnableWindowsLogSettings/blob/7f6d755d45ac7cc9fc35b0cbf498e6aa4ef19def/ConfiguringSecurityLogAuditPolicies.md
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4634
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4647
logsource:
    product: windows
    service: security
detection:
    condition: selection
    selection:
        EventID:
          - "4634"
          - "4647"
falsepositives: Unknown
level: informational
customer: 'demo'
tags:
  - attack.impact
  - attack.t1531
  - DEMO
