
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Hidden Local User Creation
id: 7b449a5e-1db5-4dd0-a2dc-4e3a67282538
status: test
description: Detects the creation of a local hidden user account which should not
    happen for event ID 4720.
author: Christian Burkard (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/05/03 12:41:51
references:
  - https://twitter.com/SBousseaden/status/1387743867663958021
logsource:
    product: windows
    service: security
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_homegroup:
        TargetUserName: HomeGroupUser$
    selection:
        EventID: "4720"
        TargetUserName|endswith: $
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2024/01/16
tags:
  - attack.persistence
  - attack.t1136.001
  - DEMO
