
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Hacktool Ruler
id: 24549159-ac1b-479c-8175-d42aea947cae
status: test
description: This events that are generated when using the hacktool Ruler by Sensepost
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/05/31 09:49:11
references:
  - https://github.com/sensepost/ruler
  - https://github.com/sensepost/ruler/issues/47
  - https://github.com/staaldraad/go-ntlm/blob/cd032d41aa8ce5751c07cb7945400c0f5c81e2eb/ntlm/ntlmv1.go#L427
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4776
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4624
logsource:
    product: windows
    service: security
detection:
    condition: (1 of selection*)
    selection1:
        EventID: "4776"
        Workstation: RULER
    selection2:
        EventID:
          - "4624"
          - "4625"
        WorkstationName: RULER
falsepositives: Go utilities that use staaldraad awesome NTLM library
level: high
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.discovery
  - attack.execution
  - attack.t1087
  - attack.t1114
  - attack.t1059
  - attack.t1550.002
  - DEMO
