
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Metasploit Or Impacket Service Installation Via SMB PsExec
id: 6fb63b40-e02a-403e-9ffd-3bcc1d749442
related:
  - type: derived
    id: 1a17ce75-ff0d-4f02-9709-2b7bb5618cf0
status: test
description: Detects usage of Metasploit SMB PsExec (exploit/windows/smb/psexec) and
    Impacket psexec.py by triggering on specific service installation
author: Bartlomiej Czyz, Relativity
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/01/21 20:55:41
references:
  - https://bczyz1.github.io/2021/01/30/psexec.html
logsource:
    product: windows
    service: security
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
detection:
    condition: selection and not filter
    filter:
        ServiceName: PSEXESVC
    selection:
        EventID: "4697"
        ServiceFileName|re: ^%systemroot%\\[a-zA-Z]{8}\.exe$
        ServiceName|re: (^[a-zA-Z]{4}$)|(^[a-zA-Z]{8}$)|(^[a-zA-Z]{16}$)
        ServiceStartType: "3"
        ServiceType: "0x10"
fields:
  - ComputerName
  - SubjectDomainName
  - SubjectUserName
  - ServiceName
  - ServiceFileName
falsepositives: Possible, different agents with a 8 character binary and a 4, 8 or
    16 character service name
level: high
customer: 'demo'
modified: 2022/10/05
tags:
  - attack.lateral_movement
  - attack.t1021.002
  - attack.t1570
  - attack.execution
  - attack.t1569.002
  - DEMO
