
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious PsExec Execution
id: c462f537-a1e3-41a6-b5fc-b2c2cef9bf82
status: test
description: detects execution of psexec or paexec with renamed service name, this
    rule helps to filter out the noise if psexec is used for legit purposes or if
    attacker uses a different psexec client other than sysinternal one
author: Samir Bousseaden
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/04/03 13:25:51
references:
  - https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html
logsource:
    product: windows
    service: security
    definition: The advanced audit policy setting "Object Access > Audit Detailed
        File Share" must be configured for Success/Failure
detection:
    condition: selection1 and not filter
    filter:
        RelativeTargetName|startswith: PSEXESVC
    selection1:
        EventID: "5145"
        RelativeTargetName|endswith:
          - -stdin
          - -stdout
          - -stderr
        ShareName: \\\\\*\\IPC$
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/08/11
tags:
  - attack.lateral_movement
  - attack.t1021.002
  - DEMO
