
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Outbound Kerberos Connection - Security
id: eca91c7c-9214-47b9-b4c5-cb1d7e4f2350
related:
  - type: similar
    id: e54979bd-c5f9-4d6c-967b-a04b19ac4c74
status: test
description: Detects suspicious outbound network activity via kerberos default port
    indicating possible lateral movement or first stage PrivEsc via delegation.
author: Ilyas Ochkov, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/24 19:29:31
references:
  - https://github.com/GhostPack/Rubeus
logsource:
    product: windows
    service: security
detection:
    condition: selection and not 1 of filter_*
    filter_exact:
        Application:
          - C:\Windows\System32\lsass.exe
          - C:\Program Files\Google\Chrome\Application\chrome.exe
          - C:\Program Files (x86)\Google\Chrome\Application\chrome.exe
          - C:\Program Files\Mozilla Firefox\firefox.exe
          - C:\Program Files (x86)\Mozilla Firefox\firefox.exe
    selection:
        DestPort: "88"
        EventID: "5156"
falsepositives: Web Browsers
level: high
customer: 'demo'
modified: 2023/01/30
tags:
  - attack.lateral_movement
  - attack.t1558.003
  - DEMO
