
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Transferring Files with Credential Data via Network Shares
id: 910ab938-668b-401b-b08c-b596e80fdca5
related:
  - type: similar
    id: 2e69f167-47b5-4ae7-a390-47764529eff5
status: test
description: Transferring files with well-known filenames (sensitive files with credential
    data) using network shares
author: Teymur Kheirkhabarov, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/22 21:18:51
references:
  - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
logsource:
    product: windows
    service: security
detection:
    condition: selection
    selection:
        EventID: "5145"
        RelativeTargetName|contains:
          - \mimidrv
          - \lsass
          - \windows\minidump\
          - \hiberfil
          - \sqldmpr
          - \sam
          - \ntds.dit
          - \security
falsepositives: Transferring sensitive files for legitimate administration work by
    legitimate administrator
level: medium
customer: 'demo'
modified: 2021/11/30
tags:
  - attack.credential_access
  - attack.t1003.002
  - attack.t1003.001
  - attack.t1003.003
  - DEMO
