
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Win Susp Computer Name Containing Samtheadmin
id: 39698b3f-da92-4bc6-bfb5-645a98386e45
status: test
description: Detects suspicious computer name samtheadmin-{1..100}$ generated by hacktool
author: elhoim
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/09 17:54:21
references:
  - https://twitter.com/malmoeb/status/1511760068743766026
  - https://github.com/WazeHell/sam-theadmin/blob/main/sam_the_admin.py
  - https://github.com/helloexp/0day/blob/614227a7b9beb0e91e7e2c6a5e532e6f7a8e883c/00-CVE_EXP/CVE-2021-42287/sam-the-admin/sam_the_admin.py
logsource:
    product: windows
    service: security
detection:
    condition: 1 of selection*
    selection1:
        SamAccountName|endswith: $
        SamAccountName|startswith: SAMTHEADMIN-
    selection2:
        TargetUserName|endswith: $
        TargetUserName|startswith: SAMTHEADMIN-
fields:
  - EventID
  - SamAccountName
  - SubjectUserName
  - TargetUserName
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2023/01/04
tags:
  - cve.2021.42278
  - cve.2021.42287
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1078
  - DEMO
