
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Tap Driver Installation - Security
id: 9c8afa4d-0022-48f0-9456-3712466f9701
related:
  - type: derived
    id: 8e4cf0e5-aa5d-4dc3-beff-dc26917744a9
status: test
description: |
    Detects the installation of a well-known TAP driver service. This could be a sign of potential preparation for data exfiltration using tunnelling techniques.
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/24 14:54:41
references:
  - https://community.openvpn.net/openvpn/wiki/ManagingWindowsTAPDrivers
logsource:
    product: windows
    service: security
    definition: 'Requirements: The System Security Extension audit subcategory need
        to be enabled to log the EID 4697'
detection:
    condition: selection
    selection:
        EventID: "4697"
        ServiceFileName|contains: tap0901
falsepositives: Legitimate OpenVPN TAP installation
level: low
customer: 'demo'
modified: 2022/11/29
tags:
  - attack.exfiltration
  - attack.t1048
  - DEMO
