
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Windows Pcap Drivers
id: 7b687634-ab20-11ea-bb37-0242ac130002
status: test
description: Detects Windows Pcap driver installation based on a list of associated
    .sys files.
author: Cian Heasley
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/06/10 11:22:21
references:
  - https://ragged-lab.blogspot.com/2020/06/capturing-pcap-driver-installations.html#more
logsource:
    product: windows
    service: security
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
detection:
    condition: selection
    selection:
        EventID: "4697"
        ServiceFileName|contains:
          - pcap
          - npcap
          - npf
          - nm3
          - ndiscap
          - nmnt
          - windivert
          - USBPcap
          - pktmon
fields:
  - EventID
  - ServiceFileName
  - Account_Name
  - Computer_Name
  - Originating_Computer
  - ServiceName
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/04/14
tags:
  - attack.discovery
  - attack.credential_access
  - attack.t1040
  - DEMO
