
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: A Member Was Removed From a Security-Enabled Global Group
id: 02c39d30-02b5-45d2-b435-8aebfe5a8629
related:
  - type: obsoletes
    id: 9cf01b6c-e723-4841-a868-6d7f8245ca6e
status: stable
description: Detects activity when a member is removed from a security-enabled global
    group
author: Alexandr Yampolskyi, SOC Prime
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/26 20:17:31
references:
  - https://www.cisecurity.org/controls/cis-controls-list/
  - https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
  - https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4729
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=633
logsource:
    product: windows
    service: security
detection:
    condition: selection
    selection:
        EventID:
          - "633"
          - "4729"
falsepositives: Unknown
level: low
customer: 'demo'
tags:
  - attack.persistence
  - attack.t1098
  - DEMO
