
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Diamond Sleet APT Scheduled Task Creation
id: 3b8e5084-4de9-449a-a40d-0e11014f2e2d
status: experimental
description: |
    Detects registry event related to the creation of a scheduled task used by Diamond Sleet APT during exploitation of Team City CVE-2023-42793 vulnerability
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/24 16:22:31
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
logsource:
    product: windows
    service: security
    definition: The Advanced Audit Policy setting Object Access > Audit Other Object
        Access Events has to be configured to allow this detection. We also recommend
        extracting the Command field from the embedded XML in the event data.
detection:
    condition: selection
    selection:
        EventID: "4698"
        TaskContent|contains: uTYNkfKxHiZrx3KJ
        TaskName: \Windows TeamCity Settings User Interface
falsepositives: Unknown
level: critical
customer: 'demo'
tags:
  - attack.execution
  - attack.privilege_escalation
  - attack.persistence
  - attack.t1053.005
  - detection.emerging_threats
  - DEMO
