
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Remote Access Tool Services Have Been Installed - Security
id: c8b00925-926c-47e3-beea-298fd563728e
related:
  - type: similar
    id: 1a31b18a-f00c-4061-9900-f735b96c99fc
status: experimental
description: Detects service installation of different remote access tools software.
    These software are often abused by threat actors to perform
author: Connor Martin, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/23 20:45:51
references:
  - https://redcanary.com/blog/misbehaving-rats/
logsource:
    product: windows
    service: security
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
detection:
    condition: selection
    selection:
        EventID: "4697"
        ServiceName|contains:
          - AmmyyAdmin
          - Atera
          - BASupportExpressSrvcUpdater
          - BASupportExpressStandaloneService
          - chromoting
          - GoToAssist
          - GoToMyPC
          - jumpcloud
          - LMIGuardianSvc
          - LogMeIn
          - monblanking
          - Parsec
          - RManService
          - RPCPerformanceService
          - RPCService
          - SplashtopRemoteService
          - SSUService
          - TeamViewer
          - TightVNC
          - vncserver
          - Zoho
falsepositives: The rule doesn't look for anything suspicious so false positives are
    expected. If you use one of the tools mentioned, comment it out
level: medium
customer: 'demo'
modified: 2023/11/15
tags:
  - attack.persistence
  - attack.t1543.003
  - attack.t1569.002
  - DEMO
