
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: LSASS Access From Non System Account
id: 962fe167-e48d-4fd6-9974-11e5b9a5d6d1
status: test
description: Detects potential mimikatz-like tools accessing LSASS from non system
    account
author: Roberto Rodriguez @Cyb3rWard0g
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/06/20 14:54:51
references:
  - https://threathunterplaybook.com/hunts/windows/170105-LSASSMemoryReadAccess/notebook.html
logsource:
    product: windows
    service: security
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_generic:
        ProcessName|contains:
          - :\Program Files\
          - :\Program Files (x86)\
    filter_main_service_account:
        SubjectUserName|endswith: $
    filter_main_wmiprvse:
        AccessMask: "0x1410"
        ProcessName: C:\Windows\System32\wbem\WmiPrvSE.exe
    filter_optional_steam:
        ProcessName|contains: \SteamLibrary\steamapps\
    selection:
        AccessMask:
          - "0x100000"
          - "0x1010"
          - "0x1400"
          - "0x1410"
          - "0x1418"
          - "0x1438"
          - "0x143a"
          - "0x1f0fff"
          - "0x1f1fff"
          - "0x1f2fff"
          - "0x1f3fff"
          - "0x40"
          - 143a
          - 1f0fff
          - 1f1fff
          - 1f2fff
          - 1f3fff
        EventID:
          - "4663"
          - "4656"
        ObjectName|endswith: \lsass.exe
        ObjectType: Process
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/12/11
tags:
  - attack.credential_access
  - attack.t1003.001
  - DEMO
