
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Persistence and Execution at Scale via GPO Scheduled Task
id: a8f29a7b-b137-4446-80a0-b804272f3da2
status: test
description: Detect lateral movement using GPO scheduled task, usually used to deploy
    ransomware at scale
author: Samir Bousseaden
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/04/03 20:32:31
references:
  - https://twitter.com/menasec1/status/1106899890377052160
  - https://www.secureworks.com/blog/ransomware-as-a-distraction
logsource:
    product: windows
    service: security
    definition: The advanced audit policy setting "Object Access > Audit Detailed
        File Share" must be configured for Success/Failure
detection:
    condition: selection
    selection:
        Accesses|contains:
          - WriteData
          - '%%4417'
        EventID: "5145"
        RelativeTargetName|endswith: ScheduledTasks.xml
        ShareName: \\\\\*\\SYSVOL
falsepositives: If the source IP is not localhost then it's super suspicious, better
    to monitor both local and remote changes to GPO scheduledtasks
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.persistence
  - attack.lateral_movement
  - attack.t1053.005
  - DEMO
