
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Active Directory Replication from Non Machine Account
id: 17d619c1-e020-4347-957e-1d1207455c93
status: test
description: Detects potential abuse of Active Directory Replication Service (ADRS)
    from a non machine account to request credentials.
author: Roberto Rodriguez @Cyb3rWard0g
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/07/26 19:59:21
references:
  - https://threathunterplaybook.com/hunts/windows/180815-ADObjectAccessReplication/notebook.html
  - https://threathunterplaybook.com/library/windows/active_directory_replication.html
  - https://threathunterplaybook.com/hunts/windows/190101-ADModDirectoryReplication/notebook.html
logsource:
    product: windows
    service: security
detection:
    condition: selection and not filter
    filter:
      - SubjectUserName|endswith: $
      - SubjectUserName|startswith: MSOL_
    selection:
        AccessMask: "0x100"
        EventID: "4662"
        Properties|contains:
          - 1131f6aa-9c07-11d1-f79f-00c04fc2dcd2
          - 1131f6ad-9c07-11d1-f79f-00c04fc2dcd2
          - 89e95b76-444d-4c62-991a-0facbeda640c
fields:
  - ComputerName
  - SubjectDomainName
  - SubjectUserName
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.credential_access
  - attack.t1003.006
  - DEMO
