
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: WCE wceaux.dll Access
id: 1de68c67-af5c-4097-9c85-fe5578e09e67
status: test
description: Detects wceaux.dll access while WCE pass-the-hash remote command execution
    on source host
author: Thomas Patzke
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/06/14 11:16:01
references:
  - https://www.jpcert.or.jp/english/pub/sr/ir_research.html
  - https://jpcertcc.github.io/ToolAnalysisResultSheet
logsource:
    product: windows
    service: security
detection:
    condition: selection
    selection:
        EventID:
          - "4656"
          - "4658"
          - "4660"
          - "4663"
        ObjectName|endswith: \wceaux.dll
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.credential_access
  - attack.t1003
  - attack.s0005
  - DEMO
