
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: RottenPotato Like Attack Pattern
id: 16f5d8ca-44bd-47c8-acbe-6fc95a16c12f
status: test
description: Detects logon events that have characteristics of events generated during
    an attack with RottenPotato and the like
author: '@SBousseaden, Florian Roth'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/11/15 14:34:21
references:
  - https://twitter.com/SBousseaden/status/1195284233729777665
logsource:
    product: windows
    service: security
detection:
    condition: selection
    selection:
        EventID: "4624"
        IpAddress:
          - 127.0.0.1
          - ::1
        LogonType: "3"
        TargetUserName: ANONYMOUS LOGON
        WorkstationName: '-'
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/12/22
tags:
  - attack.privilege_escalation
  - attack.credential_access
  - attack.t1557.001
  - DEMO
