
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Password Protected ZIP File Opened (Suspicious Filenames)
id: 54f0434b-726f-48a1-b2aa-067df14516e4
status: test
description: Detects the extraction of password protected ZIP archives with suspicious
    file names. See the filename variable for more details on which file has been
    opened.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/05/09 20:41:11
references:
  - https://twitter.com/sbousseaden/status/1523383197513379841
logsource:
    product: windows
    service: security
detection:
    condition: selection and selection_filename
    selection:
        EventID: "5379"
        TargetName|contains: Microsoft_Windows_Shell_ZipFolder:filename
    selection_filename:
        TargetName|contains:
          - invoice
          - new order
          - rechnung
          - factura
          - delivery
          - purchase
          - order
          - payment
falsepositives: Legitimate used of encrypted ZIP files
level: high
customer: 'demo'
tags:
  - attack.command_and_control
  - attack.defense_evasion
  - attack.t1027
  - attack.t1105
  - attack.t1036
  - DEMO
