
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - NoFilter Execution
id: 7b14c76a-c602-4ae6-9717-eff868153fc0
status: experimental
description: |
    Detects execution of NoFilter, a tool for abusing the Windows Filtering Platform for privilege escalation via hardcoded policy name indicators
author: Stamatis Chatzimangou (st0pp3r)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/01/05 13:26:51
references:
  - https://github.com/deepinstinct/NoFilter/blob/121d215ab130c5e8e3ad45a7e7fcd56f4de97b4d/NoFilter/Consts.cpp
  - https://github.com/deepinstinct/NoFilter
  - https://www.deepinstinct.com/blog/nofilter-abusing-windows-filtering-platform-for-privilege-escalation
  - https://x.com/_st0pp3r_/status/1742203752361128162?s=20
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Filtering Platform Policy Change needs to be
        enabled'
detection:
    condition: 1 of selection_*
    selection_5447:
        EventID: "5447"
        FilterName|contains: RonPolicy
    selection_5449:
        EventID: "5449"
        ProviderContextName|contains: RonPolicy
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.privilege_escalation
  - attack.t1134
  - attack.t1134.001
  - DEMO
