
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: A New Trust Was Created To A Domain
id: 0255a820-e564-4e40-af2b-6ac61160335c
status: stable
description: Addition of domains is seldom and should be verified for legitimacy.
author: Thomas Patzke
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/12/03 14:18:01
references:
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4706
logsource:
    product: windows
    service: security
detection:
    condition: selection
    selection:
        EventID: "4706"
falsepositives: Legitimate extension of domain structure
level: medium
customer: 'demo'
modified: 2024/01/16
tags:
  - attack.persistence
  - attack.t1098
  - DEMO
