
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Possible PetitPotam Coerce Authentication Attempt
id: 1ce8c8a3-2723-48ed-8246-906ac91061a6
status: test
description: Detect PetitPotam coerced authentication activity.
author: Mauricio Velazco, Michael Haag
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/09/02 19:18:41
references:
  - https://github.com/topotam/PetitPotam
  - https://github.com/splunk/security_content/blob/0dd6de32de2118b2818550df9e65255f4109a56d/detections/endpoint/petitpotam_network_share_access_request.yml
logsource:
    product: windows
    service: security
    definition: The advanced audit policy setting "Object Access > Detailed File Share"
        must be configured for Success/Failure
detection:
    condition: selection
    selection:
        EventID: "5145"
        RelativeTargetName: lsarpc
        ShareName|endswith: \IPC$
        ShareName|startswith: \\\\
        SubjectUserName: ANONYMOUS LOGON
falsepositives: Unknown. Feedback welcomed.
level: high
customer: 'demo'
modified: 2022/08/11
tags:
  - attack.credential_access
  - attack.t1187
  - DEMO
