
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DCERPC SMB Spoolss Named Pipe
id: 214e8f95-100a-4e04-bb31-ef6cba8ce07e
status: test
description: Detects the use of the spoolss named pipe over SMB. This can be used
    to trigger the authentication via NTLM of any machine that has the spoolservice
    enabled.
author: OTR (Open Threat Research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/11/28 12:44:11
references:
  - https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1
  - https://dirkjanm.io/a-different-way-of-abusing-zerologon/
  - https://twitter.com/_dirkjan/status/1309214379003588608
logsource:
    product: windows
    service: security
detection:
    condition: selection
    selection:
        EventID: "5145"
        RelativeTargetName: spoolss
        ShareName: \\\\\*\\IPC$
falsepositives: Domain Controllers acting as printer servers too? :)
level: medium
customer: 'demo'
modified: 2022/08/11
tags:
  - attack.lateral_movement
  - attack.t1021.002
  - DEMO
