
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: SysKey Registry Keys Access
id: 9a4ff3b8-6187-4fd2-8e8b-e0eae1129495
status: test
description: Detects handle requests and access operations to specific registry keys
    to calculate the SysKey
author: Roberto Rodriguez @Cyb3rWard0g
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/08/12 13:09:11
references:
  - https://threathunterplaybook.com/hunts/windows/190625-RegKeyAccessSyskey/notebook.html
logsource:
    product: windows
    service: security
detection:
    condition: selection
    selection:
        EventID:
          - "4656"
          - "4663"
        ObjectName|endswith:
          - lsa\JD
          - lsa\GBG
          - lsa\Skew1
          - lsa\Data
        ObjectType: key
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.discovery
  - attack.t1012
  - DEMO
