
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Scripting in a WMI Consumer
id: fe21810c-2a8c-478f-8dd3-5a287fb2a0e0
status: experimental
description: Detects suspicious commands that are related to scripting/powershell
    in WMI Event Consumers
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/04/15 15:56:31
references:
  - https://in.security/an-intro-into-abusing-and-identifying-wmi-event-subscriptions-for-persistence/
  - https://github.com/Neo23x0/signature-base/blob/615bf1f6bac3c1bdc417025c40c073e6c2771a76/yara/gen_susp_lnk_files.yar#L19
  - https://github.com/RiccardoAncarani/LiquidSnake
logsource:
    category: wmi_event
    product: windows
detection:
    condition: selection_destination
    selection_destination:
      - Destination|contains|all:
          - new-object
          - net.webclient
          - .downloadstring
      - Destination|contains|all:
          - new-object
          - net.webclient
          - .downloadfile
      - Destination|contains:
          - ' iex('
          - ' -nop '
          - ' -noprofile '
          - ' -decode '
          - ' -enc '
          - WScript.Shell
          - System.Security.Cryptography.FromBase64Transform
fields:
  - User
  - Operation
falsepositives: Legitimate administrative scripts
level: high
customer: 'demo'
modified: 2023/09/09
tags:
  - attack.execution
  - attack.t1059.005
  - DEMO
