
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Unsigned Module Loaded by ClickOnce Application
id: 060d5ad4-3153-47bb-8382-43e5e29eda92
status: experimental
description: Detects unsigned module load by ClickOnce application.
author: '@SerkinValery'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/08 18:17:01
references:
  - https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5
logsource:
    category: image_load
    product: windows
detection:
    condition: all of selection_*
    selection_path:
        Image|contains: \AppData\Local\Apps\2.0\
    selection_sig_status:
      - Signed: "false"
      - SignatureStatus: Expired
falsepositives: Unlikely
level: medium
customer: 'demo'
tags:
  - attack.persistence
  - attack.t1574.002
  - DEMO
