
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Unsigned DLL Loaded by RunDLL32/RegSvr32
id: b5de0c9a-6f19-43e0-af4e-55ad01f550af
status: experimental
description: |
    Detects RunDLL32/RegSvr32 loading an unsigned or untrusted DLL.
    Adversaries often abuse those programs to proxy execution of malicious code.
author: Swachchhanda Shrawan Poudel
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/01/22 15:20:01
references:
  - https://www.elastic.co/security-labs/Hunting-for-Suspicious-Windows-Libraries-for-Execution-and-Evasion
  - https://akhere.hashnode.dev/hunting-unsigned-dlls-using-kql
  - https://unit42.paloaltonetworks.com/unsigned-dlls/?web_view=true
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_signed:
      - Signed: "true"
      - SignatureStatus:
          - errorChaining
          - errorCode_endpoint
          - errorExpired
          - trusted
    selection:
        Image|endswith:
          - \regsvr32.exe
          - \rundll32.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.t1218.011
  - attack.t1218.010
  - attack.defense_evasion
  - DEMO
