title: SMB Touch Scanner Suspicious Image Loads
id: 59564106-d31a-4277-a8fb-608695d5401f
status: test
description: Detects loading of known malicious dll names used in shadowbroker's smb-touch scanner
author: Nasreddine Bencherchali
references:
    - https://github.com/3gstudent/Smbtouch-Scanner
    - https://www.welivesecurity.com/2021/06/10/backdoordiplomacy-upgrading-quarian-turian/
date: 2022/05/07
modified: 2023/03/29
tags:
    - cve.2017.0144
    - cve.2017.0147
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith:
            - '\tucl-1.dll'
            - '\coli-0.dll'
            - '\trch-1.dll'
            - '\cnli-1.dll'
            - '\exma-1.dll'
            - '\tibe-2.dll'
            - '\trfo-2.dll'
    condition: selection
falsepositives:
    - Rare legitimate dlls with the same name
level: high
