
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Unsigned Thor Scanner Execution
id: ea5c131b-380d-49f9-aeb3-920694da4d4b
status: stable
description: Detects loading and execution of an unsigned thor scanner binary.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/29 17:25:11
references:
  - Internal Research
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not filter_main
    filter_main:
        Signature: Nextron Systems GmbH
        SignatureStatus: valid
        Signed: "true"
    selection:
        Image|endswith:
          - \thor.exe
          - \thor64.exe
        ImageLoaded|endswith:
          - \thor.exe
          - \thor64.exe
falsepositives: Other legitimate binaries named "thor.exe" that aren't published by
    Nextron Systems
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1574.002
  - DEMO
