
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Diamond Sleet APT DLL Sideloading Indicators
id: d1b65d98-37d7-4ff6-b139-2d87c1af3042
status: experimental
description: Detects DLL sideloading activity seen used by Diamond Sleet APT
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/24 17:03:31
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
logsource:
    category: image_load
    product: windows
detection:
    condition: 1 of selection_*
    selection_1:
        Image|endswith: :\ProgramData\clip.exe
        ImageLoaded|endswith: :\ProgramData\Version.dll
    selection_2:
        Image|endswith: :\ProgramData\wsmprovhost.exe
        ImageLoaded|endswith: :\ProgramData\DSROLE.dll
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1574.002
  - detection.emerging_threats
  - DEMO
