
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: CredUI.DLL Loaded By Uncommon Process
id: 9ae01559-cf7e-4f8e-8e14-4c290a1b4784
status: experimental
description: Detects loading of "credui.dll" and related DLLs by an uncommon process.
    Attackers might leverage this DLL for potential use of "CredUIPromptForCredentials"
    or "CredUnPackAuthenticationBufferW".
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/20 15:07:31
references:
  - https://securitydatasets.com/notebooks/atomic/windows/credential_access/SDWIN-201020013208.html
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.002/T1056.002.md#atomic-test-2---powershell---prompt-user-for-password
  - https://docs.microsoft.com/en-us/windows/win32/api/wincred/nf-wincred-creduipromptforcredentialsa
  - https://github.com/S12cybersecurity/RDPCredentialStealer
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_full:
        Image:
          - C:\Windows\explorer.exe
          - C:\Windows\ImmersiveControlPanel\SystemSettings.exe
          - C:\Windows\regedit.exe
    filter_main_generic:
        Image|startswith:
          - C:\Program Files (x86)\
          - C:\Program Files\
          - C:\Windows\System32\
          - C:\Windows\SysWOW64\
    filter_optional_onedrive:
        Image|contains: \AppData\Local\Microsoft\OneDrive\
        Image|startswith: C:\Users\
    filter_optional_opera:
        Image|endswith: \opera_autoupdate.exe
    filter_optional_process_explorer:
        Image|endswith:
          - \procexp64.exe
          - \procexp.exe
    filter_optional_teams:
        Image|contains: \AppData\Local\Microsoft\Teams\
        Image|endswith: \Teams.exe
        Image|startswith: C:\Users\
    selection:
      - ImageLoaded|endswith:
          - \credui.dll
          - \wincredui.dll
      - OriginalFileName:
          - credui.dll
          - wincredui.dll
falsepositives: Other legitimate processes loading those DLLs in your environment.
level: medium
customer: 'demo'
modified: 2023/07/28
tags:
  - attack.credential_access
  - attack.collection
  - attack.t1056.002
  - DEMO
