
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Sysmon File Executable Creation Detected
id: 693a44e9-7f26-4cb6-b787-214867672d3a
status: experimental
description: Triggers on any Sysmon "FileExecutableDetected" event, which triggers
    every time a PE that is monitored by the config is created.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/07/20 16:35:01
references:
  - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
  - https://medium.com/@olafhartong/sysmon-15-0-file-executable-detected-40fd64349f36
logsource:
    product: windows
    service: sysmon
detection:
    condition: selection
    selection:
        EventID: "29"
falsepositives: Unlikely
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - DEMO
