
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Sysmon Blocked Executable
id: 23b71bc5-953e-4971-be4c-c896cda73fc2
status: experimental
description: Triggers on any Sysmon "FileBlockExecutable" event, which indicates a
    violation of the configured block policy
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/16 12:45:11
references:
  - https://medium.com/@olafhartong/sysmon-14-0-fileblockexecutable-13d7ba3dff3e
logsource:
    product: windows
    service: sysmon
detection:
    condition: selection
    selection:
        EventID: "27"
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/09/16
tags:
  - attack.defense_evasion
  - DEMO
