
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Communication To Ngrok Domains
id: 18249279-932f-45e2-b37a-8925f2597670
status: test
description: Detects an executable accessing ngrok domains, which could be a sign
    of forbidden data exfiltration by malicious actors
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/16 14:00:51
references:
  - https://ngrok.com/
  - https://ngrok.com/blog-post/new-ngrok-domains
  - https://www.virustotal.com/gui/file/cca0c1182ac114b44dc52dd2058fcd38611c20bb6b5ad84710681d38212f835a/
  - https://www.rnbo.gov.ua/files/2023_YEAR/CYBERCENTER/november/APT29%20attacks%20Embassies%20using%20CVE-2023-38831%20-%20report%20en.pdf
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection
    selection:
        DestinationHostname|endswith:
          - .ngrok-free.app
          - .ngrok-free.dev
          - .ngrok.app
          - .ngrok.dev
          - .ngrok.io
        Initiated: "true"
falsepositives: Legitimate use of ngrok domains
level: high
customer: 'demo'
modified: 2023/11/17
tags:
  - attack.exfiltration
  - attack.t1567.001
  - DEMO
