
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Tomcat WebServer Logs Deleted
id: 270185ff-5f50-4d6d-a27f-24c3b8c9fef8
status: test
description: Detects the deletion of tomcat WebServer logs which may indicate an attempt
    to destroy forensic evidence
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/02/16 13:34:51
references:
  - Internal Research
  - https://linuxhint.com/view-tomcat-logs-windows/
logsource:
    category: file_delete
    product: windows
detection:
    condition: selection
    selection:
        TargetFilename|contains:
          - catalina.
          - _access_log.
          - localhost.
        TargetFilename|contains|all:
          - \Tomcat
          - \logs\
falsepositives:
  - During uninstallation of the tomcat server
  - During log rotation
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1070
  - DEMO
