
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: IIS WebServer Access Logs Deleted
id: 3eb8c339-a765-48cc-a150-4364c04652bf
status: test
description: Detects the deletion of IIS WebServer access logs which may indicate
    an attempt to destroy forensic evidence
author: Tim Rauch (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/16 14:14:41
references:
  - https://www.elastic.co/guide/en/security/current/webserver-access-logs-deleted.html
logsource:
    category: file_delete
    product: windows
detection:
    condition: selection
    selection:
        TargetFilename|contains: \inetpub\logs\LogFiles\
        TargetFilename|endswith: .log
falsepositives:
  - During uninstallation of the IIS service
  - During log rotation
level: medium
customer: 'demo'
modified: 2023/02/15
tags:
  - attack.defense_evasion
  - attack.t1070
  - DEMO
