
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: File Deleted Via Sysinternals SDelete
id: 6ddab845-b1b8-49c2-bbf7-1a11967f64bc
status: test
description: Detects the deletion of files by the Sysinternals SDelete utility. It
    looks for the common name pattern used to rename files.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/05/02 15:38:01
references:
  - https://github.com/OTRF/detection-hackathon-apt29/issues/9
  - https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/4.B.4_83D62033-105A-4A02-8B75-DAB52D8D51EC.md
logsource:
    category: file_delete
    product: windows
detection:
    condition: selection and not 1 of filter_*
    filter_wireshark:
        TargetFilename|endswith: \Wireshark\radius\dictionary.alcatel-lucent.aaa
    selection:
        TargetFilename|endswith:
          - .AAA
          - .ZZZ
falsepositives: Legitime usage of SDelete
level: medium
customer: 'demo'
modified: 2023/02/15
tags:
  - attack.defense_evasion
  - attack.t1070.004
  - DEMO
