title: Remote Thread Creation From Files In AppData Root Dirs
id: d665a40d-b1b1-4732-9b3a-c1b629260b15
status: test
description: Detects creation of remote threads from suspicious files inside of the appdata subfolders first level. Usually appdata stores binaries or other files inside of folders and not on at the root of the subfolder. A file placed at the root of the appdata subfolders could be indicative of suspicious activity
references:
    - Internal Research
author: Nasreddine Bencherchali
date: 2022/08/11
modified: 2023/03/29
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1055.003
logsource:
    product: windows
    category: create_remote_thread
detection:
    selection:
        SourceImage|re: '([Pp]rogram[Dd]ata|\\[Aa]pp[Dd]ata\\([Ll]ocal|[Rr]oaming|[Ll]ocal[Ll]ow))\\[^\\]{1,26}\.(EXE|exe|msi|MSI)$'
    condition: selection
falsepositives:
    - Unlikely
level: high
