title: PowerShell Script With Screenshot Capability
id: b96efbeb-1eb9-4b7d-bf28-9d1aaec89963
status: test
description: Detects a PowerShell script with screenshot capability. Some malicious PowerShell scripts have been seen using this as a method for exfiltration.
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/03
tags:
    - attack.defense_evasion
logsource:
    product: windows
    category: ps_script
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection:
        ScriptBlockText|contains|all:
            - 'System.Drawing.Bitmap'
            - 'System.Drawing.Graphics]::FromImage'
            - '.CopyFromScreen('
            - '.Save('
    condition: selection
falsepositives:
    - While taking screenshots can be suspicious, it can still be used legitimately. Apply addtional filters accordingly.
level: medium
