title: Setting Suspicious Powershell Cmdlet Alias Via PowerShell Script
id: 734eb6a3-b329-4772-8670-5c7c2398ce14
related:
    - id: 358f662a-f523-4ccb-9a45-b7dbdd156e18
      type: similar
status: test
description: Detects when attackers set aliases for powershell commands or cmdlet using the "new-alias" cmdlet to avoid detection based on command-line argument
references:
    - https://app.any.run/tasks/63cd5e03-647a-4f1d-81b1-9c70bb793c73/
author: Nasreddine Bencherchali
date: 2022/06/07
modified: 2023/05/31
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1059
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
    definition: Script Block Logging must be enabled
detection:
    selection_alias:
        ScriptBlockText|contains:
            - 'New-Alias '
            - ' nal '
            - 'Set-Alias '
            - ' sal '
    selection_value:
        ScriptBlockText|contains: # More variants will be added as they are discovered
            - ' -Value iex'
            - ' -Value iwr'
            - ' -Value Invoke-'
    filter:
        ScriptBlockText|contains:
            - 'Set-Alias -Name icim -Value Invoke-CimMethod -Options ReadOnly' # Generated by default when executing the Invoke-CimMethod for first time in scope
            - 'Set-Alias -Name icim -Value Invoke-CimMethod -Option ReadOnly'
    condition: all of selection* and not filter
falsepositives:
    - Unknown
level: high
