title: Execution Of PowerShell Script With AES Encryption Capability
id: 03bcfdb7-836a-47ba-abad-57287e08efde
status: test
description: Detects a PowerShell script that contains AES encryption capability. Malicious scripts often abuse this to encrypt/decrypt data during transit or at rest.
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/03
tags:
    - attack.defense_evasion
logsource:
    product: windows
    category: ps_script
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection:
        ScriptBlockText|contains: 'System.Security.Cryptography.AesManaged'
    condition: selection
falsepositives:
    - Likely
level: low
