title: PowerShell Script Leveraging MiniDumpWriteDump API
id: 3e610323-7415-46bd-90eb-0e2a60c61afe
status: test
description: Detects PowerShell script that leverage the MiniDumpWriteDump API via the WindowsErrorReporting Assembly native methods
author: Nasreddine Bencherchali
references:
    - https://github.com/rvrsh3ll/Misc-Powershell-Scripts/blob/6f23bb41f9675d7e2d32bacccff75e931ae00554/OfficeMemScraper.ps1
date: 2022/10/29
modified: 2023/03/29
tags:
    - attack.execution
    - attack.defense_evasion
logsource:
    product: windows
    category: ps_script
    definition: Script Block Logging must be enabled
detection:
    selection:
        ScriptBlockText|contains|all:
            - 'System.Management.Automation.WindowsErrorReporting'
            - 'NativeMethods'
            - 'MiniDumpWriteDump'
    condition: selection
falsepositives:
    - Unknown
level: high
