title: Disable Process Mitigation PowerShell
id: e7461ed8-13ad-4a4c-8cff-423574f61ade
status: test
description: Detects usage of the Set-ProcessMitigation cmdlet to disable process mitigation.
date: 2022/05/20
modified: 2023/03/29
references:
    - https://docs.microsoft.com/th-th/powershell/module/processmitigations/set-processmitigation?view=windowsserver2019-ps
    - https://docs.microsoft.com/en-us/powershell/module/processmitigations/set-processmitigation?view=windowsserver2022-ps
author: Nasreddine Bencherchali
tags:
    - attack.defense_evasion
logsource:
    product: windows
    category: ps_script
    definition: Script Block Logging must be enabled
detection:
    selection_cmdlet:
        ScriptBlockText|contains: 'Set-ProcessMitigation '
    selection_params_disable:
        ScriptBlockText|contains:
            - ' -Disable '
            - ' -d '
    selection_params_system:
        ScriptBlockText|contains:
            - ' -System '
            - ' -s '
    condition: all of selection*
falsepositives:
    - Unknown
level: high
