title: New Process Created In Context Of AppX Package - PsScript
id: 420d6631-aebd-4590-8c0e-2d63140bc1f9
related:
    - id: 87506372-81e5-4ecd-9038-1019d5517a1c
      type: similar
status: experimental
description: Detects the usage of the "Invoke-CommandInDesktopPackage" cmdlet to spawn processes in the context of an AppX package. In order to gain access to it's virtualized file system and registry
references:
    - https://learn.microsoft.com/en-us/powershell/module/appx/invoke-commandindesktoppackage?view=windowsserver2022-ps
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/01
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - 'Invoke-CommandInDesktopPackage '
            - ' -Command '
            - ' -PackageFamilyName '
            - ' -AppId '
    condition: selection
falsepositives:
    - Legitimate usage for debugging purposes
level: medium
