title: Suspicious Function Lookup Via GAC - ScriptBlock
id: 6cd37c58-cece-4c99-9363-4ce16c6cb9f8
related:
    - id: 9553e0ae-8a4d-4e39-b0a4-9139e40ed7bf
      type: similar
status: test
description: Detects suspicious function lookup via GlobalAssemblyCache (GAC) enumeration
references:
    - https://learn.microsoft.com/en-gb/dotnet/api/system.reflection.assembly.gettype?view=net-7.0
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/03
tags:
    - attack.defense_evasion
logsource:
    product: windows
    category: ps_script
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection:
        ScriptBlockText|contains|all:
            - 'CurrentDomain.GetAssemblies()'
            - '$_.GlobalAssemblyCache'
            - 'GetType('
            - '.Equals'
    condition: selection
falsepositives:
    - Unknown
level: high
