title: Base64 .NET Assembly In-Memory Execution
id: 719c6902-71ed-4565-9c53-019faa08d09e
status: test
description: Detects a PowerShell script that decodes a base64 encoded assembly and loads it in memory
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/03
tags:
    - attack.defense_evasion
logsource:
    product: windows
    category: ps_script
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection:
        ScriptBlockText|contains|all:
            - '::FromBase64String'
            - '[Reflection.Assembly]::Load('
            - '.EntryPoint.Invoke('
    condition: selection
falsepositives:
    - Unknown
level: high
