title: C2 - ReverseTCPShell Obfuscated Payload - ScriptBlock Logging
id: 29ca56bf-7b18-477d-8e47-e94e1273531b
status: test
description: Detects obfuscated PowerShell payload used by ReverseTCPShell C2 via PowerShell ScriptBlock logging
references:
    - https://github.com/ZHacker13/ReverseTCPShell
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/03
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection_ascii:
        ScriptBlockText|contains|all:
            - 'IEX(-Join(('
            - ')|%{[ChAr]$_}));ExiT'
    selection_b64:
        ScriptBlockText|contains|all:
            - '[Text.Encoding]::ASCII.GetString([Convert]::FromBase64String(([Text.Encoding]::ASCII.GetString(([Text.Encoding]::ASCII.GetBytes'
            - '{Get-Random -SetSeed '
            - '}))))));exit'
    selection_bxor:
        ScriptBlockText|contains|all:
            - 'IEX(-Join(('
            - '%{[CHAR]($_-bXor'
            - ')}));exit'
    condition: 1 of selection_*
falsepositives:
    - Unlikely
level: high
