title: Hoaxshell Encoded Payload - PowerShell
id: 4ee6b667-1e91-42eb-a70d-d5a252766c72
related:
    - id: 370eaf52-9cd2-402d-a87a-0150e09720f9
      type: similar
status: test
description: Detects the encoded payload of hoaxshell, an unconventional Windows reverse shell via PowerShell scriptblock logging
author: Nasreddine Bencherchali
references:
    - https://github.com/t3l3machus/hoaxshell/
date: 2022/10/20
modified: 2023/03/29
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1059
logsource:
    product: windows
    category: ps_script
    definition: Script Block Logging must be enabled
detection:
    selection_1:
        ScriptBlockText|contains:
            # ($e+$r)
            - "KAAkAGUAKwAkAHIAKQ"
            - "gAJABlACsAJAByACkA"
            - "oACQAZQArACQAcgApA"
    selection_2:
        ScriptBlockText|contains:
            # -ErrorAction Stop -ErrorVariable e
            - "LQBFAHIAcgBvAHIAQQBjAHQAaQBvAG4AIABTAHQAbwBwACAALQBFAHIAcgBvAHIAVgBhAHIAaQBhAGIAbABlACAAZQ"
            - "0ARQByAHIAbwByAEEAYwB0AGkAbwBuACAAUwB0AG8AcAAgAC0ARQByAHIAbwByAFYAYQByAGkAYQBiAGwAZQAgAGUA"
            - "tAEUAcgByAG8AcgBBAGMAdABpAG8AbgAgAFMAdABvAHAAIAAtAEUAcgByAG8AcgBWAGEAcgBpAGEAYgBsAGUAIABlA"
    condition: all of selection_*
falsepositives:
    - Unlikely
level: high
