title: Suspicious PowerShell Script Obfuscation Patterns - ScriptBlock
id: c41216df-49cd-4bb3-b277-9b69e13d3cf0
related:
    - id: 193c460a-bc85-4386-ad75-7a1d004b57b4
      type: similar
status: test
description: Detects possible obfuscated powershell scripts
author: Nasreddine Bencherchali
references:
    - https://github.com/S3cur3Th1sSh1t/Creds/blob/master/obfuscatedps/
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/shuckworm-russia-ukraine-military
    - https://amsi.fail/
date: 2022/05/27
modified: 2023/06/19
tags:
    - attack.defense_evasion
logsource:
    product: windows
    category: ps_script
    definition: Script Block Logging must be enabled
detection:
    selection:
        ScriptBlockText|contains:
            - '::join('''
            - '([byte]0x'
            - '[Byte[]] '
            - '[char]65' # A
            - '[char]97' # a
            - ']-Join'''
            - ']-Join""'
            - ']65+['
            - '{0}{2}{3}'
            - '{0}{3}{2}'
            - '{1}{2}{3}'
            - '{1}{3}{2}'
            - '{1}{4}'
            - '{2}{1}{3}'
            - '{2}{3}{0}'
            - '{2}{3}{1}'
            - '{3}{1}{2}'
            - '{3}{2}{1}'
            - '{4}{1}'
            - '{4}{2}{1}'
            - '{4}{2}{5}'
            - '+[char]('
            - '$_-bXoR'
            - 'Ãmsí'
            - "$(('â"
            - "$(('ä"
            - "$(('ã"
    condition: selection
falsepositives:
    - Unknown
level: medium
