
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DNS Query Request By Regsvr32.EXE
id: 36e037c4-c228-4866-b6a3-48eb292b9955
related:
  - type: derived
    id: c7e91a02-d771-4a6d-a700-42587e0b1095
status: test
description: Detects DNS queries initiated by "Regsvr32.exe"
author: Dmitriy Lifanov, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/25 13:51:31
references:
  - https://pentestlab.blog/2017/05/11/applocker-bypass-regsvr32/
  - https://oddvar.moe/2017/12/13/applocker-case-study-how-insecure-is-it-really-part-1/
logsource:
    category: dns_query
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith: \regsvr32.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/09/18
tags:
  - attack.execution
  - attack.t1559.001
  - attack.defense_evasion
  - attack.t1218.010
  - DEMO
