
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: AppX Package Installation Attempts Via AppInstaller.EXE
id: 7cff77e1-9663-46a3-8260-17f2e1aa9d0a
related:
  - type: derived
    id: 180c7c5c-d64b-4a63-86e9-68910451bc8b
status: test
description: |
    Detects DNS queries made by "AppInstaller.EXE". The AppInstaller is the default handler for the "ms-appinstaller" URI. It attempts to load/install a package from the referenced URL
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/11/24 20:14:41
references:
  - https://twitter.com/notwhickey/status/1333900137232523264
  - https://lolbas-project.github.io/lolbas/Binaries/AppInstaller/
logsource:
    category: dns_query
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith: \AppInstaller.exe
        Image|startswith: C:\Program Files\WindowsApps\Microsoft.DesktopAppInstaller_
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/11/09
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
