
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Diamond Sleet APT DNS Communication Indicators
id: fba38e0f-4607-4344-bb8f-a4b50cdeef7f
status: experimental
description: Detects DNS queries related to Diamond Sleet APT activity
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/24 17:45:31
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
logsource:
    category: dns_query
    product: windows
detection:
    condition: selection
    selection:
        QueryName|contains:
          - 3dkit.org
          - dersmarketim.com
          - galerielamy.com
          - olidhealth.com
falsepositives: Might generate some false positive if triggered by a user during investigation
    for example.
level: high
customer: 'demo'
tags:
  - attack.command_and_control
  - detection.emerging_threats
  - DEMO
