
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: CodeIntegrity - Unmet WHQL Requirements For Loaded Kernel Module
id: 2f8cd7a0-9d5a-4f62-9f8b-2c951aa0dd1f
status: experimental
description: Detects loaded kernel modules that did not meet the WHQL signing requirements.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/06 22:17:11
references:
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/event-id-explanations
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/event-tag-explanations
  - Internal Research
logsource:
    product: windows
    service: codeintegrity-operational
detection:
    condition: selection and not 1 of filter_optional_*
    filter_optional_vmware:
        FileNameBuffer:
          - system32\drivers\vsock.sys
          - System32\drivers\vmci.sys
    selection:
        EventID:
          - "3082"
          - "3083"
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/06/14
tags:
  - attack.privilege_escalation
  - DEMO
