
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Grafana Path Traversal Exploitation CVE-2021-43798
id: 7b72b328-5708-414f-9a2a-6a6867c26e16
status: test
description: Detects a successful Grafana path traversal exploitation
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/08 17:43:31
references:
  - https://grafana.com/blog/2021/12/07/grafana-8.3.1-8.2.7-8.1.8-and-8.0.7-released-with-high-severity-security-fix/
  - https://github.com/search?q=CVE-2021-43798
logsource:
    category: webserver
detection:
    condition: all of selection*
    selection_plugins:
        cs-uri-query|contains:
          - /public/plugins/live
          - /public/plugins/icon
          - /public/plugins/loki
          - /public/plugins/text
          - /public/plugins/logs
          - /public/plugins/news
          - /public/plugins/stat
          - /public/plugins/mssql
          - /public/plugins/mixed
          - /public/plugins/mysql
          - /public/plugins/tempo
          - /public/plugins/graph
          - /public/plugins/gauge
          - /public/plugins/table
          - /public/plugins/debug
          - /public/plugins/zipkin
          - /public/plugins/jaeger
          - /public/plugins/geomap
          - /public/plugins/canvas
          - /public/plugins/grafana
          - /public/plugins/welcome
          - /public/plugins/xychart
          - /public/plugins/heatmap
          - /public/plugins/postgres
          - /public/plugins/testdata
          - /public/plugins/opentsdb
          - /public/plugins/influxdb
          - /public/plugins/barchart
          - /public/plugins/annolist
          - /public/plugins/bargauge
          - /public/plugins/graphite
          - /public/plugins/dashlist
          - /public/plugins/piechart
          - /public/plugins/dashboard
          - /public/plugins/nodeGraph
          - /public/plugins/alertlist
          - /public/plugins/histogram
          - /public/plugins/table-old
          - /public/plugins/pluginlist
          - /public/plugins/timeseries
          - /public/plugins/cloudwatch
          - /public/plugins/prometheus
          - /public/plugins/stackdriver
          - /public/plugins/alertGroups
          - /public/plugins/alertmanager
          - /public/plugins/elasticsearch
          - /public/plugins/gettingstarted
          - /public/plugins/state-timeline
          - /public/plugins/status-history
          - /public/plugins/grafana-clock-panel
          - /public/plugins/grafana-simple-json-datasource
          - /public/plugins/grafana-azure-monitor-datasource
    selection_traversal:
        cs-uri-query|contains: /../../../../../../../
        sc-status: "200"
fields:
  - c-ip
  - c-dns
falsepositives: Vulnerability scanners that scan a host that returns 200 status codes
    even in cases of a file not found or other error
level: critical
customer: 'demo'
modified: 2023/01/02
tags:
  - attack.initial_access
  - attack.t1190
  - cve.2021.43798
  - detection.emerging_threats
  - DEMO
