
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Server Side Template Injection Strings
id: ada3bc4f-f0fd-42b9-ba91-e105e8af7342
status: test
description: Detects SSTI attempts sent via GET requests in access logs
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/14 16:08:51
references:
  - https://book.hacktricks.xyz/pentesting-web/ssti-server-side-template-injection
  - https://github.com/payloadbox/ssti-payloads
logsource:
    category: webserver
detection:
    condition: select_method and keywords and not filter
    filter:
        sc-status: "404"
    keywords:
      - ={{
      - =%7B%7B
      - =${
      - =$%7B
      - =<%=
      - =%3C%25=
      - =@(
      - freemarker.template.utility.Execute
      - .getClass().forName('javax.script.ScriptEngineManager')
      - T(org.apache.commons.io.IOUtils)
    select_method:
        cs-method: GET
falsepositives:
  - User searches in search boxes of the respective website
  - Internal vulnerability scanners can cause some serious FPs when used, if you experience
    a lot of FPs due to this think of adding more filters such as "User Agent" strings
    and more response codes
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1221
  - DEMO
