
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: ProxyLogon Reset Virtual Directories Based On IIS Log
id: effee1f6-a932-4297-a81f-acb44064fa3a
status: test
description: When exploiting this vulnerability with CVE-2021-26858, an SSRF attack
    is used to manipulate virtual directories
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/10 19:32:31
references:
  - https://bi-zone.medium.com/hunting-down-ms-exchange-attacks-part-1-proxylogon-cve-2021-26855-26858-27065-26857-6e885c5f197c
logsource:
    category: webserver
    definition: 'Requirements: The POST request body data must be collected in order
        to make use of this detection'
detection:
    condition: selection or keywords
    keywords:
        '|all':
          - POST
          - "200"
          - /ecp/DDI/DDIService.svc/SetObject
          - schema=Reset
          - VirtualDirectory
          - $
    selection:
        cs-method: POST
        cs-uri-query|contains|all:
          - schema=Reset
          - VirtualDirectory
        cs-uri-stem: /ecp/DDI/DDIService.svc/SetObject
        cs-username|endswith: $
        sc-status: "200"
falsepositives: Unlikely
level: critical
customer: 'demo'
modified: 2023/05/08
tags:
  - cve.2021.26858
  - detection.emerging_threats
  - attack.initial_access
  - attack.t1190
  - DEMO
