
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DEWMODE Webshell Access
id: fdf96c90-42d5-4406-8a9c-14a2c9a016b5
status: test
description: Detects access to DEWMODE webshell as described in FIREEYE report
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/02/22 11:32:51
references:
  - https://www.mandiant.com/resources/blog/accellion-fta-exploited-for-data-theft-and-extortion
logsource:
    category: webserver
detection:
    condition: 1 of selection*
    selection1:
        cs-uri-query|contains|all:
          - ?dwn=
          - '&fn='
          - .html?
    selection2:
        cs-uri-query|contains|all:
          - '&dwn='
          - ?fn=
          - .html?
fields:
  - client_ip
  - response
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/02
tags:
  - attack.persistence
  - attack.t1505.003
  - detection.emerging_threats
  - DEMO
