
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Okta User Session Start Via An Anonymising Proxy Service
id: bde30855-5c53-4c18-ae90-1ff79ebc9578
status: experimental
description: Detects when an Okta user session starts where the user is behind an
    anonymising proxy service.
author: kelnage
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/09/07 20:31:41
references:
  - https://developer.okta.com/docs/reference/api/system-log/
  - https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
logsource:
    product: okta
    service: okta
detection:
    condition: selection
    selection:
        eventtype: user.session.start
        securitycontext.isproxy: "true"
falsepositives: If a user requires an anonymising proxy due to valid justifications.
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1562.006
  - DEMO
