
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Okta Password in AlternateID Field
id: 91b76b84-8589-47aa-9605-c837583b82a9
status: experimental
description: |
    Detects when a user has potentially entered their password into the
    username field, which will cause the password to be retained in log files.
author: kelnage
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/03 17:27:01
references:
  - https://developer.okta.com/docs/reference/api/system-log/
  - https://www.mitiga.io/blog/how-okta-passwords-can-be-compromised-uncovering-a-risk-to-user-data
  - https://help.okta.com/en-us/Content/Topics/users-groups-profiles/usgp-create-character-restriction.htm
logsource:
    product: okta
    service: okta
detection:
    condition: selection and not filter_main
    filter_main:
        actor.alternateid|re: (^0oa.*|[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,10})
    selection:
        legacyeventtype: core.user_auth.login_failed
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/10/25
tags:
  - attack.credential_access
  - attack.t1552
  - DEMO
