
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Okta New Admin Console Behaviours
id: a0b38b70-3cb5-484b-a4eb-c4d8e7bcc0a9
status: experimental
description: Detects when Okta identifies new activity in the Admin Console.
author: kelnage
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/09/07 14:34:11
references:
  - https://developer.okta.com/docs/reference/api/system-log/
  - https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
logsource:
    product: okta
    service: okta
detection:
    condition: selection
    selection:
        debugcontext.debugdata.behaviors: POSITIVE
        debugcontext.debugdata.logonlysecuritydata: POSITIVE
        eventtype: policy.evaluate_sign_on
        target.displayname: Okta Admin Console
falsepositives: Whenever an admin starts using new features of the admin console.
level: low
customer: 'demo'
modified: 2023/10/25
tags:
  - attack.initial_access
  - attack.t1078.004
  - DEMO
