
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Execution via macOS Script Editor
id: 6e4dcdd1-e48b-42f7-b2d8-3b413fc58cb4
status: test
description: Detects when the macOS Script Editor utility spawns an unusual child
    process.
author: Tim Rauch (rule), Elastic (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/21 17:43:01
references:
  - https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-7f541fbc4a4a28a92970e8bf53effea5bd934604429112c920affb457f5b2685
  - https://wojciechregula.blog/post/macos-red-teaming-initial-access-via-applescript-url/
logsource:
    category: process_creation
    product: macos
detection:
    condition: all of selection_*
    selection_img:
      - Image|endswith:
          - /curl
          - /bash
          - /sh
          - /zsh
          - /dash
          - /fish
          - /osascript
          - /mktemp
          - /chmod
          - /php
          - /nohup
          - /openssl
          - /plutil
          - /PlistBuddy
          - /xattr
          - /sqlite
          - /funzip
          - /popen
      - Image|contains:
          - python
          - perl
    selection_parent:
        ParentImage|endswith: /Script Editor
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/12/28
tags:
  - attack.t1566
  - attack.t1566.002
  - attack.initial_access
  - attack.t1059
  - attack.t1059.002
  - attack.t1204
  - attack.t1204.001
  - attack.execution
  - attack.persistence
  - attack.t1553
  - attack.defense_evasion
  - DEMO
