
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: JAMF MDM Potential Suspicious Child Process
id: 2316929c-01aa-438c-970f-099145ab1ee6
status: experimental
description: Detects potential suspicious child processes of "jamf". Could be a sign
    of potential abuse of Jamf as a C2 server as seen by Typhon MythicAgent.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/22 16:51:41
references:
  - https://github.com/MythicAgents/typhon/
  - https://www.zoocoup.org/casper/jamf_cheatsheet.pdf
  - https://docs.jamf.com/10.30.0/jamf-pro/administrator-guide/Components_Installed_on_Managed_Computers.html
logsource:
    category: process_creation
    product: macos
detection:
    condition: selection
    selection:
        Image|endswith:
          - /bash
          - /sh
        ParentImage|endswith: /jamf
falsepositives: Legitimate execution of custom scripts or commands by Jamf administrators.
    Apply additional filters accordingly
level: medium
customer: 'demo'
tags:
  - attack.execution
  - DEMO
