
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious History File Operations
id: 508a9374-ad52-4789-b568-fc358def2c65
status: test
description: Detects commandline operations on shell history files
author: Mikhail Larin, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/17 15:22:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.003/T1552.003.md
logsource:
    category: process_creation
    product: macos
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - .bash_history
          - .zsh_history
          - .zhistory
          - .history
          - .sh_history
          - fish_history
falsepositives:
  - Legitimate administrative activity
  - Legitimate software, cleaning hist file
level: medium
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.credential_access
  - attack.t1552.003
  - DEMO
