
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: User Added To Admin Group Via DseditGroup
id: 5d0fdb62-f225-42fb-8402-3dfe64da468a
status: experimental
description: Detects attempts to create and/or add an account to the admin group,
    thus granting admin privileges.
author: Sohan G (D4rkCiph3r)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/22 16:16:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1078.003/T1078.003.md#atomic-test-5---add-a-newexisting-user-to-the-admin-group-using-dseditgroup-utility---macos
  - https://ss64.com/osx/dseditgroup.html
logsource:
    category: process_creation
    product: macos
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - ' -o edit '
          - ' -a '
          - ' -t user'
          - admin
        Image|endswith: /dseditgroup
falsepositives: Legitimate administration activities
level: medium
customer: 'demo'
tags:
  - attack.initial_access
  - attack.privilege_escalation
  - attack.t1078.003
  - DEMO
