
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Macos Remote System Discovery
id: 10227522-8429-47e6-a301-f2b2d014e7ad
status: test
description: Detects the enumeration of other remote systems.
author: Alejandro Ortuno, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/22 13:48:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md
logsource:
    category: process_creation
    product: macos
detection:
    condition: 1 of selection*
    selection_1:
        CommandLine|contains: -a
        Image|endswith: /arp
    selection_2:
        CommandLine|contains:
          - ' 10.'
          - ' 192.168.'
          - ' 172.16.'
          - ' 172.17.'
          - ' 172.18.'
          - ' 172.19.'
          - ' 172.20.'
          - ' 172.21.'
          - ' 172.22.'
          - ' 172.23.'
          - ' 172.24.'
          - ' 172.25.'
          - ' 172.26.'
          - ' 172.27.'
          - ' 172.28.'
          - ' 172.29.'
          - ' 172.30.'
          - ' 172.31.'
          - ' 127.'
          - ' 169.254.'
        Image|endswith: /ping
falsepositives: Legitimate administration activities
level: informational
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.discovery
  - attack.t1018
  - DEMO
