
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Installer Package Child Process
id: e0cfaecd-602d-41af-988d-f6ccebb2af26
status: test
description: Detects the execution of suspicious child processes from macOS installer
    package parent process. This includes osascript, JXA, curl and wget amongst other
    interpreters
author: Sohan G (D4rkCiph3r)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/02/18 17:15:21
references:
  - https://redcanary.com/blog/clipping-silver-sparrows-wings/
  - https://github.com/elastic/detection-rules/blob/4312d8c9583be524578a14fe6295c3370b9a9307/rules/macos/execution_installer_package_spawned_network_event.toml
logsource:
    category: process_creation
    product: macos
detection:
    condition: selection_installer
    selection_installer:
        CommandLine|contains:
          - preinstall
          - postinstall
        Image|endswith:
          - /sh
          - /bash
          - /dash
          - /python
          - /ruby
          - /perl
          - /php
          - /javascript
          - /osascript
          - /tclsh
          - /curl
          - /wget
        ParentImage|endswith:
          - /package_script_service
          - /installer
falsepositives: Legitimate software uses the scripts (preinstall, postinstall)
level: medium
customer: 'demo'
tags:
  - attack.t1059
  - attack.t1059.007
  - attack.t1071
  - attack.t1071.001
  - attack.execution
  - attack.command_and_control
  - DEMO
