
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential In-Memory Download And Compile Of Payloads
id: 13db8d2e-7723-4c2c-93c1-a4d36994f7ef
status: experimental
description: Detects potential in-memory downloading and compiling of applets using
    curl and osacompile as seen used by XCSSET malware
author: Sohan G (D4rkCiph3r), Red Canary (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/22 19:23:11
references:
  - https://redcanary.com/blog/mac-application-bundles/
logsource:
    category: process_creation
    product: macos
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - osacompile
          - curl
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.command_and_control
  - attack.execution
  - attack.t1059.007
  - attack.t1105
  - DEMO
