
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: JXA In-memory Execution Via OSAScript
id: f1408a58-0e94-4165-b80a-da9f96cf6fc3
related:
  - type: derived
    id: 1bc2e6c5-0885-472b-bed6-be5ea8eace55
status: test
description: Detects possible malicious execution of JXA in-memory via OSAScript
author: Sohan G (D4rkCiph3r)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/31 15:16:41
references:
  - https://redcanary.com/blog/applescript/
logsource:
    category: process_creation
    product: macos
detection:
    condition: all of selection_*
    selection_js:
      - CommandLine|contains|all:
          - ' -l '
          - JavaScript
      - CommandLine|contains: .js
    selection_main:
        CommandLine|contains|all:
          - osascript
          - ' -e '
          - eval
          - NSData.dataWithContentsOfURL
fields:
  - CommandLine
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.t1059.002
  - attack.t1059.007
  - attack.execution
  - DEMO
