
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Github Push Protection Disabled
id: ccd55945-badd-4bae-936b-823a735d37dd
status: experimental
description: Detects if the push protection feature is disabled for an organization,
    enterprise, repositories or custom pattern rules.
author: Muhammad Faisal (@faisalusuf)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/03/07 14:16:21
references:
  - https://docs.github.com/en/enterprise-cloud@latest/code-security/secret-scanning/push-protection-for-repositories-and-organizations
  - https://thehackernews.com/2024/03/github-rolls-out-default-secret.html
logsource:
    product: github
    service: audit
    definition: 'Requirements: The audit log streaming feature must be enabled to
        be able to receive such logs. You can enable following the documentation here:
        https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
    condition: selection
    selection:
        action:
          - business_secret_scanning_custom_pattern_push_protection.disabled
          - business_secret_scanning_push_protection.disable
          - business_secret_scanning_push_protection.disabled_for_new_repos
          - org.secret_scanning_custom_pattern_push_protection_disabled
          - org.secret_scanning_push_protection_disable
          - org.secret_scanning_push_protection_new_repos_disable
          - repository_secret_scanning_custom_pattern_push_protection.disabled
falsepositives: Allowed administrative activities.
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - DEMO
