
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Remote Desktop Connection to Non-Domain Host
id: ce5678bb-b9aa-4fb5-be4b-e57f686256ad
status: test
description: Detects logons using NTLM to hosts that are potentially not part of the
    domain.
author: James Pemberton
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/05/22 20:11:51
references:
  - n/a
logsource:
    product: windows
    service: ntlm
    definition: Requires events from Microsoft-Windows-NTLM/Operational
detection:
    condition: selection
    selection:
        EventID: "8001"
        TargetName|startswith: TERMSRV
fields:
  - Computer
  - UserName
  - DomainName
  - TargetName
falsepositives:
  - Host connections to valid domains, exclude these.
  - Host connections not using host FQDN.
  - Host connections to external legitimate domains.
level: medium
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.command_and_control
  - attack.t1219
  - DEMO
