
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: UNC4841 - Barracuda ESG Exploitation Indicators
id: 5627c337-a9b2-407a-a82d-5fd97035ff39
status: experimental
description: Detects file indicators as seen used by UNC4841 during their Barracuda
    ESG zero day exploitation.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/16 17:21:21
references:
  - https://www.mandiant.com/resources/blog/barracuda-esg-exploited-globally
logsource:
    category: file_event
    product: linux
detection:
    condition: selection
    selection:
        TargetFilename|endswith:
          - /11111.tar
          - /aacore.sh
          - /appcheck.sh
          - /autoins
          - /BarracudaMailService
          - /etc/cron.daily/core_check.sh
          - /etc/cron.daily/core.sh
          - /etc/cron.hourly/aacore.sh
          - /etc/cron.hourly/appcheck.sh
          - /etc/cron.hourly/core.sh
          - /get_fs_info.pl
          - /imgdata.jpg
          - /install_att_v2.tar
          - /install_bvp74_auth.tar
          - /install_helo.tar
          - /install_reuse.tar
          - /intent_helo
          - /intent_reuse
          - /intentbas
          - /mknod
          - /mod_attachment.lua
          - /mod_content.lua
          - /mod_require_helo.lua
          - /mod_rtf
          - /mod_sender.lua
          - /mod_udp.so
          - /nfsd_stub.ko
          - /resize_reisertab
          - /resize_risertab
          - /resize2fstab
          - /rverify
          - /saslautchd
          - /sendscd
          - /snapshot.tar
          - /tmp/p
          - /tmp/p7
          - /tmp/t
          - /update_v2.sh
          - /update_v31.sh
          - /update_v35.sh
          - /update_version
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.execution
  - attack.persistence
  - attack.defense_evasion
  - detection.emerging_threats
  - DEMO
