
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Persistence Via Cron Files
id: 6c4e2f43-d94d-4ead-b64d-97e53fa2bd05
status: test
description: Detects creation of cron file or files in Cron directories which could
    indicates potential persistence.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/10/15 12:47:01
references:
  - https://github.com/microsoft/MSTIC-Sysmon/blob/f1477c0512b0747c1455283069c21faec758e29d/linux/configs/attack-based/persistence/T1053.003_Cron_Activity.xml
logsource:
    category: file_event
    product: linux
detection:
    condition: 1 of selection*
    selection1:
        TargetFilename|startswith:
          - /etc/cron.d/
          - /etc/cron.daily/
          - /etc/cron.hourly/
          - /etc/cron.monthly/
          - /etc/cron.weekly/
          - /var/spool/cron/crontabs/
    selection2:
        TargetFilename|contains:
          - /etc/cron.allow
          - /etc/cron.deny
          - /etc/crontab
falsepositives: Any legitimate cron file.
level: medium
customer: 'demo'
modified: 2022/12/31
tags:
  - attack.persistence
  - attack.t1053.003
  - DEMO
