
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Uncommon New Firewall Rule Added In Windows Firewall Exception List
id: cde0a575-7d3d-4a49-9817-b8004a7bf105
status: experimental
description: Detects when a rule has been added to the Windows Firewall exception
    list
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/19 23:18:51
references:
  - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
logsource:
    product: windows
    service: firewall-as
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_block:
        Action: "2"
    filter_main_covered_paths:
        ApplicationPath|contains:
          - :\PerfLogs\
          - :\Temp\
          - :\Users\Public\
          - :\Windows\Tasks\
          - :\Windows\Temp\
          - \AppData\Local\Temp\
    filter_main_generic:
        ApplicationPath|contains:
          - :\Program Files (x86)\
          - :\Program Files\
          - :\Windows\System32\
          - :\Windows\SysWOW64\
          - :\Windows\WinSxS\
    filter_optional_msmpeng:
        ModifyingApplication|contains|all:
          - :\ProgramData\Microsoft\Windows Defender\Platform\
          - \MsMpEng.exe
    selection:
        EventID:
          - "2004"
          - "2071"
level: medium
customer: 'demo'
modified: 2023/09/09
tags:
  - attack.defense_evasion
  - attack.t1562.004
  - DEMO
