
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: OneLogin User Account Locked
id: a717c561-d117-437e-b2d9-0118a7035d01
status: test
description: Detects when an user account is locked or suspended.
author: Austin Songer @austinsonger
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/10/12 13:16:11
references:
  - https://developers.onelogin.com/api-docs/1/events/event-resource/
logsource:
    product: onelogin
    service: onelogin.events
detection:
    condition: 1 of selection*
    selection1:
        event_type_id: "532"
    selection2:
        event_type_id: "553"
    selection3:
        event_type_id: "551"
falsepositives: System may lock or suspend user accounts.
level: low
customer: 'demo'
modified: 2022/12/25
tags:
  - attack.impact
  - DEMO
