
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Veeam Backup Servers Credential Dumping Script Execution
id: 976d6e6f-a04b-4900-9713-0134a353e38b
status: experimental
description: Detects execution of a PowerShell script that contains calls to the "Veeam.Backup"
    class, in order to dump stored credentials.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/04 20:51:41
references:
  - https://www.pwndefend.com/2021/02/15/retrieving-passwords-from-veeam-backup-servers/
  - https://labs.withsecure.com/publications/fin7-target-veeam-servers
logsource:
    category: ps_script
    product: windows
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    condition: selection
    selection:
        ScriptBlockText|contains|all:
          - '[Credentials]'
          - '[Veeam.Backup.Common.ProtectedStorage]::GetLocalString'
          - Invoke-Sqlcmd
          - Veeam Backup and Replication
falsepositives: Administrators backup scripts (must be investigated)
level: high
customer: 'demo'
tags:
  - attack.credential_access
  - DEMO
