
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential WinAPI Calls Via PowerShell Scripts
id: 03d83090-8cba-44a0-b02f-0b756a050306
related:
  - type: similar
    id: ba3f5c1b-6272-4119-9dbd-0bc8d21c2702
status: experimental
description: Detects use of WinAPI functions in PowerShell scripts
author: Nasreddine Bencherchali (Nextron Systems), Nikita Nazarov, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/06 17:36:41
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: 1 of selection_*
    selection_duplicate_token:
        ScriptBlockText|contains|all:
          - OpenProcessToken
          - DuplicateTokenEx
          - CloseHandle
    selection_injection:
        ScriptBlockText|contains|all:
          - VirtualAlloc
          - OpenProcess
          - WriteProcessMemory
          - CreateRemoteThread
    selection_process_write_read:
        ScriptBlockText|contains|all:
          - WriteProcessMemory
          - VirtualAlloc
          - ReadProcessMemory
          - VirtualFree
    selection_token_steal:
        ScriptBlockText|contains|all:
          - OpenProcessToken
          - LookupPrivilegeValue
          - AdjustTokenPrivileges
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/06/20
tags:
  - attack.execution
  - attack.t1059.001
  - attack.t1106
  - DEMO
