
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Malicious Nishang PowerShell Commandlets
id: f772cee9-b7c2-4cb2-8f07-49870adc02e0
status: test
description: Detects Commandlet names and arguments from the Nishang exploitation
    framework
author: Alec Costello
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/05/16 16:52:21
references:
  - https://github.com/samratashok/nishang
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: selection
    selection:
        ScriptBlockText|contains:
          - Add-ConstrainedDelegationBackdoor
          - Copy-VSS
          - Create-MultipleSessions
          - DataToEncode
          - DNS_TXT_Pwnage
          - Do-Exfiltration-Dns
          - Download_Execute
          - Download-Execute-PS
          - DownloadAndExtractFromRemoteRegistry
          - DumpCerts
          - DumpCreds
          - DumpHashes
          - Enable-DuplicateToken
          - Enable-Duplication
          - Execute-Command-MSSQL
          - Execute-DNSTXT-Code
          - Execute-OnTime
          - ExetoText
          - exfill
          - ExfilOption
          - FakeDC
          - FireBuster
          - FireListener
          - 'Get-Information '
          - Get-PassHints
          - Get-Web-Credentials
          - Get-WebCredentials
          - Get-WLAN-Keys
          - HTTP-Backdoor
          - Invoke-AmsiBypass
          - Invoke-BruteForce
          - Invoke-CredentialsPhish
          - Invoke-Decode
          - Invoke-Encode
          - Invoke-Interceptor
          - Invoke-JSRatRegsvr
          - Invoke-JSRatRundll
          - Invoke-MimikatzWDigestDowngrade
          - Invoke-NetworkRelay
          - Invoke-PowerShellIcmp
          - Invoke-PowerShellUdp
          - Invoke-Prasadhak
          - Invoke-PSGcat
          - Invoke-PsGcatAgent
          - Invoke-SessionGopher
          - Invoke-SSIDExfil
          - LoggedKeys
          - Nishang
          - NotAllNameSpaces
          - Out-CHM
          - OUT-DNSTXT
          - Out-HTA
          - Out-RundllCommand
          - Out-SCF
          - Out-SCT
          - Out-Shortcut
          - Out-WebQuery
          - Out-Word
          - Parse_Keys
          - Password-List
          - Powerpreter
          - Remove-Persistence
          - Remove-PoshRat
          - Remove-Update
          - Run-EXEonRemote
          - Set-DCShadowPermissions
          - Set-RemotePSRemoting
          - Set-RemoteWMI
          - Shellcode32
          - Shellcode64
          - StringtoBase64
          - TexttoExe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/16
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
