
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Certificate Exported Via PowerShell - ScriptBlock
id: aa7a3fce-bef5-4311-9cc1-5f04bb8c308c
related:
  - type: similar
    id: 9e716b33-63b2-46da-86a4-bd3c3b9b5dfb
status: test
description: Detects calls to cmdlets inside of PowerShell scripts that are used to
    export certificates from the local certificate store. Threat actors were seen
    abusing this to steal private keys from compromised machines.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/04/23 18:48:01
references:
  - https://us-cert.cisa.gov/ncas/analysis-reports/ar21-112a
  - https://docs.microsoft.com/en-us/powershell/module/pki/export-pfxcertificate
  - https://www.splunk.com/en_us/blog/security/breaking-the-chain-defending-against-certificate-services-abuse.html
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: selection and not 1 of filter_optional_*
    filter_optional_module_export:
        ScriptBlockText|contains: CmdletsToExport = @(
    selection:
        ScriptBlockText|contains:
          - Export-PfxCertificate
          - Export-Certificate
falsepositives: Legitimate certificate exports by administrators. Additional filters
    might be required.
level: medium
customer: 'demo'
modified: 2023/05/18
tags:
  - attack.credential_access
  - attack.t1552.004
  - DEMO
