
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Powershell Token Obfuscation - Powershell
id: f3a98ce4-6164-4dd4-867c-4d83de7eca51
related:
  - type: similar
    id: deb9b646-a508-44ee-b7c9-d8965921c6b6
status: test
description: Detects TOKEN OBFUSCATION technique from Invoke-Obfuscation
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/27 16:59:31
references:
  - https://github.com/danielbohannon/Invoke-Obfuscation
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: selection and not 1 of filter_*
    filter_chocolatey:
        ScriptBlockText|contains:
          - it will return true or false instead
          - The function also prevents `Get-ItemProperty` from failing
    filter_exchange:
        Path|endswith: \bin\servicecontrol.ps1
        Path|startswith: C:\Program Files\Microsoft\Exchange Server\
        ScriptBlockText|contains: '`r`n'
    selection:
      - ScriptBlockText|re: \w+`(\w+|-|.)`[\w+|\s]
      - ScriptBlockText|re: '"(\{\d\}){2,}"\s*-f'
      - ScriptBlockText|re: \$\{((e|n|v)*`(e|n|v)*)+:path\}|\$\{((e|n|v)*`(e|n|v)*)+:((p|a|t|h)*`(p|a|t|h)*)+\}|\$\{env:((p|a|t|h)*`(p|a|t|h)*)+\}
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/03/24
tags:
  - attack.defense_evasion
  - attack.t1027.009
  - DEMO
