
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious Call To Win32_NTEventlogFile Class - PSScript
id: e2812b49-bae0-4b21-b366-7c142eafcde2
status: experimental
description: Detects usage of the WMI class "Win32_NTEventlogFile" in a potentially
    suspicious way (delete, backup, change permissions, etc.) from a PowerShell script
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/07/13 23:25:01
references:
  - https://learn.microsoft.com/en-us/previous-versions/windows/desktop/legacy/aa394225(v=vs.85)
logsource:
    category: ps_script
    product: windows
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    condition: all of selection_*
    selection_class:
        ScriptBlockText|contains: Win32_NTEventlogFile
    selection_function:
        ScriptBlockText|contains:
          - .BackupEventlog(
          - .ChangeSecurityPermissions(
          - .ChangeSecurityPermissionsEx(
          - .ClearEventLog(
          - .Delete(
          - .DeleteEx(
          - .Rename(
          - .TakeOwnerShip(
          - .TakeOwnerShipEx(
falsepositives: Legitimate administration and backup scripts
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - DEMO
