
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Change PowerShell Policies to an Insecure Level - PowerShell
id: 61d0475c-173f-4844-86f7-f3eebae1c66b
related:
  - type: similar
    id: cf2e938e-9a3e-4fe8-a347-411642b28a9f
  - type: similar
    id: 87e3c4e8-a6a8-4ad9-bb4f-46e7ff99a180
  - type: similar
    id: fad91067-08c5-4d1a-8d8c-d96a21b37814
status: test
description: Detects changing the PowerShell script execution policy to a potentially
    insecure level using the "Set-ExecutionPolicy" cmdlet.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/10/20 21:22:11
references:
  - https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.1
  - https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_execution_policies?view=powershell-7.1
  - https://adsecurity.org/?p=2604
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: all of selection_* and not 1 of filter_optional_*
    filter_optional_chocolatey:
        ScriptBlockText|contains:
          - (New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1')
          - (New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1')
    selection_cmdlet:
        ScriptBlockText|contains: Set-ExecutionPolicy
    selection_option:
        ScriptBlockText|contains:
          - Unrestricted
          - bypass
falsepositives: Administrator script
level: medium
customer: 'demo'
modified: 2023/12/14
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
