
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Root Certificate Installed - PowerShell
id: 42821614-9264-4761-acfc-5772c3286f76
status: test
description: Adversaries may install a root certificate on a compromised system to
    avoid warnings when connecting to adversary controlled web servers.
author: oscd.community, @redcanary, Zach Stanford @svch0st
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/10 16:12:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: 1 of selection*
    selection1:
        ScriptBlockText|contains|all:
          - Move-Item
          - Cert:\LocalMachine\Root
    selection2:
        ScriptBlockText|contains|all:
          - Import-Certificate
          - Cert:\LocalMachine\Root
falsepositives: Help Desk or IT may need to manually add a corporate Root CA on occasion.
    Need to test if GPO push doesn't trigger FP
level: medium
customer: 'demo'
modified: 2022/12/02
tags:
  - attack.defense_evasion
  - attack.t1553.004
  - DEMO
