
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Service DACL Modification Via Set-Service Cmdlet - PS
id: 22d80745-6f2c-46da-826b-77adaededd74
related:
  - type: similar
    id: a95b9b42-1308-4735-a1af-abb1c5e6f5ac
status: test
description: Detects usage of the "Set-Service" powershell cmdlet to configure a new
    SecurityDescriptor that allows a service to be hidden from other utilities such
    as "sc.exe", "Get-Service"...etc. (Works only in powershell 7)
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/24 21:55:31
references:
  - https://twitter.com/Alh4zr3d/status/1580925761996828672
  - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/set-service?view=powershell-7.2
logsource:
    category: ps_script
    product: windows
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    condition: all of selection_*
    selection_sddl_flag:
        ScriptBlockText|contains:
          - '-SecurityDescriptorSddl '
          - '-sd '
    selection_set_service:
        ScriptBlockText|contains:
          - ;;;IU
          - ;;;SU
          - ;;;BA
          - ;;;SY
          - ;;;WD
        ScriptBlockText|contains|all:
          - 'Set-Service '
          - D;;
falsepositives:
  - Rare intended use of hidden services
  - Rare FP could occur due to the non linearity of the ScriptBlockText log
level: high
customer: 'demo'
tags:
  - attack.persistence
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1574.011
  - DEMO
