
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PowerShell Script With File Upload Capabilities
id: d2e3f2f6-7e09-4bf2-bc5d-90186809e7fb
status: experimental
description: Detects PowerShell scripts leveraging the "Invoke-WebRequest" cmdlet
    to send data via either "PUT" or "POST" method.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/07 18:22:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1020/T1020.md
  - https://www.w3.org/Protocols/rfc2616/rfc2616-sec9.html
  - https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/invoke-webrequest?view=powershell-7.2
logsource:
    category: ps_script
    product: windows
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    condition: all of selection_*
    selection_cmdlet:
        ScriptBlockText|contains:
          - Invoke-WebRequest
          - 'iwr '
    selection_flag:
        ScriptBlockText|contains:
          - -Method Put
          - -Method Post
falsepositives: Unknown
level: low
customer: 'demo'
modified: 2023/05/04
tags:
  - attack.exfiltration
  - attack.t1020
  - DEMO
