title: Credential Guard Disabled
id: fb53bb1c-46b4-4451-8dae-1ca1d5a088b3
status: experimental
description: Detects changes to the CredentialGuard registry key and the "Enabled" value being set to 0 in order to disable the Credential Guard feature. This allows an attacker to access secrets such as credentials stored in LSASS
references:
    - https://learn.microsoft.com/en-us/windows/security/identity-protection/credential-guard/credential-guard
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/14
modified: 2023/04/14
tags:
    - attack.defense_evasion
    - attack.t1562.001
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|endswith: '\Control\DeviceGuard\Scenarios\CredentialGuard\Enabled'
        Details: 'DWORD (0x00000000)'
    filter_main_lsass:
        Image: 'C:\Windows\system32\lsass.exe'
    condition: selection and not 1 of filter_main_*
falsepositives:
    - Unknown
level: high
