title: Registry Set Suspicious Service Binary
id: 0c4e6686-4dd2-4079-9a5f-eef969c73983
description: Detects suspicious binaries set in ImpagePath value for a new registered service or other suspicious values
status: test
date: 2022/07/05
modified: 2023/03/29
author: Florian Roth
references:
    - Internal Research
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains|all: 
            - '\CurrentControlSet\Services\'
            - 'ImagePath'
        Details|contains:
            - 'regsvr32.exe'
            - '\\cscript.exe'
            - '\\wscript.exe'
            - '\\powershell.exe'
            - '\\mshta.exe'
            - '\\certutil'
            - '&&'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
    - attack.t1562.002
