title: LSASS SilentProcessExit Set
id: 1f24c7c1-0b71-4e4e-8a6d-f863c9d8aa4a
description: Detects preparations of a method to dump LSASS through WerFault as used in NanoDump LSASS process memory dumper (and possibly other dumpers as well) - in this case the definition a SilentProcessExit parameter 
    screen
status: test
references:
    - https://github.com/helpsystems/nanodump/commit/578116faea3d278d53d70ea932e2bbfe42569507
    - https://pentestlab.blog/2020/01/13/persistence-image-file-execution-options-injection/
    - https://github.com/deepinstinct/LsassSilentProcessExit
author: Florian Roth
date: 2022/06/27
modified: 2023/03/29
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: '\Microsoft\Windows NT\CurrentVersion\SilentProcessExit\lsass.exe'
    condition: selection
falsepositives:
    - Unlikely
level: critical
tags:
    - attack.credential_access
    - attack.t1003.001
