
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: LSASS Access From Potentially White-Listed Processes
id: 4be8b654-0c01-4c9d-a10c-6b28467fc651
status: test
description: |
    Detects a possible process memory dump that uses a white-listed filename like TrolleyExpress.exe as a way to dump the LSASS process memory without Microsoft Defender interference
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/10 19:27:11
references:
  - https://twitter.com/_xpn_/status/1491557187168178176
  - https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz
  - https://twitter.com/mrd0x/status/1460597833917251595
logsource:
    category: process_access
    product: windows
detection:
    condition: selection
    selection:
        GrantedAccess|endswith:
          - "10"
          - "30"
          - "50"
          - "70"
          - "90"
          - B0
          - D0
          - F0
          - "18"
          - "38"
          - "58"
          - "78"
          - "98"
          - B8
          - D8
          - F8
          - 1A
          - 3A
          - 5A
          - 7A
          - 9A
          - BA
          - DA
          - FA
          - "0x14C2"
          - FF
        SourceImage|endswith:
          - \TrolleyExpress.exe
          - \ProcessDump.exe
          - \dump64.exe
        TargetImage|endswith: \lsass.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/11/29
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.s0002
  - DEMO
