
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious LSASS Access Via MalSecLogon
id: 472159c5-31b9-4f56-b794-b766faa8b0a7
status: test
description: Detects suspicious access to LSASS handle via a call trace to "seclogon.dll"
    with a suspicious access right.
author: Samir Bousseaden (original elastic rule), Nasreddine Bencherchali (Nextron
    Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/29 15:52:31
references:
  - https://twitter.com/SBousseaden/status/1541920424635912196
  - https://github.com/elastic/detection-rules/blob/2bc1795f3d7bcc3946452eb4f07ae799a756d94e/rules/windows/credential_access_lsass_handle_via_malseclogon.toml
  - https://splintercod3.blogspot.com/p/the-hidden-side-of-seclogon-part-3.html
logsource:
    category: process_access
    product: windows
detection:
    condition: selection
    selection:
        CallTrace|contains: seclogon.dll
        GrantedAccess: "0x14c0"
        SourceImage|endswith: \svchost.exe
        TargetImage|endswith: \lsass.exe
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1003.001
  - DEMO
