
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - LittleCorporal Generated Maldoc Injection
id: 7bdde3bf-2a42-4c39-aa31-a92b3e17afac
status: test
description: Detects the process injection of a LittleCorporal generated Maldoc.
author: Christian Burkard (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/09 19:34:01
references:
  - https://github.com/connormcgarr/LittleCorporal
logsource:
    category: process_access
    product: windows
detection:
    condition: selection
    selection:
        CallTrace|contains|all:
          - :\Windows\Microsoft.NET\Framework64\v2.
          - UNKNOWN
        SourceImage|endswith: \winword.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/11/28
tags:
  - attack.execution
  - attack.t1204.002
  - attack.t1055.003
  - DEMO
