title: Suspicious WMI Event Consumer Registered
id: 6c4d50b2-939c-44e9-a81c-18dc3442993a
status: test
description: Detects the creation of a suspicious WMI event consumer
references:
    - Internal Research
author: Nasreddine Bencherchali
date: 2022/11/22
modified: 2023/03/29
tags:
    - attack.execution
    - attack.t1047
logsource:
    product: windows
    service: wmi
detection:
    selection:
        EventID: 11
        Operation|contains|all:
            - 'IWbemServices::PutInstance'
            - 'root\subscription'
        Operation|contains:
            - 'CommandLineEventConsumer'
            - 'ActiveScriptEventConsumer'
    condition: selection
falsepositives:
    - Unknown
level: medium
