title: Suspicious WMI Command Line Event Consumer Registered
id: 4fc66d8f-9e5a-45be-9b60-f197b7a638ac
status: test
description: Detects the creation of a suspicious WMI CommandLineEventConsumer
references:
    - Internal Research
author: Nasreddine Bencherchali
date: 2022/11/22
modified: 2023/03/29
tags:
    - attack.execution
    - attack.t1047
logsource:
    product: windows
    service: wmi
detection:
    selection:
        EventID: 5861
        Consumer|contains: 'CommandLineEventConsumer='
        PossibleCause|contains:
            # Add more suspicious commands and paths
            - 'System.Net.WebClient'
            - 'FromBase64String'
            - '-nop -c'
            - '-enc '
            - 'IEX '
            - 'Invoke-Expression'
            - 'DownloadString'
            - '-w hidden'
            - 'rundll32'
            - 'regsvr32'
            - '\Users\Public\'
            - '%Public%'
            - '%Temp%'
            - '%Tmp%'
            - '%UserProfile%'
            - '\Perflogs\'
            - '\Local\Temp\'
            - '\Windows\Temp\'
            - 'mshta'
            - 'wscript'
            - 'cscript'
    condition: selection
falsepositives:
    - Legitimate software can and will create consumers of this type. Investigate the initiating process and the contents of the consumer to determine if its benign
level: high
