title: Metasploit WMI Persistence Event Filter Creation
id: d596fd7e-5fff-4332-a546-5ca77a288e89
status: test
description: Detects the creation of a suspicious WMI event filter based on specific process. As seen used in with Metasploit "wmi_persistence.rb" script
references:
    - https://github.com/rapid7/metasploit-framework/blob/0aa0884e2607c5ea65531d4485aa0291554a8af2/modules/exploits/windows/local/wmi_persistence.rb#L185
author: Nasreddine Bencherchali
date: 2022/11/24
modified: 2023/03/29
tags:
    - attack.execution
    - attack.t1047
logsource:
    product: windows
    service: wmi
detection:
    selection:
        EventID: 5861
        Consumer|contains:
            - 'ActiveScriptEventConsumer='
            - 'CommandLineEventConsumer='
        PossibleCause|contains|all:
            - 'FROM __InstanceDeletionEvent'
            - 'WITHIN 5'
            - 'Win32_Process'
            - 'waitfor.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
