
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Remote Event Log Recon
id: 2053961f-44c7-4a64-b62d-f6e72800af0d
status: test
description: Detects remote RPC calls to get event log information via EVEN or EVEN6
author: Sagie Dulce, Dekel Paz
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/01 11:37:11
references:
  - https://github.com/zeronetworks/rpcfirewall
  - https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
    category: application
    product: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes
        with "audit:true action:block uuid:82273fdc-e32a-18c3-3f78-827929dc23ea and
        uuid:f6beaff7-1e19-4fbb-9f8f-b89e2018337c"'
detection:
    condition: selection
    selection:
        EventID: "3"
        EventLog: RPCFW
        InterfaceUuid:
          - 82273fdc-e32a-18c3-3f78-827929dc23ea
          - f6beaff7-1e19-4fbb-9f8f-b89e2018337c
falsepositives: Remote administrative tasks on Windows Events
level: high
customer: 'demo'
modified: 2022/01/01
tags:
  - attack.discovery
  - DEMO
