title: Potential CVE Exploitation
id: c990d06d-b101-4e0a-b177-2d03dd7165e9
related:
    - id: 48d91a3a-2363-43ba-a456-ca71ac3da5c2 # Public rule using Application log
      type: similar
status: experimental
description: |
    Detects events generated by user-mode applications when they call the CveEventWrite API when a known vulnerability is trying to be exploited.
    MS started using this log in January 2020 with CVE-2020-0601 (a Windows CryptoAPI vulnerability).
    Unfortunately, that is about the only instance of CVEs being written to this log.
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/28
tags:
    - attack.execution
    - attack.t1203
    - attack.privilege_escalation
    - attack.t1068
    - attack.defense_evasion
    - attack.t1211
    - attack.credential_access
    - attack.t1212
    - attack.lateral_movement
    - attack.t1210
    - attack.impact
    - attack.t1499.004
logsource:
    product: windows
    service: audit-cve
detection:
    selection:
        EventID:
            - 1 # Application log
            - 2 # System log
    condition: selection
falsepositives:
    - Unlikely
level: critical
