
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Password Policy Discovery
id: ca94a6db-8106-4737-9ed2-3e3bb826af0a
status: stable
description: Detects password policy discovery commands
author: Ömer Günal, oscd.community, Pawel Mazur
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/08 12:55:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1201/T1201.md
  - https://linux.die.net/man/1/chage
  - https://man7.org/linux/man-pages/man1/passwd.1.html
  - https://superuser.com/questions/150675/how-to-display-password-policy-information-for-a-user-ubuntu
logsource:
    product: linux
    service: auditd
detection:
    condition: 1 of selection_*
    selection_chage:
        a0: chage
        a1:
          - --list
          - -l
        type: EXECVE
    selection_files:
        name:
          - /etc/pam.d/common-password
          - /etc/security/pwquality.conf
          - /etc/pam.d/system-auth
          - /etc/login.defs
        type: PATH
    selection_passwd:
        a0: passwd
        a1:
          - -S
          - --status
        type: EXECVE
falsepositives: Legitimate administration activities
level: low
customer: 'demo'
modified: 2022/12/18
tags:
  - attack.discovery
  - attack.t1201
  - DEMO
