
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Logging Configuration Changes on Linux Host
id: c830f15d-6f6e-430f-8074-6f73d6807841
status: test
description: Detect changes of syslog daemons configuration files
author: Mikhail Larin, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/25 17:23:11
references:
  - self experience
logsource:
    product: linux
    service: auditd
detection:
    condition: selection
    selection:
        name:
          - /etc/syslog.conf
          - /etc/rsyslog.conf
          - /etc/syslog-ng/syslog-ng.conf
        type: PATH
fields:
  - exe
  - comm
  - key
falsepositives: Legitimate administrative activity
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.defense_evasion
  - attack.t1562.006
  - DEMO
