
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Creation Of An User Account
id: 759d0d51-bc99-4b5e-9add-8f5b2c8e7512
status: test
description: Detects the creation of a new user account. Such accounts may be used
    for persistence that do not require persistent remote access tools to be deployed
    on the system.
author: Marie Euler, Pawel Mazur
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/05/18 12:46:11
references:
  - https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/7/html/security_guide/sec-understanding_audit_log_files
  - https://access.redhat.com/articles/4409591#audit-record-types-2
  - https://www.youtube.com/watch?v=VmvY5SQm5-Y&ab_channel=M45C07
logsource:
    product: linux
    service: auditd
detection:
    condition: 1 of selection_*
    selection_add_user_record_type:
        type: ADD_USER
    selection_syscall_record_type:
        exe|endswith: /useradd
        type: SYSCALL
falsepositives: Admin activity
level: medium
customer: 'demo'
modified: 2022/12/20
tags:
  - attack.t1136.001
  - attack.persistence
  - DEMO
