
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Program Executions in Suspicious Folders
id: a39d7fa7-3fbd-4dc2-97e1-d87f546b1bbc
status: test
description: Detects program executions in suspicious non-program folders related
    to malware or hacking activity
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/01/23 16:55:21
references:
  - Internal Research
logsource:
    product: linux
    service: auditd
detection:
    condition: selection
    selection:
        exe|startswith:
          - /tmp/
          - /var/www/
          - /home/*/public_html/
          - /usr/local/apache2/
          - /usr/local/httpd/
          - /var/apache/
          - /srv/www/
          - /home/httpd/html/
          - /srv/http/
          - /usr/share/nginx/html/
          - /var/lib/pgsql/data/
          - /usr/local/mysql/data/
          - /var/lib/mysql/
          - /var/vsftpd/
          - /etc/bind/
          - /var/named/
        type: SYSCALL
falsepositives:
  - Admin activity (especially in /tmp folders)
  - Crazy web applications
level: medium
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.t1587
  - attack.t1584
  - attack.resource_development
  - DEMO
