
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Use Of Hidden Paths Or Files
id: 9e1bef8d-0fff-46f6-8465-9aa54e128c1e
related:
  - type: similar
    id: d08722cd-3d09-449a-80b4-83ea2d9d4616
status: test
description: Detects calls to hidden files or files located in hidden directories
    in NIX systems.
author: David Burkett, @signalblur
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/30 12:45:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.001/T1564.001.md
logsource:
    product: linux
    service: auditd
detection:
    condition: selection and not filter
    filter:
        name|contains:
          - /.cache/
          - /.config/
          - /.pyenv/
          - /.rustup/toolchains
    selection:
        name|contains: /.
        type: PATH
falsepositives: Unknown
level: low
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1574.001
  - DEMO
