
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Audio Capture
id: a7af2487-9c2f-42e4-9bb9-ff961f0561d5
status: test
description: Detects attempts to record audio with arecord utility
author: Pawel Mazur
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/09/04 09:29:01
references:
  - https://linux.die.net/man/1/arecord
  - https://linuxconfig.org/how-to-test-microphone-with-audio-linux-sound-architecture-alsa
logsource:
    product: linux
    service: auditd
detection:
    condition: selection
    selection:
        a0: arecord
        a1: -vv
        a2: -fdat
        type: EXECVE
falsepositives: Unknown
level: low
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.collection
  - attack.t1123
  - DEMO
