
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: System Information Discovery - Auditd
id: f34047d9-20d3-4e8b-8672-0a35cc50dc71
status: test
description: Detects System Information Discovery commands
author: Pawel Mazur
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/09/03 15:48:31
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f296668303c29d3f4c07e42bdd2b28d8dd6625f9/atomics/T1082/T1082.md
logsource:
    product: linux
    service: auditd
detection:
    condition: 1 of selection_*
    selection_1:
        name:
          - /etc/lsb-release
          - /etc/redhat-release
          - /etc/issue
        type: PATH
    selection_2:
        a0:
          - uname
          - uptime
          - lsmod
          - hostname
          - env
        type: EXECVE
    selection_3:
        a0: grep
        a1|contains:
          - vbox
          - vm
          - xen
          - virtio
          - hv
        type: EXECVE
    selection_4:
        a0: kmod
        a1: list
        type: EXECVE
falsepositives: Likely
level: low
customer: 'demo'
modified: 2023/03/06
tags:
  - attack.discovery
  - attack.t1082
  - DEMO
