
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Screen Capture with Xwd
id: e2f17c5d-b02a-442b-9052-6eb89c9fec9c
status: test
description: Detects adversary creating screen capture of a full with xwd. Highly
    recommended using rule on servers, due high usage of screenshot utilities on user
    workstations
author: Pawel Mazur
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/09/13 12:03:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1113/T1113.md#atomic-test-3---x-windows-capture
  - https://linux.die.net/man/1/xwd
logsource:
    product: linux
    service: auditd
detection:
    condition: selection and 1 of xwd_*
    selection:
        a0: xwd
        type: EXECVE
    xwd_no_root_window:
        a1: -out
        a2|endswith: .xwd
    xwd_root_window:
        a1: -root
        a2: -out
        a3|endswith: .xwd
falsepositives: Legitimate use of screenshot utility
level: low
customer: 'demo'
modified: 2022/12/18
tags:
  - attack.collection
  - attack.t1113
  - DEMO
