
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Clipboard Collection of Image Data with Xclip Tool
id: f200dc3f-b219-425d-a17e-c38467364816
status: test
description: |
    Detects attempts to collect image data stored in the clipboard from users with the usage of xclip tool.
    Xclip has to be installed.
    Highly recommended using rule on servers, due to high usage of clipboard utilities on user workstations.
author: Pawel Mazur
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/10/01 18:49:21
references:
  - https://linux.die.net/man/1/xclip
logsource:
    product: linux
    service: auditd
detection:
    condition: selection
    selection:
        a0: xclip
        a1:
          - -selection
          - -sel
        a2:
          - clipboard
          - clip
        a3: -t
        a4|startswith: image/
        a5: -o
        type: EXECVE
falsepositives: Legitimate usage of xclip tools
level: low
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.collection
  - attack.t1115
  - DEMO
