
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: System Owner or User Discovery
id: 9a0d8ca0-2385-4020-b6c6-cb6153ca56f3
status: test
description: Adversaries may use the information from System Owner/User Discovery
    during automated discovery to shape follow-on behaviors, including whether or
    not the adversary fully infects the target and/or attempts specific actions.
author: Timur Zinniatullin, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/21 14:01:21
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1033/T1033.md
logsource:
    product: linux
    service: auditd
detection:
    condition: selection
    selection:
        a0:
          - users
          - w
          - who
        type: EXECVE
falsepositives: Admin activity
level: low
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.discovery
  - attack.t1033
  - DEMO
