
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Binary Padding - Linux
id: c52a914f-3d8b-4b2a-bb75-b3991e75f8ba
status: test
description: |
    Adversaries may use binary padding to add junk data and change the on-disk representation of malware.
    This rule detect using dd and truncate to add a junk data to file.
author: Igor Fits, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/13 11:29:31
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027.001/T1027.001.md
logsource:
    product: linux
    service: auditd
detection:
    condition: selection_execve and (keywords_truncate or (keywords_dd and not keywords_filter))
    keywords_dd:
        '|all':
          - dd
          - if=
    keywords_filter: of=
    keywords_truncate:
        '|all':
          - truncate
          - -s
    selection_execve:
        type: EXECVE
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/05/03
tags:
  - attack.defense_evasion
  - attack.t1027.001
  - DEMO
