
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious History File Operations - Linux
id: eae8ce9f-bde9-47a6-8e79-f20d18419910
status: test
description: Detects commandline operations on shell history files
author: Mikhail Larin, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/17 17:08:21
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.003/T1552.003.md
logsource:
    product: linux
    service: auditd
detection:
    condition: execve and history
    execve:
        type: EXECVE
    history:
      - .bash_history
      - .zsh_history
      - .zhistory
      - .history
      - .sh_history
      - fish_history
fields:
  - a0
  - a1
  - a2
  - a3
  - key
falsepositives:
  - Legitimate administrative activity
  - Legitimate software, cleaning hist file
level: medium
customer: 'demo'
modified: 2022/11/28
tags:
  - attack.credential_access
  - attack.t1552.003
  - DEMO
