
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Data Compressed
id: a3b5e3e9-1b49-4119-8b8e-0344a01f21ee
status: test
description: An adversary may compress data (e.g., sensitive documents) that is collected
    prior to exfiltration in order to make it portable and minimize the amount of
    data sent over the network.
author: Timur Zinniatullin, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/21 10:02:31
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/a78b9ed805ab9ea2e422e1aa7741e9407d82d7b1/atomics/T1560.001/T1560.001.md
logsource:
    product: linux
    service: auditd
detection:
    condition: 1 of selection*
    selection1:
        a0: zip
        type: execve
    selection2:
        a0: gzip
        a1: -k
        type: execve
    selection3:
        a0: tar
        a1|contains: -c
        type: execve
falsepositives: Legitimate use of archiving tools by legitimate user.
level: low
customer: 'demo'
modified: 2023/07/28
tags:
  - attack.exfiltration
  - attack.t1560.001
  - DEMO
