
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Screen Capture with Import Tool
id: dbe4b9c5-c254-4258-9688-d6af0b7967fd
status: test
description: |
    Detects adversary creating screen capture of a desktop with Import Tool.
    Highly recommended using rule on servers, due to high usage of screenshot utilities on user workstations.
    ImageMagick must be installed.
author: Pawel Mazur
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/09/21 14:12:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1113/T1113.md
  - https://linux.die.net/man/1/import
  - https://imagemagick.org/
logsource:
    product: linux
    service: auditd
detection:
    condition: import and (import_window_root or import_no_window_root)
    import:
        a0: import
        type: EXECVE
    import_no_window_root:
        a1|endswith:
          - .png
          - .jpg
          - .jpeg
    import_window_root:
        a1: -window
        a2: root
        a3|endswith:
          - .png
          - .jpg
          - .jpeg
falsepositives: Legitimate use of screenshot utility
level: low
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.collection
  - attack.t1113
  - DEMO
