
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DNS Query To Ufile.io - DNS Client
id: 090ffaad-c01a-4879-850c-6d57da98452d
related:
  - type: similar
    id: 1cbbeaaf-3c8c-4e4c-9d72-49485b6a176b
status: experimental
description: Detects DNS queries to "ufile.io", which was seen abused by malware and
    threat actors as a method for data exfiltration
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/16 13:45:41
references:
  - https://thedfirreport.com/2021/12/13/diavol-ransomware/
logsource:
    product: windows
    service: dns-client
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
        Log must be enabled/collected in order to receive the events.'
detection:
    condition: selection
    selection:
        EventID: "3008"
        QueryName|contains: ufile.io
falsepositives: DNS queries for "ufile" are not malicious by nature necessarily. Investigate
    the source to determine the necessary actions to take
level: low
customer: 'demo'
modified: 2023/09/18
tags:
  - attack.exfiltration
  - attack.t1567.002
  - DEMO
