
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Bitsadmin to Uncommon TLD
id: 9eb68894-7476-4cd6-8752-23b51f5883a7
status: experimental
description: Detects Bitsadmin connections to domains with uncommon TLDs
author: Florian Roth (Nextron Systems), Tim Shelton
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/03/07 12:26:21
references:
  - https://twitter.com/jhencinski/status/1102695118455349248
  - https://isc.sans.edu/forums/diary/Investigating+Microsoft+BITS+Activity/23281/
logsource:
    category: proxy
detection:
    condition: selection and not falsepositives
    falsepositives:
        cs-host|endswith:
          - .com
          - .net
          - .org
          - .scdn.co
          - .sfx.ms
    selection:
        c-useragent|startswith: Microsoft BITS/
fields:
  - ClientIP
  - c-uri
  - c-useragent
falsepositives: Rare programs that use Bitsadmin and update from regional TLDs e.g.
    .uk or .ca
level: high
customer: 'demo'
modified: 2023/05/17
tags:
  - attack.command_and_control
  - attack.t1071.001
  - attack.defense_evasion
  - attack.persistence
  - attack.t1197
  - attack.s0190
  - DEMO
