
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Bitsadmin to Uncommon IP Server Address
id: 8ccd35a2-1c7c-468b-b568-ac6cdf80eec3
status: test
description: Detects Bitsadmin connections to IP addresses instead of FQDN names
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/10 16:08:01
references:
  - https://isc.sans.edu/diary/Microsoft+BITS+Used+to+Download+Payloads/21027
logsource:
    category: proxy
detection:
    condition: selection
    selection:
        c-useragent|startswith: Microsoft BITS/
        cs-host|endswith:
          - "1"
          - "2"
          - "3"
          - "4"
          - "5"
          - "6"
          - "7"
          - "8"
          - "9"
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/08/24
tags:
  - attack.command_and_control
  - attack.t1071.001
  - attack.defense_evasion
  - attack.persistence
  - attack.t1197
  - attack.s0190
  - DEMO
