
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Download From Suspicious TLD - Blacklist
id: 00d0b5ab-1f55-4120-8e83-487c0a7baf19
related:
  - type: similar
    id: b5de2919-b74a-4805-91a7-5049accbaefe
status: test
description: Detects download of certain file types from hosts in suspicious TLDs
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/11/07 16:10:11
references:
  - https://www.symantec.com/connect/blogs/shady-tld-research-gdn-and-our-2016-wrap
  - https://promos.mcafee.com/en-US/PDF/MTMW_Report.pdf
  - https://www.spamhaus.org/statistics/tlds/
  - https://krebsonsecurity.com/2018/06/bad-men-at-work-please-dont-click/
logsource:
    category: proxy
detection:
    condition: selection
    selection:
        c-uri-extension:
          - exe
          - vbs
          - bat
          - rar
          - ps1
          - doc
          - docm
          - xls
          - xlsm
          - pptm
          - rtf
          - hta
          - dll
          - ws
          - wsf
          - sct
          - zip
        cs-host|endswith:
          - .country
          - .stream
          - .gdn
          - .mom
          - .xin
          - .kim
          - .men
          - .loan
          - .download
          - .racing
          - .online
          - .science
          - .ren
          - .gb
          - .win
          - .top
          - .review
          - .vip
          - .party
          - .tech
          - .xyz
          - .date
          - .faith
          - .zip
          - .cricket
          - .space
          - .info
          - .vn
          - .cm
          - .am
          - .cc
          - .asia
          - .ws
          - .tk
          - .biz
          - .su
          - .st
          - .ro
          - .ge
          - .ms
          - .pk
          - .nu
          - .me
          - .ph
          - .to
          - .tt
          - .name
          - .tv
          - .kz
          - .tc
          - .mobi
          - .study
          - .click
          - .link
          - .trade
          - .accountant
          - .cf
          - .gq
          - .ml
          - .ga
          - .pw
fields:
  - ClientIP
  - c-uri
falsepositives: All kinds of software downloads
level: low
customer: 'demo'
modified: 2023/05/18
tags:
  - attack.initial_access
  - attack.t1566
  - attack.execution
  - attack.t1203
  - attack.t1204.002
  - DEMO
