
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Possible Impacket SecretDump Remote Activity - Zeek
id: 92dae1ed-1c9d-4eff-a567-33acbd95b00e
status: test
description: Detect AD credential dumping using impacket secretdump HKTL. Based on
    the SIGMA rules/windows/builtin/win_impacket_secretdump.yml
author: Samir Bousseaden, @neu5ron
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/03/19 19:14:41
references:
  - https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html
logsource:
    product: zeek
    service: smb_files
detection:
    condition: selection
    selection:
        name|contains: SYSTEM32\
        name|endswith: .tmp
        path|contains|all:
          - \
          - ADMIN$
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.credential_access
  - attack.t1003.002
  - attack.t1003.004
  - attack.t1003.003
  - DEMO
