
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious PsExec Execution - Zeek
id: f1b3a22a-45e6-4004-afb5-4291f9c21166
related:
  - type: derived
    id: c462f537-a1e3-41a6-b5fc-b2c2cef9bf82
status: test
description: detects execution of psexec or paexec with renamed service name, this
    rule helps to filter out the noise if psexec is used for legit purposes or if
    attacker uses a different psexec client other than sysinternal one
author: Samir Bousseaden, @neu5ron, Tim Shelton
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/04/02 14:50:31
references:
  - https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html
logsource:
    product: zeek
    service: smb_files
detection:
    condition: selection and not filter
    filter:
        name|startswith: PSEXESVC
    selection:
        name|endswith:
          - -stdin
          - -stdout
          - -stderr
        path|contains|all:
          - \\
          - \IPC$
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/12/27
tags:
  - attack.lateral_movement
  - attack.t1021.002
  - DEMO
