
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Renamed Powershell Under Powershell Channel
id: 30a8cb77-8eb3-4cfb-8e79-ad457c5a4592
status: test
description: Detects renamed powershell
author: Harish Segar, frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/06/29 17:32:51
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
logsource:
    category: ps_classic_start
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_ps:
        Data|contains:
          - HostApplication=powershell
          - HostApplication=C:\Windows\System32\WindowsPowerShell\v1.0\powershell
          - HostApplication=C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell
          - HostApplication=C:/Windows/System32/WindowsPowerShell/v1.0/powershell
          - HostApplication=C:/Windows/SysWOW64/WindowsPowerShell/v1.0/powershell
    selection:
        Data|contains: HostName=ConsoleHost
falsepositives: Unknown
level: low
customer: 'demo'
modified: 2023/10/27
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
