
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Removal Of SD Value to Hide Schedule Task - Registry
id: acd74772-5f88-45c7-956b-6a7b36c294d2
related:
  - type: similar
    id: 526cc8bc-1cdc-48ad-8b26-f19bff969cec
status: test
description: Remove SD (Security Descriptor) value in \Schedule\TaskCache\Tree registry
    hive to hide schedule task. This technique is used by Tarrask malware
author: Sittikorn S
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/15 18:43:01
references:
  - https://www.microsoft.com/security/blog/2022/04/12/tarrask-malware-uses-scheduled-tasks-for-defense-evasion/
logsource:
    category: registry_delete
    product: windows
detection:
    condition: selection
    selection:
        EventType: DeleteKey
        TargetObject|contains|all:
          - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\
          - SD
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/02/08
tags:
  - attack.defense_evasion
  - attack.t1562
  - DEMO
