
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: CVE-2021-33766 Exchange ProxyToken Exploitation
id: 56973b50-3382-4b56-bdf5-f51a3183797a
status: test
description: Detects the exploitation of Microsoft Exchange ProxyToken vulnerability
    as described in CVE-2021-33766
author: Florian Roth (Nextron Systems), Max Altgelt (Nextron Systems), Christian Burkard
    (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/30 17:08:41
references:
  - https://www.zerodayinitiative.com/blog/2021/8/30/proxytoken-an-authentication-bypass-in-microsoft-exchange-server
logsource:
    category: webserver
detection:
    condition: 1 of selection_*
    selection_1:
        cs-method: POST
        cs-uri-query|contains|all:
          - /ecp/
          - /RulesEditor/InboxRules.svc/NewObject
        sc-status: "500"
    selection_2:
        cs-uri-query|contains|all:
          - SecurityToken=
          - /ecp/
        sc-status: "500"
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2023/01/02
tags:
  - attack.initial_access
  - attack.t1190
  - cve.2021.33766
  - detection.emerging_threats
  - DEMO
