
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential CVE-2023-25157 Exploitation Attempt
id: c0341543-5ed0-4475-aabc-7eea8c52aa66
status: experimental
description: Detects a potential exploitation attempt of CVE-2023-25157 a SQL injection
    in GeoServer
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/14 16:37:41
references:
  - https://github.com/win3zz/CVE-2023-25157
  - https://twitter.com/parzel2/status/1665726454489915395
  - https://github.com/advisories/GHSA-7g5f-wrx8-5ccf
logsource:
    category: webserver
detection:
    condition: all of selection_*
    selection_payload:
        cs-uri-query|contains:
          - +--
          - +AS+
          - +OR+
          - FROM
          - ORDER+BY
          - SELECT
          - sleep%28
          - substring%28
          - UNION
          - WHERE
    selection_url:
        cs-method: GET
        cs-uri-query|contains:
          - PropertyIsLike
          - strEndsWith
          - strStartsWith
          - FeatureId
          - jsonArrayContains
          - DWithin
        cs-uri-query|contains|all:
          - /geoserver/ows
          - CQL_FILTER=
falsepositives: Vulnerability scanners
level: high
customer: 'demo'
tags:
  - attack.initial_access
  - cve.2023.25157
  - detection.emerging_threats
  - DEMO
