
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential CVE-2022-21587 Exploitation Attempt
id: d033cb8a-8669-4a8e-a974-48d4185a8503
status: test
description: Detects potential exploitation attempts of CVE-2022-21587 an arbitrary
    file upload vulnerability impacting Oracle E-Business Suite (EBS). CVE-2022-21587
    can lead to unauthenticated remote code execution.
author: Isa Almannaei
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/02/13 16:38:01
references:
  - https://www.rapid7.com/blog/post/2023/02/07/etr-cve-2022-21587-rapid7-observed-exploitation-of-oracle-e-business-suite-vulnerability/
  - https://attackerkb.com/topics/Bkij5kK1qK/cve-2022-21587/rapid7-analysis
  - https://github.com/hieuminhnv/CVE-2022-21587-POC
  - https://blog.viettelcybersecurity.com/cve-2022-21587-oracle-e-business-suite-unauth-rce/
logsource:
    category: webserver
detection:
    condition: selection
    selection:
        cs-method: POST
        cs-uri-query|contains:
          - /OA_HTML/BneViewerXMLService?bne:uueupload=TRUE
          - /OA_HTML/BneUploaderService?bne:uueupload=TRUE
          - /OA_HTML/BneDownloadService?bne:uueupload=TRUE
          - /OA_HTML/BneOfflineLOVService?bne:uueupload=TRUE
falsepositives: Vulnerability Scanners
level: high
customer: 'demo'
tags:
  - attack.initial_access
  - attack.t1190
  - cve.2022.21587
  - detection.emerging_threats
  - DEMO
