
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Cisco ASA FTD Exploit CVE-2020-3452
id: aba47adc-4847-4970-95c1-61dce62a8b29
status: test
description: Detects exploitation attempts on Cisco ASA FTD systems exploiting CVE-2020-3452
    with a status code of 200 (sccessful exploitation)
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/01/07 12:59:11
references:
  - https://twitter.com/aboul3la/status/1286012324722155525
  - https://github.com/darklotuskdb/CISCO-CVE-2020-3452-Scanner-Exploiter
logsource:
    category: webserver
detection:
    condition: selection_endpoint and selection_path_select and select_status_code
    select_status_code:
        sc-status: "200"
    selection_endpoint:
        cs-uri-query|contains:
          - +CSCOT+/translation-table
          - +CSCOT+/oem-customization
    selection_path_select:
        cs-uri-query|contains:
          - '&textdomain=/'
          - '&textdomain=%'
          - '&name=/'
          - '&name=%'
fields:
  - c-ip
  - c-dns
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/02
tags:
  - attack.t1190
  - attack.initial_access
  - cve.2020.3452
  - detection.emerging_threats
  - DEMO
