
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Cobalt Strike DNS Beaconing - Sysmon
id: f356a9c4-effd-4608-bbf8-408afd5cd006
related:
  - type: similar
    id: 0d18728b-f5bf-4381-9dcf-915539fff6c2
status: test
description: Detects a program that invoked suspicious DNS queries known from Cobalt
    Strike beacons
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/11/09 17:59:51
references:
  - https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns
  - https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/
logsource:
    category: dns_query
    product: windows
detection:
    condition: 1 of selection*
    selection1:
        QueryName|startswith:
          - aaa.stage.
          - post.1
    selection2:
        QueryName|contains: .stage.123456.
fields:
  - Image
  - CommandLine
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2023/01/16
tags:
  - attack.command_and_control
  - attack.t1071.004
  - DEMO
