
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DNS Query Request To OneLaunch Update Service
id: df68f791-ad95-447f-a271-640a0dab9cf8
status: experimental
description: |
    Detects DNS query requests to "update.onelaunch.com". This domain is associated with the OneLaunch adware application.
    When the OneLaunch application is installed it will attempt to get updates from this domain.
author: Josh Nickels
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/02/26 17:26:41
references:
  - https://www.malwarebytes.com/blog/detections/pup-optional-onelaunch-silentcf
  - https://www.myantispyware.com/2020/12/14/how-to-uninstall-onelaunch-browser-removal-guide/
  - https://malware.guide/browser-hijacker/remove-onelaunch-virus/
logsource:
    category: dns_query
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith: \OneLaunch.exe
        QueryName: update.onelaunch.com
falsepositives: Unlikely
level: low
customer: 'demo'
tags:
  - attack.collection
  - attack.t1056
  - DEMO
