
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DNS Query To MEGA Hosting Website
id: 613c03ba-0779-4a53-8a1f-47f914a4ded3
related:
  - type: similar
    id: 66474410-b883-415f-9f8d-75345a0a66a6
status: test
description: Detects DNS queries for subdomains related to MEGA sharing website
author: Aaron Greetham (@beardofbinary) - NCC Group
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/05/26 13:55:51
references:
  - https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
logsource:
    category: dns_query
    product: windows
detection:
    condition: selection
    selection:
        QueryName|contains: userstorage.mega.co.nz
falsepositives: Legitimate DNS queries and usage of Mega
level: medium
customer: 'demo'
modified: 2023/09/18
tags:
  - attack.exfiltration
  - attack.t1567.002
  - DEMO
