
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DNS HybridConnectionManager Service Bus
id: 7bd3902d-8b8b-4dd4-838a-c6862d40150d
status: test
description: Detects Azure Hybrid Connection Manager services querying the Azure service
    bus service
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/04/12 16:15:31
references:
  - https://twitter.com/Cyb3rWard0g/status/1381642789369286662
logsource:
    category: dns_query
    product: windows
detection:
    condition: selection
    selection:
        Image|contains: HybridConnectionManager
        QueryName|contains: servicebus.windows.net
falsepositives: Legitimate use of Azure Hybrid Connection Manager and the Azure Service
    Bus service
level: high
customer: 'demo'
modified: 2023/01/16
tags:
  - attack.persistence
  - attack.t1554
  - DEMO
