
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Windows Defender Exclusions Added
id: 1321dc4e-a1fe-481d-a016-52c45f0c8b4f
status: stable
description: Detects the Setting of Windows Defender Exclusions
author: Christian Burkard (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/07/06 14:49:11
references:
  - https://twitter.com/_nullbind/status/1204923340810543109
logsource:
    product: windows
    service: windefend
detection:
    condition: selection
    selection:
        EventID: "5007"
        NewValue|contains: \Microsoft\Windows Defender\Exclusions
falsepositives: Administrator actions
level: medium
customer: 'demo'
modified: 2022/12/06
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - DEMO
