
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HybridConnectionManager Service Running
id: b55d23e5-6821-44ff-8a6e-67218891e49f
status: test
description: Rule to detect the Hybrid Connection Manager service running on an endpoint.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/04/12 16:45:11
references:
  - https://twitter.com/Cyb3rWard0g/status/1381642789369286662
logsource:
    product: windows
    service: microsoft-servicebus-client
detection:
    condition: selection and keywords
    keywords:
      - HybridConnection
      - sb://
      - servicebus.windows.net
      - HybridConnectionManage
    selection:
        EventID:
          - "40300"
          - "40301"
          - "40302"
falsepositives: Legitimate use of Hybrid Connection Manager via Azure function apps.
level: high
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.persistence
  - attack.t1554
  - DEMO
