
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Buffer Overflow Attempts
id: 18b042f0-2ecd-4b6e-9f8d-aa7a7e7de781
status: stable
description: Detects buffer overflow attempts in Unix system log files
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/03/01 12:34:41
references:
  - https://github.com/ossec/ossec-hids/blob/1ecffb1b884607cb12e619f9ab3c04f530801083/etc/rules/attack_rules.xml
logsource:
    product: linux
detection:
    condition: keywords
    keywords:
      - attempt to execute code on stack by
      - FTP LOGIN FROM .* 0bin0sh
      - 'rpc.statd[\d+]: gethostbyname error for'
      - AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.t1068
  - attack.privilege_escalation
  - DEMO
