
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Suspicious BPF Activity - Linux
id: 0fadd880-6af3-4610-b1e5-008dc3a11b8a
status: test
description: Detects the presence of "bpf_probe_write_user" BPF helper-generated warning
    messages. Which could be a sign of suspicious eBPF activity on the system.
author: Red Canary (idea), Nasreddine Bencherchali
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/25 16:36:11
references:
  - https://redcanary.com/blog/ebpf-malware/
  - https://man7.org/linux/man-pages/man7/bpf-helpers.7.html
logsource:
    product: linux
detection:
    condition: selection
    selection: bpf_probe_write_user
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.persistence
  - attack.defense_evasion
  - DEMO
