
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Disabling Security Tools - Builtin
id: 49f5dfc1-f92e-4d34-96fa-feba3f6acf36
related:
  - type: derived
    id: e3a8a052-111f-4606-9aee-f28ebeb76776
status: test
description: Detects disabling security tools
author: Ömer Günal, Alejandro Ortuno, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/06/17 14:52:21
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md
logsource:
    product: linux
    service: syslog
detection:
    condition: keywords
    keywords:
      - stopping iptables
      - stopping ip6tables
      - stopping firewalld
      - stopping cbdaemon
      - stopping falcon-sensor
falsepositives: Legitimate administration activities
level: medium
customer: 'demo'
modified: 2022/11/26
tags:
  - attack.defense_evasion
  - attack.t1562.004
  - DEMO
