
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential SpEL Injection In Spring Framework
id: e9edd087-89d8-48c9-b0b4-5b9bb10896b8
status: test
description: Detects potential SpEL Injection exploitation, which may lead to RCE.
author: Moti Harmats
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/02/11 17:27:51
references:
  - https://owasp.org/www-community/vulnerabilities/Expression_Language_Injection
  - https://www.wix.engineering/post/threat-and-vulnerability-hunting-with-application-server-error-logs
logsource:
    category: application
    product: spring
    definition: 'Requirements: application error logs must be collected (with LOG_LEVEL=ERROR
        and above)'
detection:
    condition: keywords
    keywords: org.springframework.expression.ExpressionException
falsepositives: Application bugs
level: high
customer: 'demo'
tags:
  - attack.initial_access
  - attack.t1190
  - DEMO
