
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential 7za.DLL Sideloading
id: 4f6edb78-5c21-42ab-a558-fd2a6fc1fd57
status: experimental
description: Detects potential DLL sideloading of "7za.dll"
author: X__Junior
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/09 13:25:11
references:
  - https://www.gov.pl/attachment/ee91f24d-3e67-436d-aa50-7fa56acf789d
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_legit_path:
        Image|startswith:
          - C:\Program Files (x86)\
          - C:\Program Files\
        ImageLoaded|startswith:
          - C:\Program Files (x86)\
          - C:\Program Files\
    selection:
        ImageLoaded|endswith: \7za.dll
falsepositives: Legitimate third party application located in "AppData" may leverage
    this DLL to offer 7z compression functionality and may generate false positives.
    Apply additional filters as needed.
level: low
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
