
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential RoboForm.DLL Sideloading
id: f64c9b2d-b0ad-481d-9d03-7fc75020892a
status: experimental
description: Detects potential DLL sideloading of "roboform.dll", a DLL used by RoboForm
    Password Manager
author: X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/14 14:53:51
references:
  - https://twitter.com/StopMalvertisin/status/1648604148848549888
  - https://twitter.com/t3ft3lb/status/1656194831830401024
  - https://www.roboform.com/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_path:
        Image|endswith:
          - \robotaskbaricon.exe
          - \robotaskbaricon-x64.exe
        Image|startswith:
          - ' C:\Program Files (x86)\Siber Systems\AI RoboForm\'
          - ' C:\Program Files\Siber Systems\AI RoboForm\'
    selection:
        ImageLoaded|endswith:
          - \roboform.dll
          - \roboform-x64.dll
falsepositives: If installed on a per-user level, the path would be located in "AppData\Local".
    Add additional filters to reflect this mode of installation
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
