
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Goopdate.DLL Sideloading
id: b6188d2f-b3c4-4d2c-a17d-9706e0851af0
status: experimental
description: Detects potential DLL sideloading of "goopdate.dll", a DLL used by googleupdate.exe
author: X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/15 14:56:01
references:
  - https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/goofy-guineapig/NCSC-MAR-Goofy-Guineapig.pdf
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_generic:
        ImageLoaded|startswith:
          - C:\Program Files (x86)\
          - C:\Program Files\
    filter_optional_dropbox_installer_temp:
        Image|contains|all:
          - \AppData\Local\Temp\GUM
          - .tmp\Dropbox
        ImageLoaded|contains|all:
          - \AppData\Local\Temp\GUM
          - .tmp\\goopdate.dll
    selection:
        ImageLoaded|endswith: \goopdate.dll
falsepositives:
  - False positives are expected from Google Chrome installations running from user
    locations (AppData) and other custom locations. Apply additional filters accordingly.
  - Other third party chromium browsers located in AppData
level: medium
customer: 'demo'
modified: 2023/05/20
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
