
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious WSMAN Provider Image Loads
id: ad1f4bb9-8dfb-4765-adb6-2a7cfb6c0f94
status: test
description: Detects signs of potential use of the WSMAN provider from uncommon processes
    locally and remote execution.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/06/24 15:30:21
references:
  - https://twitter.com/chadtilbury/status/1275851297770610688
  - https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/
  - https://docs.microsoft.com/en-us/windows/win32/winrm/windows-remote-management-architecture
  - https://github.com/bohops/WSMan-WinRM
logsource:
    category: image_load
    product: windows
detection:
    condition: ( request_client or respond_server ) and not 1 of filter* and not (
        svchost and commandline_null )
    commandline_null:
        CommandLine: []
    filter_citrix:
        Image|startswith: C:\Program Files\Citrix\
    filter_general:
        Image|endswith:
          - \powershell.exe
          - C:\Windows\System32\sdiagnhost.exe
          - C:\Windows\System32\services.exe
    filter_mscorsvw:
        Image|endswith: \mscorsvw.exe
        Image|startswith:
          - C:\Windows\Microsoft.NET\Framework64\v
          - C:\Windows\Microsoft.NET\Framework\v
    filter_nextron:
        Image|startswith: C:\Windows\Temp\asgard2-agent\
    filter_ps_ise:
        Image|endswith: \powershell_ise.exe
    filter_svchost:
        CommandLine|contains:
          - svchost.exe -k netsvcs -p -s BITS
          - svchost.exe -k GraphicsPerfSvcGroup -s GraphicsPerfSvc
          - svchost.exe -k NetworkService -p -s Wecsvc
          - svchost.exe -k netsvcs
    filter_svr_2019:
        Image:
          - C:\Windows\System32\Configure-SMRemoting.exe
          - C:\Windows\System32\ServerManager.exe
    filter_upgrade:
        Image|startswith: C:\$WINDOWS.~BT\Sources\
    request_client:
      - ImageLoaded|endswith:
          - \WsmSvc.dll
          - \WsmAuto.dll
          - \Microsoft.WSMan.Management.ni.dll
      - OriginalFileName:
          - WsmSvc.dll
          - WSMANAUTOMATION.DLL
          - Microsoft.WSMan.Management.dll
    respond_server:
        Image|endswith: \svchost.exe
        OriginalFileName: WsmWmiPl.dll
    svchost:
        Image|endswith: \svchost.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/10/07
tags:
  - attack.execution
  - attack.t1059.001
  - attack.lateral_movement
  - attack.t1021.003
  - DEMO
