
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Chrome Frame Helper DLL Sideloading
id: 72ca7c75-bf85-45cd-aca7-255d360e423c
status: experimental
description: Detects potential DLL sideloading of "chrome_frame_helper.dll"
author: Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/17 17:32:01
references:
  - https://hijacklibs.net/entries/3rd_party/google/chrome_frame_helper.html
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_path:
        ImageLoaded|startswith:
          - C:\Program Files\Google\Chrome\Application\
          - C:\Program Files (x86)\Google\Chrome\Application\
    filter_optional_user_path:
        ImageLoaded|contains: \AppData\local\Google\Chrome\Application\
    selection:
        ImageLoaded|endswith: \chrome_frame_helper.dll
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/05/15
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
