
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential appverifUI.DLL Sideloading
id: ee6cea48-c5b6-4304-a332-10fc6446f484
status: experimental
description: Detects potential DLL sideloading of "appverifUI.dll"
author: X__Junior (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/20 15:29:21
references:
  - https://fatrodzianko.com/2020/02/15/dll-side-loading-appverif-exe/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_legit_path:
        Image:
          - C:\Windows\SysWOW64\appverif.exe
          - C:\Windows\System32\appverif.exe
        ImageLoaded|startswith:
          - C:\Windows\System32\
          - C:\Windows\SysWOW64\
          - C:\Windows\WinSxS\
    selection:
        ImageLoaded|endswith: \appverifUI.dll
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
