
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: VMGuestLib DLL Sideload
id: 70e8e9b4-6a93-4cb7-8cde-da69502e7aff
status: test
description: Detects DLL sideloading of VMGuestLib.dll by the WmiApSrv service.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/01 11:41:51
references:
  - https://decoded.avast.io/martinchlumecky/png-steganography/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not filter
    filter:
        Signed: "true"
    selection:
        Image|endswith: \Windows\System32\wbem\WmiApSrv.exe
        ImageLoaded|contains|all:
          - \VMware\VMware Tools\vmStatsProvider\win32
          - \vmGuestLib.dll
falsepositives: FP could occur if the legitimate version of vmGuestLib already exists
    on the system
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
