
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Iviewers.DLL Sideloading
id: 4c21b805-4dd7-469f-b47d-7383a8fcb437
status: test
description: Detects potential DLL sideloading of "iviewers.dll" (OLE/COM Object Interface
    Viewer)
author: X__Junior (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/03/21 15:00:31
references:
  - https://www.secureworks.com/research/shadowpad-malware-analysis
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not filter
    filter:
        ImageLoaded|startswith:
          - C:\Program Files (x86)\Windows Kits\
          - C:\Program Files\Windows Kits\
    selection:
        ImageLoaded|endswith: \iviewers.dll
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
