
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Load Of RstrtMgr.DLL By A Suspicious Process
id: b48492dc-c5ef-4572-8dff-32bc241c15c8
related:
  - type: derived
    id: 3669afd2-9891-4534-a626-e5cf03810a61
status: experimental
description: |
    Detects the load of RstrtMgr DLL (Restart Manager) by a suspicious process.
    This library has been used during ransomware campaigns to kill processes that would prevent file encryption by locking them (e.g. Conti ransomware, Cactus ransomware). It has also recently been seen used by the BiBi wiper for Windows.
    It could also be used for anti-analysis purposes by shut downing specific processes.
author: Luc Génaux
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/11/28 16:54:21
references:
  - https://www.crowdstrike.com/blog/windows-restart-manager-part-1/
  - https://www.crowdstrike.com/blog/windows-restart-manager-part-2/
  - https://www.swascan.com/cactus-ransomware-malware-analysis/
  - https://taiwan.postsen.com/business/88601/Hamas-hackers-use-data-destruction-software-BiBi-which-consumes-a-lot-of-processor-resources-to-wipe-Windows-computer-data--iThome.html
logsource:
    category: image_load
    product: windows
detection:
    condition: selection_img and 1 of selection_folders_*
    selection_folders_1:
        Image|contains:
          - :\Perflogs\
          - :\Users\Public\
          - \Temporary Internet
    selection_folders_2:
      - Image|contains|all:
          - :\Users\
          - \Favorites\
      - Image|contains|all:
          - :\Users\
          - \Favourites\
      - Image|contains|all:
          - :\Users\
          - \Contacts\
    selection_img:
      - ImageLoaded|endswith: \RstrtMgr.dll
      - OriginalFileName: RstrtMgr.dll
falsepositives: Processes related to software installation
level: high
customer: 'demo'
tags:
  - attack.impact
  - attack.defense_evasion
  - attack.t1486
  - attack.t1562.001
  - DEMO
