
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Windows Spooler Service Suspicious Binary Load
id: 02fb90de-c321-4e63-a6b9-25f4b03dfd14
status: test
description: Detect DLL Load from Spooler Service backup folder
author: FPT.EagleEye, Thomas Patzke (improvements)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/06/29 18:20:41
references:
  - https://github.com/hhlxf/PrintNightmare
  - https://github.com/ly4k/SpoolFool
logsource:
    category: image_load
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith: \spoolsv.exe
        ImageLoaded|contains:
          - \Windows\System32\spool\drivers\x64\3\
          - \Windows\System32\spool\drivers\x64\4\
        ImageLoaded|endswith: .dll
falsepositives: Loading of legitimate driver
level: informational
customer: 'demo'
modified: 2022/06/02
tags:
  - attack.persistence
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1574
  - cve.2021.1675
  - cve.2021.34527
  - DEMO
