
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool - SILENTTRINITY Stager DLL Load
id: 75c505b1-711d-4f68-a357-8c3fe37dbf2d
related:
  - type: derived
    id: 03552375-cc2c-4883-bbe4-7958d5a980be
status: test
description: Detects SILENTTRINITY stager dll loading activity
author: Aleksey Potapov, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/22 14:59:41
references:
  - https://github.com/byt3bl33d3r/SILENTTRINITY
logsource:
    category: image_load
    product: windows
detection:
    condition: selection
    selection:
        Description|contains: st2stager
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/02/17
tags:
  - attack.command_and_control
  - attack.t1071
  - DEMO
