
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential SmadHook.DLL Sideloading
id: 24b6cf51-6122-469e-861a-22974e9c1e5b
status: experimental
description: Detects potential DLL sideloading of "SmadHook.dll", a DLL used by SmadAV
    antivirus
author: X__Junior (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/01 14:51:11
references:
  - https://research.checkpoint.com/2023/malware-spotlight-camaro-dragons-tinynote-backdoor/
  - https://www.qurium.org/alerts/targeted-malware-against-crph/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_legit_path:
        Image:
          - C:\Program Files (x86)\SMADAV\SmadavProtect32.exe
          - C:\Program Files (x86)\SMADAV\SmadavProtect64.exe
          - C:\Program Files\SMADAV\SmadavProtect32.exe
          - C:\Program Files\SMADAV\SmadavProtect64.exe
        ImageLoaded|startswith:
          - C:\Program Files (x86)\SMADAV\
          - C:\Program Files\SMADAV\
    selection:
        ImageLoaded|endswith:
          - \SmadHook32c.dll
          - \SmadHook64c.dll
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
