
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential DLL Sideloading Via comctl32.dll
id: 6360757a-d460-456c-8b13-74cf0e60cceb
status: test
description: Detects potential DLL sideloading using comctl32.dll to obtain system
    privileges
author: Nasreddine Bencherchali (Nextron Systems), Subhash Popuri (@pbssubhash)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/16 16:34:41
references:
  - https://github.com/binderlabs/DirCreate2System
  - https://github.com/sailay1996/awesome_windows_logical_bugs/blob/60cbb23a801f4c3195deac1cc46df27c225c3d07/dir_create2system.txt
logsource:
    category: image_load
    product: windows
detection:
    condition: selection
    selection:
        ImageLoaded|endswith: \comctl32.dll
        ImageLoaded|startswith:
          - C:\Windows\System32\logonUI.exe.local\
          - C:\Windows\System32\werFault.exe.local\
          - C:\Windows\System32\consent.exe.local\
          - C:\Windows\System32\narrator.exe.local\
          - C:\windows\system32\wermgr.exe.local\
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2022/12/19
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
