
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential DLL Sideloading Of DBGHELP.DLL
id: 6414b5cd-b19d-447e-bb5e-9f03940b5784
status: test
description: Detects DLL sideloading of "dbghelp.dll"
author: Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/25 15:20:41
references:
  - https://hijacklibs.net/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_generic:
        ImageLoaded|startswith:
          - C:\Program Files (x86)\
          - C:\Program Files\
          - C:\Windows\SoftwareDistribution\
          - C:\Windows\System32\
          - C:\Windows\SystemTemp\
          - C:\Windows\SysWOW64\
          - C:\Windows\WinSxS\
    filter_optional_anaconda:
        ImageLoaded|endswith:
          - \Anaconda3\Lib\site-packages\vtrace\platforms\windll\amd64\dbghelp.dll
          - \Anaconda3\Lib\site-packages\vtrace\platforms\windll\i386\dbghelp.dll
    filter_optional_epicgames:
        ImageLoaded|endswith:
          - \Epic Games\Launcher\Engine\Binaries\ThirdParty\DbgHelp\dbghelp.dll
          - \Epic Games\MagicLegends\x86\dbghelp.dll
    selection:
        ImageLoaded|endswith: \dbghelp.dll
falsepositives: Legitimate applications loading their own versions of the DLL mentioned
    in this rule
level: medium
customer: 'demo'
modified: 2023/05/05
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
