
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PowerShell Core DLL Loaded By Non PowerShell Process
id: 092bc4b9-3d1d-43b4-a6b4-8c8acd83522f
related:
  - type: obsoletes
    id: 867613fb-fa60-4497-a017-a82df74a172c
  - type: obsoletes
    id: fe6e002f-f244-4278-9263-20e4b593827f
status: experimental
description: |
    Detects loading of essential DLLs used by PowerShell by non-PowerShell process.
    Detects behavior similar to meterpreter's "load powershell" extension.
author: Tom Kern, oscd.community, Natalia Shornikova, Tim Shelton, Roberto Rodriguez
    (Cyb3rWard0g), OTR (Open Threat Research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/11/14 19:03:31
references:
  - https://adsecurity.org/?p=2921
  - https://github.com/p3nt4/PowerShdll
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_dotnet:
        Image|contains:
          - :\Windows\Microsoft.NET\Framework\
          - :\Windows\Microsoft.NET\Framework64\
        Image|endswith: \mscorsvw.exe
    filter_main_generic:
        Image|endswith:
          - :\Program Files\PowerShell\7\pwsh.exe
          - :\Windows\System32\dsac.exe
          - :\WINDOWS\System32\RemoteFXvGPUDisablement.exe
          - :\Windows\System32\runscripthelper.exe
          - :\WINDOWS\System32\sdiagnhost.exe
          - :\Windows\System32\ServerManager.exe
          - :\Windows\System32\SyncAppvPublishingServer.exe
          - :\Windows\System32\WindowsPowerShell\v1.0\powershell_ise.exe
          - :\Windows\System32\WindowsPowerShell\v1.0\powershell.exe
          - :\Windows\System32\winrshost.exe
          - :\Windows\System32\wsmprovhost.exe
          - :\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell_ise.exe
          - :\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell.exe
          - :\Windows\SysWOW64\winrshost.exe
          - :\Windows\SysWOW64\wsmprovhost.exe
    filter_optional_aurora:
        Image: []
    filter_optional_chocolatey:
        Image|contains: :\ProgramData\chocolatey\choco.exe
    filter_optional_citrix:
        Image|endswith: \Citrix\ConfigSync\ConfigSyncRun.exe
    filter_optional_nextron:
        Image|contains: :\Windows\Temp\asgard2-agent\
        Image|endswith:
          - \thor64.exe
          - \thor.exe
    filter_optional_sql_server_mgmt:
        Image|contains:
          - :\Program Files (x86)\Microsoft SQL Server Management Studio
          - :\Program Files\Microsoft SQL Server Management Studio
        Image|endswith: \IDE\Ssms.exe
    filter_optional_sql_server_tools:
        Image|contains:
          - :\Program Files (x86)\Microsoft SQL Server\
          - :\Program Files\Microsoft SQL Server\
        Image|endswith: \Tools\Binn\SQLPS.exe
    filter_optional_vs:
        Image|contains:
          - :\Program Files (x86)\Microsoft Visual Studio\
          - :\Program Files\Microsoft Visual Studio\
    selection:
      - Description: System.Management.Automation
      - OriginalFileName: System.Management.Automation.dll
      - ImageLoaded|endswith:
          - \System.Management.Automation.dll
          - \System.Management.Automation.ni.dll
falsepositives:
  - Used by some .NET binaries, minimal on user workstation.
  - Used by Microsoft SQL Server Management Studio
level: medium
customer: 'demo'
modified: 2024/01/17
tags:
  - attack.t1059.001
  - attack.execution
  - DEMO
