
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DotNET Assembly DLL Loaded Via Office Application
id: ff0f2b05-09db-4095-b96d-1b75ca24894a
status: test
description: Detects any assembly DLL being loaded by an Office Product
author: Antonlovesdnb
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/02/19 18:08:31
references:
  - https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
logsource:
    category: image_load
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - \excel.exe
          - \mspub.exe
          - \onenote.exe
          - \onenoteim.exe
          - \outlook.exe
          - \powerpnt.exe
          - \winword.exe
        ImageLoaded|startswith: C:\Windows\assembly\
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/03/29
tags:
  - attack.execution
  - attack.t1204.002
  - DEMO
