
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: WMI Persistence - Command Line Event Consumer
id: 05936ce2-ee05-4dae-9d03-9a391cf2d2c6
status: test
description: Detects WMI command line event consumers
author: Thomas Patzke
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/03/07 17:20:41
references:
  - https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection
    selection:
        Image: C:\Windows\System32\wbem\WmiPrvSE.exe
        ImageLoaded|endswith: \wbemcons.dll
falsepositives: Unknown (data set is too small; further testing needed)
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.t1546.003
  - attack.persistence
  - DEMO
