
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Antivirus Software DLL Sideloading
id: 552b6b65-df37-4d3e-a258-f2fc4771ae54
status: test
description: Detects potential DLL sideloading of DLLs that are part of antivirus
    software suchas McAfee, Symantec...etc
author: Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/17 17:43:51
references:
  - https://hijacklibs.net/
logsource:
    category: image_load
    product: windows
detection:
    condition: (selection_bitdefender and not 1 of filter_log_dll_*) or (selection_fsecure
        and not filter_fsecure) or (selection_mcafee and not filter_mcafee) or (selection_cyberark
        and not filter_cyberark) or (selection_avast and not filter_avast) or (selection_titanium
        and not filter_titanium) or (selection_eset_deslock and not filter_eset_deslock)
    filter_avast:
        ImageLoaded|startswith:
          - C:\program Files\AVAST Software\Avast\
          - C:\program Files (x86)\AVAST Software\Avast\
    filter_cyberark:
        ImageLoaded|startswith:
          - C:\Program Files\CyberArk\Endpoint Privilege Manager\Agent\x32\
          - C:\Program Files (x86)\CyberArk\Endpoint Privilege Manager\Agent\x32\
    filter_eset_deslock:
        ImageLoaded|startswith:
          - C:\program Files\ESET
          - C:\program Files (x86)\ESET
    filter_fsecure:
        ImageLoaded|startswith:
          - C:\Program Files\F-Secure\Anti-Virus\
          - C:\Program Files (x86)\F-Secure\Anti-Virus\
    filter_log_dll_bitdefender:
        ImageLoaded|startswith:
          - C:\Program Files\Bitdefender Antivirus Free\
          - C:\Program Files (x86)\Bitdefender Antivirus Free\
    filter_log_dll_canon:
        ImageLoaded|startswith: C:\Program Files\Canon\MyPrinter\
    filter_log_dll_dell_sar:
        Image: C:\Program Files\Dell\SARemediation\audit\TelemetryUtility.exe
        ImageLoaded:
          - C:\Program Files\Dell\SARemediation\plugin\log.dll
          - C:\Program Files\Dell\SARemediation\audit\log.dll
    filter_mcafee:
        ImageLoaded|startswith:
          - C:\Program Files\McAfee\
          - C:\Program Files (x86)\McAfee\
    filter_titanium:
        ImageLoaded|startswith:
          - C:\program Files\Trend Micro\Titanium\
          - C:\program Files (x86)\Trend Micro\Titanium\
    selection_avast:
        ImageLoaded|endswith: \wsc.dll
    selection_bitdefender:
        ImageLoaded|endswith: \log.dll
    selection_cyberark:
        ImageLoaded|endswith: \vftrace.dll
    selection_eset_deslock:
        ImageLoaded|endswith: \DLPPREM32.dll
    selection_fsecure:
        ImageLoaded|endswith: \qrt.dll
    selection_mcafee:
        ImageLoaded|endswith:
          - \ashldres.dll
          - \lockdown.dll
          - \vsodscpl.dll
    selection_titanium:
        ImageLoaded|endswith: \tmdbglog.dll
falsepositives:
  - Applications that load the same dlls mentioned in the detection section. Investigate
    them and filter them out if a lot FPs are caused.
  - Dell SARemediation plugin folder (C:\Program Files\Dell\SARemediation\plugin\log.dll)
    is known to contain the 'log.dll' file.
  - The Canon MyPrinter folder 'C:\Program Files\Canon\MyPrinter\' is known to contain
    the 'log.dll' file
level: medium
customer: 'demo'
modified: 2023/03/13
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
