
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Abusable DLL Potential Sideloading From Suspicious Location
id: 799a5f48-0ac1-4e0f-9152-71d137d48c2a
status: experimental
description: Detects potential DLL sideloading of DLLs that are known to be abused
    from suspicious locations
author: X__Junior (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/07/11 21:31:01
references:
  - https://www.trendmicro.com/en_us/research/23/f/behind-the-scenes-unveiling-the-hidden-workings-of-earth-preta.html
  - https://research.checkpoint.com/2023/beyond-the-horizon-traveling-the-world-on-camaro-dragons-usb-flash-drives/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection_dll and 1 of selection_folders_*
    selection_dll:
        ImageLoaded|endswith:
          - \coreclr.dll
          - \facesdk.dll
          - \HPCustPartUI.dll
          - \libcef.dll
          - \ZIPDLL.dll
    selection_folders_1:
        ImageLoaded|contains:
          - :\Perflogs\
          - :\Users\Public\
          - \Temporary Internet
          - \Windows\Temp\
    selection_folders_2:
      - ImageLoaded|contains|all:
          - :\Users\
          - \Favorites\
      - ImageLoaded|contains|all:
          - :\Users\
          - \Favourites\
      - ImageLoaded|contains|all:
          - :\Users\
          - \Contacts\
      - ImageLoaded|contains|all:
          - :\Users\
          - \Pictures\
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.execution
  - attack.t1059
  - DEMO
