
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Fax Service DLL Search Order Hijack
id: 828af599-4c53-4ed2-ba4a-a9f835c434ea
status: test
description: The Fax service attempts to load ualapi.dll, which is non-existent. An
    attacker can then (side)load their own malicious DLL using this service.
author: NVISO
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/05/04 14:33:21
references:
  - https://windows-internals.com/faxing-your-way-to-system/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not filter
    filter:
        ImageLoaded|startswith: C:\Windows\WinSxS\
    selection:
        Image|endswith: \fxssvc.exe
        ImageLoaded|endswith: ualapi.dll
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2022/06/02
tags:
  - attack.persistence
  - attack.defense_evasion
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
