
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Diagnostic Library Sdiageng.DLL Loaded By Msdt.EXE
id: ec8c4047-fad9-416a-8c81-0f479353d7f6
status: test
description: Detects both of CVE-2022-30190 (Follina) and DogWalk vulnerabilities
    exploiting msdt.exe binary to load the "sdiageng.dll" library
author: Greg (rule)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/17 18:19:01
references:
  - https://www.securonix.com/blog/detecting-microsoft-msdt-dogwalk/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith: \msdt.exe
        ImageLoaded|endswith: \sdiageng.dll
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/17
tags:
  - attack.defense_evasion
  - attack.t1202
  - cve.2022.30190
  - DEMO
