
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Amsi.DLL Loaded Via LOLBIN Process
id: 6ec86d9e-912e-4726-91a2-209359b999b9
status: experimental
description: Detects loading of "Amsi.dll" by a living of the land process. This could
    be an indication of a "PowerShell without PowerShell" attack
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/01 13:54:01
references:
  - Internal Research
  - https://www.paloaltonetworks.com/blog/security-operations/stopping-powershell-without-powershell/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - \ExtExport.exe
          - \odbcconf.exe
          - \regsvr32.exe
          - \rundll32.exe
        ImageLoaded|endswith: \amsi.dll
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/09/20
tags:
  - attack.defense_evasion
  - DEMO
