
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential EACore.DLL Sideloading
id: edd3ddc3-386f-4ba5-9ada-4376b2cfa7b5
status: experimental
description: Detects potential DLL sideloading of "EACore.dll"
author: X__Junior (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/03 14:07:21
references:
  - https://research.checkpoint.com/2023/beyond-the-horizon-traveling-the-world-on-camaro-dragons-usb-flash-drives/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_legit_path:
        Image|contains|all:
          - C:\Program Files\Electronic Arts\EA Desktop\
          - \EACoreServer.exe
        ImageLoaded|startswith: C:\Program Files\Electronic Arts\EA Desktop\
    selection:
        ImageLoaded|endswith: \EACore.dll
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
