
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Third Party Software DLL Sideloading
id: f9df325d-d7bc-4a32-8a1a-2cc61dcefc63
status: test
description: Detects DLL sideloading of DLLs that are part of third party software
    (zoom, discord....etc)
author: Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/17 15:18:11
references:
  - https://hijacklibs.net/
logsource:
    category: image_load
    product: windows
detection:
    condition: (selection_lenovo and not filter_lenovo) or (selection_toshiba and
        not filter_toshiba)
    filter_lenovo:
      - ImageLoaded|contains: \AppData\local\Google\Chrome\Application\
      - ImageLoaded|startswith:
          - C:\Program Files\Lenovo\Communications Utility\
          - C:\Program Files (x86)\Lenovo\Communications Utility\
    filter_toshiba:
        ImageLoaded|startswith:
          - C:\Program Files\Toshiba\Bluetooth Toshiba Stack\
          - C:\Program Files (x86)\Toshiba\Bluetooth Toshiba Stack\
    selection_lenovo:
        ImageLoaded|endswith: \commfunc.dll
    selection_toshiba:
        ImageLoaded|endswith: \tosbtkbd.dll
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
