
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Rcdll.DLL Sideloading
id: 6e78b74f-c762-4800-82ad-f66787f10c8a
status: test
description: Detects potential DLL sideloading of rcdll.dll
author: X__Junior (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/03/13 14:02:21
references:
  - https://www.trendmicro.com/en_us/research/23/c/iron-tiger-sysupdate-adds-linux-targeting.html
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not filter
    filter:
        ImageLoaded|startswith:
          - C:\Program Files (x86)\Microsoft Visual Studio\
          - C:\Program Files (x86)\Windows Kits\
    selection:
        ImageLoaded|endswith: \rcdll.dll
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/03/15
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
