
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DLL Names Used By SVR For GraphicalProton Backdoor
id: e64c8ef3-9f98-40c8-b71e-96110991cb4c
status: experimental
description: Hunts known SVR-specific DLL names.
author: CISA
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/12/18 18:18:41
references:
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-347a
logsource:
    category: image_load
    product: windows
detection:
    condition: selection
    selection:
        ImageLoaded|endswith:
          - \AclNumsInvertHost.dll
          - \AddressResourcesSpec.dll
          - \BlendMonitorStringBuild.dll
          - \ChildPaletteConnected.dll
          - \DeregisterSeekUsers.dll
          - \HandleFrequencyAll.dll
          - \HardSwapColor.dll
          - \LengthInMemoryActivate.dll
          - \ModeBitmapNumericAnimate.dll
          - \ModeFolderSignMove.dll
          - \ParametersNamesPopup.dll
          - \PerformanceCaptionApi.dll
          - \ScrollbarHandleGet.dll
          - \UnregisterAncestorAppendAuto.dll
          - \WowIcmpRemoveReg.dll
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1574.002
  - DEMO
