
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential WWlib.DLL Sideloading
id: e2e01011-5910-4267-9c3b-4149ed5479cf
status: experimental
description: Detects potential DLL sideloading of "wwlib.dll"
author: X__Junior (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/18 14:00:21
references:
  - https://twitter.com/WhichbufferArda/status/1658829954182774784
  - https://news.sophos.com/en-us/2022/11/03/family-tree-dll-sideloading-cases-may-be-related/
  - https://securelist.com/apt-luminousmoth/103332/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_path:
        Image|endswith: \winword.exe
        Image|startswith:
          - C:\Program Files (x86)\Microsoft Office\
          - C:\Program Files\Microsoft Office\
        ImageLoaded|startswith:
          - C:\Program Files (x86)\Microsoft Office\
          - C:\Program Files\Microsoft Office\
    selection:
        ImageLoaded|endswith: \wwlib.dll
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
