
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Python Image Load By Non-Python Process
id: cbb56d62-4060-40f7-9466-d8aaf3123f83
status: experimental
description: Detects the image load of "Python Core" by a non-Python process. This
    might be indicative of a Python script bundled with Py2Exe.
author: Patrick St. John, OTR (Open Threat Research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/05/03 15:56:11
references:
  - https://www.py2exe.org/
  - https://unit42.paloaltonetworks.com/unit-42-technical-analysis-seaduke/
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_generic:
      - Image|contains: Python
      - Image|startswith:
          - C:\Program Files\
          - C:\Program Files (x86)\
          - C:\ProgramData\Anaconda3\
    filter_optional_aurora:
        Image: []
    selection:
        Description: Python Core
falsepositives:
  - Legitimate Py2Exe Binaries
  - Known false positive caused with Python Anaconda
level: medium
customer: 'demo'
modified: 2023/09/18
tags:
  - attack.defense_evasion
  - attack.t1027.002
  - DEMO
