
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Aruba Network Service Potential DLL Sideloading
id: 90ae0469-0cee-4509-b67f-e5efcef040f7
status: test
description: Detects potential DLL sideloading activity via the Aruba Networks Virtual
    Intranet Access "arubanetsvc.exe" process using DLL Search Order Hijacking
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/22 18:14:11
references:
  - https://twitter.com/wdormann/status/1616581559892545537?t=XLCBO9BziGzD7Bmbt8oMEQ&s=09
logsource:
    category: image_load
    product: windows
detection:
    condition: selection and not filter
    filter:
        ImageLoaded|startswith:
          - C:\Windows\System32\
          - C:\Windows\SysWOW64\
          - C:\Windows\WinSxS\
    selection:
        Image|endswith: \arubanetsvc.exe
        ImageLoaded|endswith:
          - \wtsapi32.dll
          - \msvcr100.dll
          - \msvcp100.dll
          - \dbghelp.dll
          - \dbgcore.dll
          - \wininet.dll
          - \iphlpapi.dll
          - \version.dll
          - \cryptsp.dll
          - \cryptbase.dll
          - \wldp.dll
          - \profapi.dll
          - \sspicli.dll
          - \winsta.dll
          - \dpapi.dll
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/03/15
tags:
  - attack.privilege_escalation
  - attack.persistence
  - attack.t1574.001
  - attack.t1574.002
  - DEMO
