
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Scheduled Task Write to System32 Tasks
id: 80e1f67a-4596-4351-98f5-a9c3efabac95
status: test
description: Detects the creation of tasks from processes executed from suspicious
    locations
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/11/16 18:46:51
references:
  - Internal Research
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
        Image|contains:
          - \AppData\
          - C:\PerfLogs
          - \Windows\System32\config\systemprofile
        TargetFilename|contains: \Windows\System32\Tasks
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/01/12
tags:
  - attack.persistence
  - attack.execution
  - attack.t1053
  - DEMO
