
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Binary Or Script Dropper Via PowerShell
id: 7047d730-036f-4f40-b9d8-1c63e36d5e62
status: experimental
description: Detects PowerShell creating a binary executable or a script file.
author: frack113, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/03/17 18:50:01
references:
  - https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
logsource:
    category: file_event
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_admin_temp:
        TargetFilename|endswith:
          - .dll
          - .exe
        TargetFilename|startswith: C:\Windows\Temp\
    filter_main_user_temp:
        TargetFilename|contains: \AppData\Local\Temp\
        TargetFilename|endswith:
          - .dll
          - .exe
        TargetFilename|startswith: C:\Users\
    selection:
        Image|endswith:
          - \powershell.exe
          - \pwsh.exe
        TargetFilename|endswith:
          - .bat
          - .chm
          - .cmd
          - .com
          - .dll
          - .exe
          - .hta
          - .jar
          - .js
          - .ocx
          - .scr
          - .sys
          - .vbe
          - .vbs
          - .wsf
falsepositives: False positives will differ depending on the environment and scripts
    used. Apply additional filters accordingly.
level: medium
customer: 'demo'
modified: 2023/05/09
tags:
  - attack.persistence
  - DEMO
