
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential SAM Database Dump
id: 4e87b8e2-2ee9-4b2a-a715-4727d297ece0
status: test
description: Detects the creation of files that look like exports of the local SAM
    (Security Account Manager)
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/11 12:50:01
references:
  - https://github.com/search?q=CVE-2021-36934
  - https://github.com/cube0x0/CVE-2021-36934
  - https://www.google.com/search?q=%22reg.exe+save%22+sam
  - https://github.com/HuskyHacks/ShadowSteal
  - https://github.com/FireFart/hivenightmare
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
      - TargetFilename|endswith:
          - \Temp\sam
          - \sam.sav
          - \Intel\sam
          - \sam.hive
          - \Perflogs\sam
          - \ProgramData\sam
          - \Users\Public\sam
          - \AppData\Local\sam
          - \AppData\Roaming\sam
          - _ShadowSteal.zip
          - \Documents\SAM.export
          - :\sam
      - TargetFilename|contains:
          - \hive_sam_
          - \sam.save
          - \sam.export
          - \~reg_sam.save
          - \sam_backup
          - \sam.bck
          - \sam.backup
falsepositives: Rare cases of administrative activity
level: high
customer: 'demo'
modified: 2023/01/05
tags:
  - attack.credential_access
  - attack.t1003.002
  - DEMO
