
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DLL Search Order Hijackig Via Additional Space in Path
id: b6f91281-20aa-446a-b986-38a92813a18f
status: test
description: |
    Detects when an attacker create a similar folder structure to windows system folders such as (Windows, Program Files...)
    but with a space in order to trick DLL load search order and perform a "DLL Search Order Hijacking" attack
author: frack113, Nasreddine Bencherchali
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/30 19:17:31
references:
  - https://twitter.com/cyb3rops/status/1552932770464292864
  - https://www.wietzebeukema.nl/blog/hijacking-dlls-in-windows
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
        TargetFilename|endswith: .dll
        TargetFilename|startswith:
          - C:\Windows \
          - C:\Program Files \
          - C:\Program Files (x86) \
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.defense_evasion
  - attack.t1574.002
  - DEMO
