
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Windows Shell/Scripting Application File Write to Suspicious Folder
id: 1277f594-a7d1-4f28-a2d3-73af5cbeab43
status: test
description: Detects Windows shells and scripting applications that write files to
    suspicious folders
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/11/20 23:51:01
references:
  - Internal Research
logsource:
    category: file_event
    product: windows
detection:
    condition: 1 of selection_*
    selection_1:
        Image|endswith:
          - \bash.exe
          - \cmd.exe
          - \cscript.exe
          - \msbuild.exe
          - \powershell.exe
          - \pwsh.exe
          - \sh.exe
          - \wscript.exe
        TargetFilename|startswith:
          - C:\PerfLogs\
          - C:\Users\Public\
    selection_2:
        Image|endswith:
          - \certutil.exe
          - \forfiles.exe
          - \mshta.exe
          - \schtasks.exe
          - \scriptrunner.exe
          - \wmic.exe
        TargetFilename|contains:
          - C:\PerfLogs\
          - C:\Users\Public\
          - C:\Windows\Temp\
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/03/29
tags:
  - attack.execution
  - attack.t1059
  - DEMO
