
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: OneNote Attachment File Dropped In Suspicious Location
id: 7fd164ba-126a-4d9c-9392-0d4f7c243df0
status: experimental
description: Detects creation of files with the ".one"/".onepkg" extension in suspicious
    or uncommon locations. This could be a sign of attackers abusing OneNote attachments
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/22 20:11:41
references:
  - https://www.bleepingcomputer.com/news/security/hackers-now-use-microsoft-onenote-attachments-to-spread-malware/
  - https://blog.osarmor.com/319/onenote-attachment-delivers-asyncrat-malware/
logsource:
    category: file_event
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_onenote:
        Image|contains: :\Program Files\Microsoft Office\
        Image|endswith: \ONENOTE.EXE
    selection:
        TargetFilename|contains:
          - \AppData\Local\Temp\
          - \Users\Public\
          - \Windows\Temp\
          - :\Temp\
        TargetFilename|endswith:
          - .one
          - .onepkg
falsepositives: Legitimate usage of ".one" or ".onepkg" files from those locations
level: medium
customer: 'demo'
modified: 2023/09/19
tags:
  - attack.defense_evasion
  - DEMO
