
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Legitimate Application Dropped Archive
id: 654fcc6d-840d-4844-9b07-2c3300e54a26
status: test
description: Detects programs on a Windows system that should not write an archive
    to disk
author: frack113, Florian Roth
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/21 16:14:51
references:
  - https://github.com/Neo23x0/sysmon-config/blob/3f808d9c022c507aae21a9346afba4a59dd533b9/sysmonconfig-export-block.xml#L1326
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - \winword.exe
          - \excel.exe
          - \powerpnt.exe
          - \msaccess.exe
          - \mspub.exe
          - \eqnedt32.exe
          - \visio.exe
          - \wordpad.exe
          - \wordview.exe
          - \certutil.exe
          - \certoc.exe
          - \CertReq.exe
          - \Desktopimgdownldr.exe
          - \esentutl.exe
          - \finger.exe
          - \notepad.exe
          - \AcroRd32.exe
          - \RdrCEF.exe
          - \mshta.exe
          - \hh.exe
        TargetFilename|endswith:
          - .zip
          - .rar
          - .7z
          - .diagcab
          - .appx
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
