
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious DotNET CLR Usage Log Artifact
id: e0b06658-7d1d-4cd3-bf15-03467507ff7c
related:
  - type: derived
    id: 4508a70e-97ef-4300-b62b-ff27992990ea
  - type: obsoletes
    id: e4b63079-6198-405c-abd7-3fe8b0ce3263
status: test
description: Detects the creation of Usage Log files by the CLR (clr.dll). These files
    are named after the executing process once the assembly is finished executing
    for the first time in the (user) session context.
author: frack113, omkar72, oscd.community, Wojciech Lesicki
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/11/18 15:59:11
references:
  - https://bohops.com/2021/03/16/investigating-net-clr-usage-log-tampering-techniques-for-edr-evasion/
  - https://github.com/olafhartong/sysmon-modular/blob/fa1ae53132403d262be2bbd7f17ceea7e15e8c78/11_file_create/include_dotnet.xml
  - https://web.archive.org/web/20221026202428/https://gist.github.com/code-scrap/d7f152ffcdb3e0b02f7f394f5187f008
  - https://blog.menasec.net/2019/07/interesting-difr-traces-of-net-clr.html
logsource:
    category: file_event
    product: windows
    definition: 'Requirements: UsageLogs folder must be monitored by the sysmon configuration'
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_rundll32:
        CommandLine|contains|all:
          - Temp
          - zzzzInvokeManagedCustomActionOutOfProc
        Image|endswith: \rundll32.exe
        ParentCommandLine|contains: ' -Embedding'
        ParentImage|endswith: \MsiExec.exe
    selection:
        TargetFilename|endswith:
          - \UsageLogs\cmstp.exe.log
          - \UsageLogs\cscript.exe.log
          - \UsageLogs\mshta.exe.log
          - \UsageLogs\msxsl.exe.log
          - \UsageLogs\regsvr32.exe.log
          - \UsageLogs\rundll32.exe.log
          - \UsageLogs\svchost.exe.log
          - \UsageLogs\wscript.exe.log
          - \UsageLogs\wmic.exe.log
falsepositives: Rundll32.exe with zzzzInvokeManagedCustomActionOutOfProc in command
    line and msiexec.exe as parent process - https://twitter.com/SBousseaden/status/1388064061087260675
level: high
customer: 'demo'
modified: 2023/02/23
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
