
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: LSASS Process Memory Dump Creation Via Taskmgr.EXE
id: 69ca12af-119d-44ed-b50f-a47af0ebc364
status: experimental
description: Detects the creation of an "lsass.dmp" file by the taskmgr process. This
    indicates a manual dumping of the LSASS.exe process memory using Windows Task
    Manager.
author: Swachchhanda Shrawan Poudel
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/19 18:24:21
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/987e3ca988ae3cff4b9f6e388c139c05bf44bbb8/atomics/T1003.001/T1003.001.md#L1
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - :\Windows\system32\taskmgr.exe
          - :\Windows\SysWOW64\taskmgr.exe
        TargetFilename|contains|all:
          - \AppData\Local\Temp\
          - \lsass
          - .DMP
falsepositives: Rare case of troubleshooting by an administrator or support that has
    to be investigated regardless
level: high
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1003.001
  - DEMO
