
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Process Monitor Driver Creation By Non-Sysinternals Binary
id: a05baa88-e922-4001-bc4d-8738135f27de
status: experimental
description: Detects creation of the Process Monitor driver by processes other than
    Process Monitor (procmon) itself.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/05 21:25:11
references:
  - Internal Research
logsource:
    category: file_event
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_process_explorer:
        Image|endswith:
          - \procmon.exe
          - \procmon64.exe
    selection:
        TargetFilename|contains: \procmon
        TargetFilename|endswith: .sys
falsepositives: Some false positives may occur with legitimate renamed process monitor
    binaries
level: medium
customer: 'demo'
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1068
  - DEMO
