
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Uncommon File Created In Office Startup Folder
id: a10a2c40-2c4d-49f8-b557-1a946bc55d9d
status: experimental
description: Detects the creation of a file with an uncommon extension in an Office
    application startup folder
author: frack113, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/06/05 17:47:41
references:
  - https://app.any.run/tasks/d6fe6624-6ef8-485d-aa75-3d1bdda2a08c/
  - http://addbalance.com/word/startup.htm
  - https://answers.microsoft.com/en-us/msoffice/forum/all/document-in-word-startup-folder-doesnt-open-when/44ab0932-2917-4150-8cdc-2f2cf39e86f3
  - https://en.wikipedia.org/wiki/List_of_Microsoft_Office_filename_extensions
logsource:
    category: file_event
    product: windows
detection:
    condition: ((selection_word_paths and not filter_exclude_word_ext) or (selection_excel_paths
        and not filter_exclude_excel_ext)) and not 1 of filter_main_*
    filter_exclude_excel_ext:
        TargetFilename|endswith:
          - .xll
          - .xls
          - .xlsm
          - .xlsx
          - .xlt
          - .xltm
          - .xlw
    filter_exclude_word_ext:
        TargetFilename|endswith:
          - .docb
          - .docm
          - .docx
          - .dotm
          - .mdb
          - .mdw
          - .pdf
          - .wll
          - .wwl
    filter_main_office_apps:
        Image|contains:
          - :\Program Files\Microsoft Office\
          - :\Program Files (x86)\Microsoft Office\
        Image|endswith:
          - \winword.exe
          - \excel.exe
    filter_main_office_click_to_run:
        Image|contains: :\Program Files\Common Files\Microsoft Shared\ClickToRun\
        Image|endswith: \OfficeClickToRun.exe
    selection_excel_paths:
      - TargetFilename|contains: \Microsoft\Excel\XLSTART
      - TargetFilename|contains|all:
          - \Office
          - \Program Files
          - \XLSTART
    selection_word_paths:
      - TargetFilename|contains: \Microsoft\Word\STARTUP
      - TargetFilename|contains|all:
          - \Office
          - \Program Files
          - \STARTUP
falsepositives: False positive might stem from rare extensions used by other Office
    utilities.
level: high
customer: 'demo'
modified: 2023/12/13
tags:
  - attack.resource_development
  - attack.t1587.001
  - DEMO
