
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Lace Tempest File Indicators
id: e94486ea-2650-4548-bf25-88cbd0bb32d7
status: experimental
description: Detects PowerShell script file creation with specific names or suffixes
    which was seen being used often in PowerShell scripts by FIN7
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/11/09 13:18:31
references:
  - https://www.sysaid.com/blog/service-desk/on-premise-software-security-vulnerability-notification
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
      - TargetFilename|endswith:
          - :\Program Files\SysAidServer\tomcat\webapps\usersfiles\user.exe
          - :\Program Files\SysAidServer\tomcat\webapps\usersfiles.war
          - :\Program Files\SysAidServer\tomcat\webapps\leave
      - TargetFilename|contains: :\Program Files\SysAidServer\tomcat\webapps\user.
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.execution
  - detection.emerging_threats
  - DEMO
