
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: TeamViewer Remote Session
id: 162ab1e4-6874-4564-853c-53ec3ab8be01
status: test
description: Detects the creation of log files during a TeamViewer remote session
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/30 12:46:51
references:
  - https://www.teamviewer.com/en-us/
logsource:
    category: file_event
    product: windows
detection:
    condition: 1 of selection*
    selection1:
        TargetFilename|endswith:
          - \TeamViewer\RemotePrinting\tvprint.db
          - \TeamViewer\TVNetwork.log
    selection2:
        TargetFilename|contains|all:
          - \TeamViewer
          - _Logfile.log
falsepositives: Legitimate uses of TeamViewer in an organisation
level: medium
customer: 'demo'
tags:
  - attack.command_and_control
  - attack.t1219
  - DEMO
