
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Startup Folder File Write
id: 2aa0a6b4-a865-495b-ab51-c28249537b75
related:
  - type: similar
    id: 28208707-fe31-437f-9a7f-4b1108b94d2e
status: test
description: A General detection for files being created in the Windows startup directory.
    This could be an indicator of persistence.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/05/02 12:33:41
references:
  - https://github.com/OTRF/detection-hackathon-apt29/issues/12
  - https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/5.B.1_611FCA99-97D0-4873-9E51-1C1BA2DBB40D.md
logsource:
    category: file_event
    product: windows
detection:
    condition: selection and not filter_update
    filter_update:
      - Image: C:\Windows\System32\wuauclt.exe
      - TargetFilename|startswith: C:\$WINDOWS.~BT\NewOS\
    selection:
        TargetFilename|contains: \Microsoft\Windows\Start Menu\Programs\StartUp
falsepositives: FP could be caused by legitimate application writing shortcuts for
    example. This folder should always be inspected to make sure that all the files
    in there are legitimate
level: medium
customer: 'demo'
modified: 2022/10/07
tags:
  - attack.persistence
  - attack.t1547.001
  - DEMO
