
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Persistence Via Outlook Form
id: c3edc6a5-d9d4-48d8-930e-aab518390917
status: test
description: Detects the creation of a new Outlook form which can contain malicious
    code
author: Tobias Michalski (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/06/10 16:11:41
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=76
  - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=79
  - https://learn.microsoft.com/en-us/office/vba/outlook/concepts/outlook-forms/create-an-outlook-form
  - https://www.slipstick.com/developer/custom-form/clean-outlooks-forms-cache/
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith: \outlook.exe
        TargetFilename|contains:
          - \AppData\Local\Microsoft\FORMS\IPM
          - \Local Settings\Application Data\Microsoft\Forms
falsepositives: Legitimate use of outlook forms
level: high
customer: 'demo'
modified: 2023/02/22
tags:
  - attack.persistence
  - attack.t1137.003
  - DEMO
