
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Diamond Sleet APT File Creation Indicators
id: e1212b32-55ff-4dfb-a595-62b572248056
status: experimental
description: Detects file creation activity that is related to Diamond Sleet APT activity
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/24 16:40:31
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
        TargetFilename|endswith:
          - :\ProgramData\4800-84DC-063A6A41C5C
          - :\ProgramData\clip.exe
          - :\ProgramData\DSROLE.dll
          - :\ProgramData\Forest64.exe
          - :\ProgramData\readme.md
          - :\ProgramData\Version.dll
          - :\ProgramData\wsmprovhost.exe
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.execution
  - detection.emerging_threats
  - DEMO
