
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious LNK Double Extension File Created
id: 3215aa19-f060-4332-86d5-5602511f3ca8
related:
  - type: derived
    id: b4926b47-a9d7-434c-b3a0-adc3fa0bd13e
status: experimental
description: |
    Detects the creation of files with an "LNK" as a second extension. This is sometimes used by malware as a method to abuse the fact that Windows hides the "LNK" extension by default.
author: Nasreddine Bencherchali (Nextron Systems), frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/11/07 17:24:41
references:
  - https://www.crowdstrike.com/blog/meet-crowdstrikes-adversary-of-the-month-for-june-mustang-panda/
  - https://www.anomali.com/blog/china-based-apt-mustang-panda-targets-minority-groups-public-and-private-sector-organizations
  - https://www.cybereason.com/blog/research/a-bazar-of-tricks-following-team9s-development-cycles
  - https://twitter.com/malwrhunterteam/status/1235135745611960321
  - https://twitter.com/luc4m/status/1073181154126254080
logsource:
    category: file_event
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_recent:
        TargetFilename|contains: \AppData\Roaming\Microsoft\Windows\Recent\
    filter_optional_office_excel:
        Image|endswith: \excel.exe
        TargetFilename|contains: \AppData\Roaming\Microsoft\Excel
    filter_optional_office_powerpoint:
        Image|endswith: \powerpnt.exe
        TargetFilename|contains: \AppData\Roaming\Microsoft\PowerPoint
    filter_optional_office_recent:
        Image|endswith:
          - \excel.exe
          - \powerpnt.exe
          - \winword.exe
        TargetFilename|contains: \AppData\Roaming\Microsoft\Office\Recent\
    filter_optional_office_word:
        Image|endswith: \winword.exe
        TargetFilename|contains: \AppData\Roaming\Microsoft\Word
    selection:
        TargetFilename|contains:
          - .doc.
          - .docx.
          - .jpg.
          - .pdf.
          - .ppt.
          - .pptx.
          - .xls.
          - .xlsx.
        TargetFilename|endswith: .lnk
falsepositives: Some tuning is required for other general purpose directories of third
    party apps
level: medium
customer: 'demo'
modified: 2023/10/18
tags:
  - attack.defense_evasion
  - attack.t1036.007
  - DEMO
