
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious desktop.ini Action
id: 81315b50-6b60-4d8f-9928-3466e1022515
status: test
description: Detects unusual processes accessing desktop.ini, which can be leveraged
    to alter how Explorer displays a folder's content (i.e. renaming files) without
    changing them on disk.
author: Maxime Thiebaut (@0xThiebaut), Tim Shelton (HAWK.IO)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/03/19 13:59:31
references:
  - https://isc.sans.edu/forums/diary/Desktopini+as+a+postexploitation+tool/25912/
logsource:
    category: file_event
    product: windows
detection:
    condition: selection and not 1 of filter_*
    filter_generic:
        Image|startswith:
          - C:\Windows\
          - C:\Program Files\
          - C:\Program Files (x86)\
    filter_jetbrains:
        Image|endswith: \AppData\Local\JetBrains\Toolbox\bin\7z.exe
        TargetFilename|contains: \JetBrains\apps\
    filter_upgrade:
        TargetFilename|startswith: C:\$WINDOWS.~BT\NewOS\
    selection:
        TargetFilename|endswith: \desktop.ini
falsepositives:
  - Operations performed through Windows SCCM or equivalent
  - Read only access list authority
level: medium
customer: 'demo'
modified: 2022/10/07
tags:
  - attack.persistence
  - attack.t1547.009
  - DEMO
