
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Remote Access Tool - ScreenConnect Temporary File
id: 0afecb6e-6223-4a82-99fb-bf5b981e92a5
related:
  - type: similar
    id: b1f73849-6329-4069-bc8f-78a604bb8b23
status: experimental
description: |
    Detects the creation of files in a specific location by ScreenConnect RMM.
    ScreenConnect has feature to remotely execute binaries on a target machine. These binaries will be dropped to ":\Users\<username>\Documents\ConnectWiseControl\Temp\" before execution.
author: Ali Alwashali
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/10 18:35:41
references:
  - https://github.com/SigmaHQ/sigma/pull/4467
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith: \ScreenConnect.WindowsClient.exe
        TargetFilename|contains: \Documents\ConnectWiseControl\Temp\
falsepositives: Legitimate use of ScreenConnect
level: low
customer: 'demo'
tags:
  - attack.execution
  - attack.t1059.003
  - DEMO
