
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Volume Shadow Copy Mount
id: f512acbf-e662-4903-843e-97ce4652b740
status: test
description: Detects volume shadow copy mount via Windows event log
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/20 12:20:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
logsource:
    product: windows
    service: system
detection:
    condition: selection
    selection:
        DeviceName|contains: HarddiskVolumeShadowCopy
        EventID: "98"
        Provider_Name: Microsoft-Windows-Ntfs
falsepositives: Legitimate use of volume shadow copy mounts (backups maybe).
level: low
customer: 'demo'
modified: 2022/12/25
tags:
  - attack.credential_access
  - attack.t1003.002
  - DEMO
