
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: HackTool Service Registration or Execution
id: d26ce60c-2151-403c-9a42-49420d87b5e4
status: test
description: Detects installation or execution of services
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/21 17:21:01
references:
  - Internal Research
logsource:
    product: windows
    service: system
detection:
    condition: selection_eid and 1 of selection_service_*
    selection_eid:
        EventID:
          - "7045"
          - "7036"
        Provider_Name: Service Control Manager
    selection_service_image:
        ImagePath|contains: bypass
    selection_service_name:
        ServiceName|contains:
          - cachedump
          - DumpSvc
          - gsecdump
          - pwdump
          - UACBypassedService
          - WCE SERVICE
          - WCESERVICE
          - winexesvc
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/07
tags:
  - attack.execution
  - attack.t1569.002
  - attack.s0029
  - DEMO
