
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: NTLMv1 Logon Between Client and Server
id: e9d4ab66-a532-4ef7-a502-66a9e4a34f5d
status: experimental
description: Detects the reporting of NTLMv1 being used between a client and server.
    NTLMv1 is insecure as the underlying encryption algorithms can be brute-forced
    by modern hardware.
author: Tim Shelton, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/26 15:28:41
references:
  - https://github.com/nasbench/EVTX-ETW-Resources/blob/f1b010ce0ee1b71e3024180de1a3e67f99701fe4/ETWProvidersManifests/Windows10/22H2/W10_22H2_Pro_20230321_19045.2728/WEPExplorer/LsaSrv.xml
logsource:
    product: windows
    service: system
detection:
    condition: selection
    selection:
        EventID:
          - "6038"
          - "6039"
        Provider_Name: LsaSrv
falsepositives: Environments that use NTLMv1
level: medium
customer: 'demo'
modified: 2023/06/06
tags:
  - attack.defense_evasion
  - attack.lateral_movement
  - attack.t1550.002
  - DEMO
