
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: ProcessHacker Privilege Elevation
id: c4ff1eac-84ad-44dd-a6fb-d56a92fc43a9
status: test
description: Detects a ProcessHacker tool that elevated privileges to a very high
    level
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/05/27 15:03:11
references:
  - https://twitter.com/1kwpeter/status/1397816101455765504
logsource:
    product: windows
    service: system
detection:
    condition: selection
    selection:
        AccountName: LocalSystem
        EventID: "7045"
        Provider_Name: Service Control Manager
        ServiceName|startswith: ProcessHacker
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2022/12/25
tags:
  - attack.execution
  - attack.privilege_escalation
  - attack.t1543.003
  - attack.t1569.002
  - DEMO
