
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Credential Dumping Tools Service Execution - System
id: 4976aa50-8f41-45c6-8b15-ab3fc10e79ed
status: test
description: Detects well-known credential dumping tools execution via service execution
    events
author: Florian Roth (Nextron Systems), Teymur Kheirkhabarov, Daniil Yugoslavskiy,
    oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/03/05 19:23:51
references:
  - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
logsource:
    product: windows
    service: system
detection:
    condition: selection
    selection:
        EventID: "7045"
        ImagePath|contains:
          - cachedump
          - dumpsvc
          - fgexec
          - gsecdump
          - mimidrv
          - pwdump
          - servpw
        Provider_Name: Service Control Manager
falsepositives: Legitimate Administrator using credential dumping tool for password
    recovery
level: high
customer: 'demo'
modified: 2022/11/29
tags:
  - attack.credential_access
  - attack.execution
  - attack.t1003.001
  - attack.t1003.002
  - attack.t1003.004
  - attack.t1003.005
  - attack.t1003.006
  - attack.t1569.002
  - attack.s0005
  - DEMO
