
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Tap Driver Installation
id: 8e4cf0e5-aa5d-4dc3-beff-dc26917744a9
status: test
description: Well-known TAP software installation. Possible preparation for data exfiltration
    using tunnelling techniques
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/24 12:13:51
references:
  - https://community.openvpn.net/openvpn/wiki/ManagingWindowsTAPDrivers
logsource:
    product: windows
    service: system
detection:
    condition: selection
    selection:
        EventID: "7045"
        ImagePath|contains: tap0901
        Provider_Name: Service Control Manager
falsepositives: Legitimate OpenVPN TAP installation
level: medium
customer: 'demo'
modified: 2022/12/25
tags:
  - attack.exfiltration
  - attack.t1048
  - DEMO
