
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: MSSQL SPProcoption Set
id: b3d57a5c-c92e-4b48-9a79-5f124b7cf964
status: test
description: Detects when the a stored procedure is set or cleared for automatic execution
    in MSSQL. A stored procedure that is set to automatic execution runs every time
    an instance of SQL Server is started
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/13 11:32:41
references:
  - https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
  - https://docs.microsoft.com/en-us/sql/relational-databases/system-stored-procedures/sp-procoption-transact-sql?view=sql-server-ver16
logsource:
    product: windows
    service: application
    definition: MSSQL audit policy to monitor for 'sp_procoption' must be enabled
        in order to receive this event in the application log
detection:
    condition: selection
    selection:
        Data|contains|all:
          - object_name:sp_procoption
          - statement:EXEC
        EventID: "33205"
        Provider_Name: MSSQLSERVER
falsepositives: Legitimate use of the feature by administrators (rare)
level: high
customer: 'demo'
tags:
  - attack.persistence
  - DEMO
