
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: MSI Installation From Web
id: 5594e67a-7f92-4a04-b65d-1a42fd824a60
status: test
description: Detects installation of a remote msi file from web.
author: Stamatis Chatzimangou
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/23 12:20:51
references:
  - https://twitter.com/_st0pp3r_/status/1583922009842802689
logsource:
    product: windows
    service: application
detection:
    condition: selection
    selection:
        Data|contains: ://
        EventID:
          - "1040"
          - "1042"
        Provider_Name: MsiInstaller
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/10/23
tags:
  - attack.execution
  - attack.t1218
  - attack.t1218.007
  - DEMO
