
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Audit CVE Event
id: 48d91a3a-2363-43ba-a456-ca71ac3da5c2
status: test
description: |
    Detects events generated by user-mode applications when they call the CveEventWrite API when a known vulnerability is trying to be exploited.
    MS started using this log in Jan. 2020 with CVE-2020-0601 (a Windows CryptoAPI vulnerability.
    Unfortunately, that is about the only instance of CVEs being written to this log.
author: Florian Roth (Nextron Systems), Zach Mathis
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/01/15 09:37:11
references:
  - https://twitter.com/VM_vivisector/status/1217190929330655232
  - https://twitter.com/DidierStevens/status/1217533958096924676
  - https://twitter.com/FlemmingRiis/status/1217147415482060800
  - https://www.youtube.com/watch?v=ebmW42YYveI
  - https://nullsec.us/windows-event-log-audit-cve/
logsource:
    product: windows
    service: application
detection:
    condition: selection
    selection:
        EventID: "1"
        Provider_Name:
          - Microsoft-Windows-Audit-CVE
          - Audit-CVE
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2022/10/22
tags:
  - attack.execution
  - attack.t1203
  - attack.privilege_escalation
  - attack.t1068
  - attack.defense_evasion
  - attack.t1211
  - attack.credential_access
  - attack.t1212
  - attack.lateral_movement
  - attack.t1210
  - attack.impact
  - attack.t1499.004
  - DEMO
