
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: MSSQL Disable Audit Settings
id: 350dfb37-3706-4cdc-9e2e-5e24bc3a46df
status: test
description: Detects when an attacker calls the "ALTER SERVER AUDIT" or "DROP SERVER
    AUDIT" transaction in order to delete or disable audit logs on the server
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/13 13:03:21
references:
  - https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
  - https://docs.microsoft.com/en-us/sql/t-sql/statements/drop-server-audit-transact-sql?view=sql-server-ver16
  - https://docs.microsoft.com/en-us/sql/t-sql/statements/alter-server-audit-transact-sql?view=sql-server-ver16
logsource:
    product: windows
    service: application
    definition: MSSQL audit policy must be enabled in order to receive this event
        in the application log
detection:
    condition: selection
    selection:
        Data|contains:
          - statement:ALTER SERVER AUDIT
          - statement:DROP SERVER AUDIT
        EventID: "33205"
        Provider_Name: MSSQLSERVER
falsepositives: This event should only fire when an administrator is modifying the
    audit policy. Which should be a rare occurrence once it's set up
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - DEMO
