
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: MSSQL Add Account To Sysadmin Role
id: 08200f85-2678-463e-9c32-88dce2f073d1
status: test
description: Detects when an attacker tries to backdoor the MSSQL server by adding
    a backdoor account to the sysadmin fixed server role
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/13 14:16:31
references:
  - https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
logsource:
    product: windows
    service: application
    definition: MSSQL audit policy must be enabled in order to receive this event
        in the application log
detection:
    condition: selection
    selection:
        Data|contains|all:
          - object_name:sysadmin
          - 'statement:alter server role [sysadmin] add member '
        EventID: "33205"
        Provider_Name: MSSQLSERVER
falsepositives: Rare legitimate administrative activity
level: high
customer: 'demo'
tags:
  - attack.persistence
  - DEMO
