
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Commands to Clear or Remove the Syslog - Builtin
id: e09eb557-96d2-4de9-ba2d-30f712a5afd3
status: test
description: Detects specific commands commonly used to remove or empty the syslog
author: Max Altgelt (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/09/10 18:08:11
references:
  - https://www.virustotal.com/gui/file/fc614fb4bda24ae8ca2c44e812d12c0fab6dd7a097472a35dd12ded053ab8474
logsource:
    product: linux
detection:
    condition: selection and not falsepositives
    falsepositives: /syslog.
    selection:
      - rm /var/log/syslog
      - rm -r /var/log/syslog
      - rm -f /var/log/syslog
      - rm -rf /var/log/syslog
      - mv /var/log/syslog
      - ' >/var/log/syslog'
      - ' > /var/log/syslog'
falsepositives: Log rotation
level: high
customer: 'demo'
modified: 2022/11/26
tags:
  - attack.impact
  - attack.t1565.001
  - DEMO
