
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: JexBoss Command Sequence
id: 8ec2c8b4-557a-4121-b87c-5dfb3a602fae
status: test
description: Detects suspicious command sequence that JexBoss
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/08/24 12:22:21
references:
  - https://www.us-cert.gov/ncas/analysis-reports/AR18-312A
logsource:
    product: linux
detection:
    condition: all of selection*
    selection1: bash -c /bin/bash
    selection2: '&/dev/tcp/'
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/07/07
tags:
  - attack.execution
  - attack.t1059.004
  - DEMO
