
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Clear Command History
id: fdc88d25-96fb-4b7c-9633-c0e417fdbd4e
status: test
description: Clear command history in linux which is used for defense evasion.
author: Patrick Bareiss
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/03/24 11:34:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.003/T1070.003.md
  - https://www.hackers-arise.com/post/2016/06/20/covering-your-bash-shell-tracks-antiforensics
logsource:
    product: linux
detection:
    condition: keywords
    keywords:
      - rm *bash_history
      - echo "" > *bash_history
      - cat /dev/null > *bash_history
      - cat /dev/zero > *bash_history
      - ln -sf /dev/null *bash_history
      - ln -sf /dev/zero *bash_history
      - truncate -s0 *bash_history
      - export HISTFILESIZE=0
      - history -c
      - history -w
      - shred *bash_history
      - empty_bash_history
      - chattr +i *bash_history
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/12/25
tags:
  - attack.defense_evasion
  - attack.t1070.003
  - DEMO
