
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Code Injection by ld.so Preload
id: 7e3c4651-c347-40c4-b1d4-d48590fdf684
status: test
description: Detects the ld.so preload persistence file. See `man ld.so` for more
    information.
author: Christian Burkard (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/05/05 13:54:41
references:
  - https://man7.org/linux/man-pages/man8/ld.so.8.html
logsource:
    product: linux
detection:
    condition: keywords
    keywords: /etc/ld.so.preload
falsepositives: Rare temporary workaround for library misconfiguration
level: high
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1574.006
  - DEMO
