
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Use of /dev/tcp
id: 6cc5fceb-9a71-4c23-aeeb-963abe0b279c
status: test
description: Detects suspicious command with /dev/tcp
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/10 12:44:51
references:
  - https://www.andreafortuna.org/2021/03/06/some-useful-tips-about-dev-tcp/
  - https://book.hacktricks.xyz/shells/shells/linux
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md#atomic-test-1---port-scan
logsource:
    product: linux
detection:
    condition: keywords
    keywords:
      - cat </dev/tcp/
      - exec 3<>/dev/tcp/
      - echo >/dev/tcp/
      - bash -i >& /dev/tcp/
      - sh -i >& /dev/udp/
      - 0<&196;exec 196<>/dev/tcp/
      - exec 5<>/dev/tcp/
      - (sh)0>/dev/tcp/
      - bash -c 'bash -i >& /dev/tcp/
      - echo -e '#!/bin/bash\nbash -i >& /dev/tcp/
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/01/06
tags:
  - attack.reconnaissance
  - DEMO
