
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: New Federated Domain Added - Exchange
id: 42127bdd-9133-474f-a6f1-97b6c08a4339
related:
  - type: similar
    id: 58f88172-a73d-442b-94c9-95eaed3cbb36
status: test
description: Detects the addition of a new Federated Domain.
author: Splunk Threat Research Team (original rule), '@ionsor (rule)'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/08 15:05:21
references:
  - https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/wp-m-unc2452-2021-000343-01.pdf
  - https://us-cert.cisa.gov/ncas/alerts/aa21-008a
  - https://www.splunk.com/en_us/blog/security/a-golden-saml-journey-solarwinds-continued.html
  - https://www.sygnia.co/golden-saml-advisory
  - https://o365blog.com/post/aadbackdoor/
logsource:
    product: m365
    service: exchange
detection:
    condition: selection
    selection:
        eventName: Add-FederatedDomain
        eventSource: Exchange
        status: success
falsepositives: The creation of a new Federated domain is not necessarily malicious,
    however these events need to be followed closely, as it may indicate federated
    credential abuse or backdoor via federated identities at a similar or different
    cloud provider.
level: medium
customer: 'demo'
tags:
  - attack.persistence
  - attack.t1136.003
  - DEMO
