
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Invoke-Obfuscation Obfuscated IEX Invocation - System
id: 51aa9387-1c53-4153-91cc-d73c59ae1ca9
status: test
description: Detects all variations of obfuscated powershell IEX invocation code generated
    by Invoke-Obfuscation framework from the code block linked in the references
author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/11/08 19:48:01
references:
  - https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888
logsource:
    product: windows
    service: system
detection:
    condition: all of selection_*
    selection_eid:
        EventID: "7045"
    selection_imagepath:
      - ImagePath|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
      - ImagePath|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
      - ImagePath|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
      - ImagePath|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
      - ImagePath|re: \\*mdr\*\W\s*\)\.Name
      - ImagePath|re: \$VerbosePreference\.ToString\(
      - ImagePath|re: \String\]\s*\$VerbosePreference
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/11/27
tags:
  - attack.defense_evasion
  - attack.t1027
  - DEMO
