
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: StoneDrill Service Install
id: 9e987c6c-4c1e-40d8-bd85-dd26fba8fdd6
status: test
description: This method detects a service install of the malicious Microsoft Network
    Realtime Inspection Service service described in StoneDrill report by Kaspersky
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/03/07 13:02:41
references:
  - https://securelist.com/blog/research/77725/from-shamoon-to-stonedrill/
logsource:
    product: windows
    service: system
detection:
    condition: selection
    selection:
        EventID: "7045"
        ImagePath|endswith: ' LocalService'
        Provider_Name: Service Control Manager
        ServiceName: NtsSrv
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2021/11/30
tags:
  - attack.persistence
  - attack.g0064
  - attack.t1543.003
  - detection.emerging_threats
  - DEMO
