
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Important Windows Eventlog Cleared
id: 100ef69e-3327-481c-8e5c-6d80d9507556
related:
  - type: derived
    id: a62b37e0-45d3-48d9-a517-90c1a1b0186b
status: experimental
description: Detects the clearing of one of the Windows Core Eventlogs. e.g. caused
    by "wevtutil cl" command execution
author: Florian Roth (Nextron Systems), Tim Shelton, Nasreddine Bencherchali (Nextron
    Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/05/17 15:14:11
references:
  - https://twitter.com/deviouspolack/status/832535435960209408
  - https://www.hybrid-analysis.com/sample/027cc450ef5f8c5f653329641ec1fed91f694e0d229928963b30f6b0d7d3a745?environmentId=100
logsource:
    product: windows
    service: system
detection:
    condition: selection
    selection:
        Channel:
          - Microsoft-Windows-PowerShell/Operational
          - Microsoft-Windows-Sysmon/Operational
          - PowerShellCore/Operational
          - Security
          - System
          - Windows PowerShell
        EventID: "104"
        Provider_Name: Microsoft-Windows-Eventlog
falsepositives:
  - Rollout of log collection agents (the setup routine often includes a reset of
    the local Eventlog)
  - System provisioning (system reset before the golden image creation)
level: high
customer: 'demo'
modified: 2023/11/15
tags:
  - attack.defense_evasion
  - attack.t1070.001
  - car.2016-04-002
  - DEMO
