
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Windows Service Terminated With Error
id: acfa2210-0d71-4eeb-b477-afab494d596c
related:
  - type: similar
    id: d6b5520d-3934-48b4-928c-2aa3f92d6963
status: test
description: Detects Windows services that got terminated for whatever reason
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/14 15:54:31
references:
  - https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
logsource:
    product: windows
    service: system
detection:
    condition: selection
    selection:
        EventID: "7023"
        Provider_Name: Service Control Manager
falsepositives: False positives could occur since service termination could happen
    due to multiple reasons
level: low
customer: 'demo'
tags:
  - attack.defense_evasion
  - DEMO
