
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: smbexec.py Service Installation
id: 52a85084-6989-40c3-8f32-091e12e13f09
status: test
description: Detects the use of smbexec.py tool by detecting a specific service installation
author: Omer Faruk Celik
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/03/20 14:32:11
references:
  - https://blog.ropnop.com/using-credentials-to-own-windows-boxes-part-2-psexec-and-services/
  - https://github.com/fortra/impacket/blob/33058eb2fde6976ea62e04bc7d6b629d64d44712/examples/smbexec.py#L286-L296
  - https://github.com/fortra/impacket/blob/edef71f17bc1240f9f8c957bbda98662951ac3ec/examples/smbexec.py#L60
logsource:
    product: windows
    service: system
detection:
    condition: selection_eid and 1 of selection_service_*
    selection_eid:
        EventID: "7045"
        Provider_Name: Service Control Manager
    selection_service_image:
        ImagePath|contains:
          - '.bat & del '
          - __output 2^>^&1 >
    selection_service_name:
        ServiceName: BTOBTO
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/11/09
tags:
  - attack.lateral_movement
  - attack.execution
  - attack.t1021.002
  - attack.t1569.002
  - DEMO
