
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Service Installation in Suspicious Folder
id: 5e993621-67d4-488a-b9ae-b420d08b96cb
status: test
description: Detects service installation in suspicious folder appdata
author: pH-T (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/18 17:08:51
references:
  - Internal Research
logsource:
    product: windows
    service: system
detection:
    condition: selection and not 1 of filter_optional_*
    filter_optional_zoom:
        ImagePath|contains: :\Program Files\Common Files\Zoom\Support\CptService.exe
        ServiceName: Zoom Sharing Service
    selection:
        EventID: "7045"
        ImagePath|contains:
          - \AppData\
          - \\\\127.0.0.1
          - \\\\localhost
        Provider_Name: Service Control Manager
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2024/01/18
tags:
  - attack.persistence
  - attack.privilege_escalation
  - car.2013-09-005
  - attack.t1543.003
  - DEMO
