
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Service Installation
id: 1d61f71d-59d2-479e-9562-4ff5f4ead16b
related:
  - type: obsoletes
    id: ca83e9f3-657a-45d0-88d6-c1ac280caf53
  - type: similar
    id: 26481afe-db26-4228-b264-25a29fe6efc7
status: test
description: Detects suspicious service installation commands
author: pH-T (Nextron Systems), Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/18 14:41:41
references:
  - Internal Research
logsource:
    product: windows
    service: system
detection:
    condition: selection
    selection:
        EventID: "7045"
        ImagePath|contains:
          - ' -nop '
          - ' -sta '
          - ' -w hidden '
          - :\Temp\
          - .downloadfile(
          - .downloadstring(
          - \ADMIN$\
          - \Perflogs\
          - '&&'
        Provider_Name: Service Control Manager
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/12/04
tags:
  - attack.persistence
  - attack.privilege_escalation
  - car.2013-09-005
  - attack.t1543.003
  - DEMO
