
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Certificate Exported From Local Certificate Store
id: 58c0bff0-40a0-46e8-b5e8-b734b84d2017
status: experimental
description: Detects when an application exports a certificate (and potentially the
    private key as well) from the local Windows certificate store.
author: Zach Mathis
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/13 18:58:11
references:
  - https://www.splunk.com/en_us/blog/security/breaking-the-chain-defending-against-certificate-services-abuse.html
logsource:
    product: windows
    service: certificateservicesclient-lifecycle-system
detection:
    condition: selection
    selection:
        EventID: "1007"
falsepositives: Legitimate application requesting certificate exports will trigger
    this. Apply additional filters as needed
level: medium
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1649
  - DEMO
