
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-06-21 19:00
# Generated for User: demo
# Number of Rules: 3228
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Uncommon Process Access Rights For Target Image
id: a24e5861-c6ca-4fde-a93c-ba9256feddf0
status: experimental
description: |
    Detects process access request to uncommon target images with a "PROCESS_ALL_ACCESS" access mask.
author: Nasreddine Bencherchali (Nextron Systems), frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/05/27 18:10:31
references:
  - https://learn.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights
logsource:
    category: process_access
    product: windows
detection:
    condition: selection
    selection:
        GrantedAccess: "0x1FFFFF"
        TargetImage|endswith:
          - \calc.exe
          - \calculator.exe
          - \mspaint.exe
          - \notepad.exe
          - \ping.exe
          - \wordpad.exe
          - \write.exe
falsepositives: Unknown
level: low
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1055.011
  - DEMO
