
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Credential Dumping Activity By Python Based Tool
id: f8be3e82-46a3-4e4e-ada5-8e538ae8b9c9
related:
  - type: obsoletes
    id: 4b9a8556-99c4-470b-a40c-9c8d02c77ed0
  - type: obsoletes
    id: 7186e989-4ed7-4f4e-a656-4674b9e3e48b
status: stable
description: Detects LSASS process access for potential credential dumping by a Python-like
    tool such as LaZagne or Pypykatz.
author: Bhabesh Raj, Jonhnathan Ribeiro
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/11/27 18:30:21
references:
  - https://twitter.com/bh4b3sh/status/1303674603819081728
  - https://github.com/skelsec/pypykatz
logsource:
    category: process_access
    product: windows
detection:
    condition: selection
    selection:
        CallTrace|contains:
          - python27.dll+
          - python3*.dll+
        CallTrace|contains|all:
          - _ctypes.pyd+
          - :\Windows\System32\KERNELBASE.dll+
          - :\Windows\SYSTEM32\ntdll.dll+
        GrantedAccess: "0x1FFFFF"
        TargetImage|endswith: \lsass.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/11/29
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.s0349
  - DEMO
