
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Credential Dumping Attempt Via WerFault
id: e5b33f7d-eb93-48b6-9851-09e1e610b6d7
status: test
description: Detects process LSASS memory dump using Mimikatz, NanoDump, Invoke-Mimikatz,
    Procdump or Taskmgr based on the CallTrace pointing to ntdll.dll, dbghelp.dll
    or dbgcore.dll for win10, server2016 and up.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2012/06/27 16:17:21
references:
  - https://github.com/helpsystems/nanodump/commit/578116faea3d278d53d70ea932e2bbfe42569507
logsource:
    category: process_access
    product: windows
detection:
    condition: selection
    selection:
        GrantedAccess: "0x1FFFFF"
        SourceImage|endswith: \WerFault.exe
        TargetImage|endswith: \lsass.exe
falsepositives:
  - Actual failures in lsass.exe that trigger a crash dump (unlikely)
  - Unknown cases in which WerFault accesses lsass.exe
level: high
customer: 'demo'
modified: 2023/11/29
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.s0002
  - DEMO
