
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Lsass Memory Dump via Comsvcs DLL
id: a49fa4d5-11db-418c-8473-1e014a8dd462
status: test
description: Detects adversaries leveraging the MiniDump export function from comsvcs.dll
    via rundll32 to perform a memory dump from lsass.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/20 14:18:31
references:
  - https://twitter.com/shantanukhande/status/1229348874298388484
  - https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/
logsource:
    category: process_access
    product: windows
detection:
    condition: selection
    selection:
        CallTrace|contains: comsvcs.dll
        SourceImage|endswith: \rundll32.exe
        TargetImage|endswith: \lsass.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/11/29
tags:
  - attack.credential_access
  - attack.t1003.001
  - DEMO
