
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: LSASS Memory Access by Tool With Dump Keyword In Name
id: 9bd012ee-0dff-44d7-84a0-aa698cfd87a3
status: test
description: Detects LSASS process access requests from a source process with the
    "dump" keyword in its image name.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/10 18:57:31
references:
  - https://twitter.com/_xpn_/status/1491557187168178176
  - https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz
logsource:
    category: process_access
    product: windows
detection:
    condition: selection
    selection:
        GrantedAccess|endswith:
          - "10"
          - "30"
          - "50"
          - "70"
          - "90"
          - B0
          - D0
          - F0
          - "18"
          - "38"
          - "58"
          - "78"
          - "98"
          - B8
          - D8
          - F8
          - 1A
          - 3A
          - 5A
          - 7A
          - 9A
          - BA
          - DA
          - FA
          - "0x14C2"
          - FF
        SourceImage|contains: dump
        TargetImage|endswith: \lsass.exe
falsepositives: Rare programs that contain the word dump in their name and access
    lsass
level: high
customer: 'demo'
modified: 2023/11/29
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.s0002
  - DEMO
