
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Credential Dumping Activity Via LSASS
id: 5ef9853e-4d0e-4a70-846f-a9ca37d876da
status: experimental
description: |
    Detects process access requests to the LSASS process with specific call trace calls and access masks.
    This behaviour is expressed by many credential dumping tools such as Mimikatz, NanoDump, Invoke-Mimikatz, Procdump and even the Taskmgr dumping feature.
author: Samir Bousseaden, Michael Haag
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/04/03 18:08:21
references:
  - https://blog.menasec.net/2019/02/threat-hunting-21-procdump-or-taskmgr.html
  - https://web.archive.org/web/20230208123920/https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.001/T1003.001.md
  - https://research.splunk.com/endpoint/windows_possible_credential_dumping/
logsource:
    category: process_access
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_system_user:
        SourceUser|contains:
          - AUTHORI
          - AUTORI
    filter_optional_sysmon:
        SourceImage|endswith: :\Windows\Sysmon64.exe
    filter_optional_thor:
        CallTrace|contains|all:
          - :\Windows\Temp\asgard2-agent\
          - \thor\thor64.exe+
          - '|UNKNOWN('
        GrantedAccess: "0x103800"
    selection:
        CallTrace|contains:
          - dbgcore.dll
          - dbghelp.dll
          - kernel32.dll
          - kernelbase.dll
          - ntdll.dll
        GrantedAccess|contains:
          - "0x1038"
          - "0x1438"
          - "0x143a"
          - "0x1fffff"
        TargetImage|endswith: \lsass.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2024/03/02
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.s0002
  - DEMO
