
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: WMI Persistence
id: 0b7889b4-5577-4521-a60a-3376ee7f9f7b
status: test
description: Detects suspicious WMI event filter and command line event consumer based
    on WMI and Security Logs.
author: Florian Roth (Nextron Systems), Gleb Sukhodolskiy, Timur Zinniatullin oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/08/22 09:57:41
references:
  - https://twitter.com/mattifestation/status/899646620148539397
  - https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
logsource:
    product: windows
    service: wmi
    definition: WMI Namespaces Auditing and SACL should be configured, EventID 5861
        and 5859 detection requires Windows 10, 2012 and higher
detection:
    condition: ( (wmi_filter_to_consumer_binding and consumer_keywords) or (wmi_filter_registration)
        ) and not filter_scmevent
    consumer_keywords:
      - ActiveScriptEventConsumer
      - CommandLineEventConsumer
      - CommandLineTemplate
    filter_scmevent:
        PossibleCause: Permanent
        Provider: SCM Event Provider
        Query: select * from MSFT_SCMEventLogEvent
        User: S-1-5-32-544
    wmi_filter_registration:
        EventID: "5859"
    wmi_filter_to_consumer_binding:
        EventID: "5861"
falsepositives: Unknown (data set is too small; further testing needed)
level: medium
customer: 'demo'
modified: 2022/02/10
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1546.003
  - DEMO
