
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Java Class Proxy Download
id: 53c15703-b04c-42bb-9055-1937ddfb3392
status: test
description: Detects Java class download in proxy logs, e.g. used in Log4shell exploitation
    attacks against Log4j.
author: Andreas Hunkeler (@Karneades)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/21 12:32:21
references:
  - https://www.lunasec.io/docs/blog/log4j-zero-day/
logsource:
    category: proxy
detection:
    condition: selection
    selection:
        c-uri|endswith: .class
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/12/25
tags:
  - attack.initial_access
  - DEMO
