
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Exploit Framework User Agent
id: fdd1bfb5-f60b-4a35-910e-f36ed3d0b32f
status: test
description: Detects suspicious user agent strings used by exploit / pentest frameworks
    like Metasploit in proxy logs
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/07/08 13:28:11
references:
  - https://blog.didierstevens.com/2015/03/16/quickpost-metasploit-user-agent-strings/
logsource:
    category: proxy
detection:
    condition: selection
    selection:
        c-useragent:
          - Internet Explorer *
          - Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; InfoPath.2)
          - Mozilla/4.0 (compatible; Metasploit RSPEC)
          - Mozilla/4.0 (compatible; MSIE 6.1; Windows NT)
          - Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1)
          - Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.0)
          - Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.0; Trident/4.0)
          - Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.0; Trident/4.0; SIMBAR={7DB0F6DE-8DE7-4841-9084-28FA914B0F2E};
            SLCC1; .N
          - Mozilla/5.0 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)
          - Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US) AppleWebKit/525.13 (KHTML,
            like Gecko) Chrome/4.0.221.6 Safari/525.13
          - Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; WOW64; Trident/5.0;
            MAAU)
          - Mozilla/5.0
          - Mozilla/4.0 (compatible; SPIPE/1.0
          - Mozilla/5.0 (Windows NT 6.3; rv:39.0) Gecko/20100101 Firefox/35.0
          - Sametime Community Agent
          - X-FORWARDED-FOR
          - DotDotPwn v2.1
          - SIPDROID
          - Mozilla/5.0 (Windows NT 10.0; Win32; x32; rv:60.0)
          - Mozilla/6.0 (X11; Linux x86_64; rv:24.0) Gecko/20140205     Firefox/27.0
            Iceweasel/25.3.0
          - '*wordpress hash grabber*'
          - '*exploit*'
fields:
  - ClientIP
  - c-uri
  - c-useragent
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.command_and_control
  - attack.t1071.001
  - DEMO
