
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Windows WebDAV User Agent
id: e09aed7a-09e0-4c9a-90dd-f0d52507347e
status: test
description: Detects WebDav DownloadCradle
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/04/06 12:16:21
references:
  - https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
logsource:
    category: proxy
detection:
    condition: selection
    selection:
        c-useragent|startswith: Microsoft-WebDAV-MiniRedir/
        cs-method: GET
fields:
  - ClientIP
  - c-uri
  - c-useragent
  - cs-method
falsepositives:
  - Administrative scripts that download files from the Internet
  - Administrative scripts that retrieve certain website contents
  - Legitimate WebDAV administration
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.command_and_control
  - attack.t1071.001
  - DEMO
