
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: CobaltStrike Malleable Amazon Browsing Traffic Profile
id: 953b895e-5cc9-454b-b183-7f3db555452e
status: test
description: Detects Malleable Amazon Profile
author: Markus Neis
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/11/12 20:19:51
references:
  - https://github.com/rsmudge/Malleable-C2-Profiles/blob/26323784672913923d20c5a638c6ca79459e8529/normal/amazon.profile
  - https://www.hybrid-analysis.com/sample/ee5eca8648e45e2fea9dac0d920ef1a1792d8690c41ee7f20343de1927cc88b9?environmentId=100
logsource:
    category: proxy
detection:
    condition: 1 of selection_*
    selection_1:
        c-uri: /s/ref=nb_sb_noss_1/167-3294888-0262949/field-keywords=books
        c-useragent: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like
            Gecko
        cs-cookie|endswith: =csm-hit=s-24KU11BB82RZSYGJ3BDK|1419899012996
        cs-host: www.amazon.com
        cs-method: GET
    selection_2:
        c-uri: /N4215/adj/amzn.us.sr.aps
        c-useragent: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like
            Gecko
        cs-host: www.amazon.com
        cs-method: POST
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/07/07
tags:
  - attack.defense_evasion
  - attack.command_and_control
  - attack.t1071.001
  - DEMO
