
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious User Agent
id: 7195a772-4b3f-43a4-a210-6a003d65caa1
status: test
description: Detects suspicious malformed user agent strings in proxy logs
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/07/08 11:42:11
references:
  - https://github.com/fastly/waf_testbed/blob/8bfc406551f3045e418cbaad7596cff8da331dfc/templates/default/scanners-user-agents.data.erb
logsource:
    category: proxy
detection:
    condition: 1 of selection* and not falsepositives
    falsepositives:
      - c-useragent: Mozilla/3.0 * Acrobat *
      - cs-host|endswith:
          - .acrobat.com
          - .adobe.com
          - .adobe.io
    selection1:
        c-useragent|startswith:
          - user-agent
          - 'Mozilla/3.0 '
          - 'Mozilla/2.0 '
          - 'Mozilla/1.0 '
          - 'Mozilla '
          - ' Mozilla/'
          - Mozila/
          - Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol
    selection2:
        c-useragent|contains:
          - ' (compatible;MSIE '
          - '.0;Windows NT '
          - loader
    selection3:
        c-useragent:
          - _
          - CertUtil URL Agent
          - Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:60.0)
          - Mozilla/5.0 (Windows NT 6.3; WOW64; rv:28.0) Gecko/20100101 Firefox/28.0
          - HTTPS
          - Erbium-UA-4ce7c27cb4be9d32e333bf032c88235a
          - x
          - xxx
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/10/31
tags:
  - attack.command_and_control
  - attack.t1071.001
  - DEMO
