title: Potential Zeus Network Activity
id: 191966d0-21e0-40d7-bc4c-4038b24d40d2
status: experimental
description: Detects potential suspicious network activity related to Zeus malware
references:
    - https://github.com/silence-is-best/c2db
author: X__Junior
date: 2023/01/05
tags:
    - attack.command_and_control
logsource:
    category: proxy
detection:
    selection:
        cs-method: 'GET'
        c-uri|startswith: '/panel/config.bin'
    condition: selection
falsepositives:
    - Unknown
level: medium
