
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PST Export Alert Using New-ComplianceSearchAction
id: 6897cd82-6664-11ed-9022-0242ac120002
related:
  - type: similar
    id: 18b88d08-d73e-4f21-bc25-4b9892a4fdd0
status: test
description: Alert when a user has performed an export to a search using 'New-ComplianceSearchAction'
    with the '-Export' flag. This detection will detect PST export even if the 'eDiscovery
    search or exported' alert is disabled in the O365.This rule will apply to ExchangePowerShell
    usage and from the cloud.
author: Nikita Khalimonenkov
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/11/17 18:47:31
references:
  - https://learn.microsoft.com/en-us/powershell/module/exchange/new-compliancesearchaction?view=exchange-ps
logsource:
    product: m365
    service: threat_management
detection:
    condition: selection
    selection:
        Payload|contains|all:
          - New-ComplianceSearchAction
          - Export
          - pst
        eventSource: SecurityComplianceCenter
falsepositives: Exporting a PST can be done for legitimate purposes by legitimate
    sources, but due to the sensitive nature of PST content, it must be monitored.
level: medium
customer: 'demo'
tags:
  - attack.collection
  - attack.t1114
  - DEMO
