
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Microsoft 365 - User Restricted from Sending Email
id: ff246f56-7f24-402a-baca-b86540e3925c
status: test
description: Detects when a Security Compliance Center reported a user who exceeded
    sending limits of the service policies and because of this has been restricted
    from sending email.
author: austinsonger
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/19 18:26:11
references:
  - https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
  - https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
logsource:
    product: m365
    service: threat_management
detection:
    condition: selection
    selection:
        eventName: User restricted from sending email
        eventSource: SecurityComplianceCenter
        status: success
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.initial_access
  - attack.t1199
  - DEMO
