
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Vulnerable HackSys Extreme Vulnerable Driver Load
id: 295c9289-acee-4503-a571-8eacaef36b28
status: test
description: Detects the load of HackSys Extreme Vulnerable Driver which is an intentionally
    vulnerable Windows driver developed for security enthusiasts to learn and polish
    their exploitation skills at Kernel level and often abused by threat actors
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/18 18:58:01
references:
  - https://github.com/hacksysteam/HackSysExtremeVulnerableDriver
logsource:
    category: driver_load
    product: windows
detection:
    condition: 1 of selection*
    selection_name:
        ImageLoaded|endswith: \HEVD.sys
    selection_other:
        Imphash:
          - f26d0b110873a1c7d8c4f08fbeab89c5
          - c46ea2e651fd5f7f716c8867c6d13594
    selection_sysmon:
        Hashes|contains:
          - IMPHASH=f26d0b110873a1c7d8c4f08fbeab89c5
          - IMPHASH=c46ea2e651fd5f7f716c8867c6d13594
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2022/11/19
tags:
  - attack.privilege_escalation
  - attack.t1543.003
  - DEMO
