title: Microsoft Exchange ProxyNotShell Exploit Traffic
id: 72c31a3d-a63d-444d-82e9-7c39243f5fd5
status: test
description: Detects Microsoft Exchange exploit traffic for CVE-2022-41040 and CVE-2022-41082 (A.K.A ProxyNotShell)
references:
    - https://github.com/testanull/ProxyNotShell-PoC
    - https://twitter.com/testanull/status/1593069258543894528
author: pH-T
date: 2022/11/21
modified: 2023/03/28
tags:
    - attack.execution
logsource:
    category: webserver
detection:
    selection_method:
        cs-method: 'POST'
        sc-status: 200
    selection_uri:
        - cs-uri-query|contains|all:
            - '/powershell/'
            - '/autodiscover.json'
            - '/autodiscover/admin@localhost/'
        - cs-uri-query|contains|all:
            - '/powershell/autodiscover.json'
            - 'x=a'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
