
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Persistence Via DLLPathOverride
id: a1b1fd53-9c4a-444c-bae0-34a330fc7aa8
status: experimental
description: Detects when an attacker adds a new "DLLPathOverride" value to the "Natural
    Language" key in order to achieve persistence which will get invoked by "SearchIndexer.exe"
    process
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/21 16:55:41
references:
  - https://persistence-info.github.io/Data/naturallanguage6.html
  - https://www.hexacorn.com/blog/2018/12/30/beyond-good-ol-run-key-part-98/
logsource:
    category: registry_set
    product: windows
detection:
    condition: all of selection_*
    selection_root:
        TargetObject|contains: \SYSTEM\CurrentControlSet\Control\ContentIndex\Language\
    selection_values:
        TargetObject|contains:
          - \StemmerDLLPathOverride
          - \WBDLLPathOverride
          - \StemmerClass
          - \WBreakerClass
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - DEMO
