
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: New BgInfo.EXE Custom VBScript Registry Configuration
id: 992dd79f-dde8-4bb0-9085-6350ba97cfb3
related:
  - type: similar
    id: cd277474-5c52-4423-a52b-ac2d7969902f
status: experimental
description: Detects setting of a new registry value related to BgInfo configuration,
    which can be abused to execute custom VBScript via "BgInfo.exe"
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/16 19:42:41
references:
  - Internal Research
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        Details|startswith: "4"
        EventType: SetValue
        TargetObject|contains: \Software\Winternals\BGInfo\UserFields\
falsepositives: Legitimate VBScript
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1112
  - DEMO
