
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Blue Mockingbird - Registry
id: 92b0b372-a939-44ed-a11b-5136cf680e27
related:
  - type: derived
    id: c3198a27-23a0-4c2c-af19-e5328d49680e
status: experimental
description: Attempts to detect system changes made by Blue Mockingbird
author: Trent Liffick (@tliffick)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/05/14 12:59:51
references:
  - https://redcanary.com/blog/blue-mockingbird-cryptominer/
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        TargetObject|endswith: \CurrentControlSet\Services\wercplsupport\Parameters\ServiceDll
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.execution
  - attack.t1112
  - attack.t1047
  - DEMO
