
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Execution DLL of Choice Using WAB.EXE
id: fc014922-5def-4da9-a0fc-28c973f41bfb
status: test
description: This rule detects that the path to the DLL written in the registry is
    different from the default one. Launched WAB.exe tries to load the DLL from Registry.
author: oscd.community, Natalia Shornikova
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/13 14:42:41
references:
  - https://github.com/LOLBAS-Project/LOLBAS/blob/8283d8d91552213ded165fd36deb6cb9534cb443/yml/OSBinaries/Wab.yml
  - https://twitter.com/Hexacorn/status/991447379864932352
  - http://www.hexacorn.com/blog/2018/05/01/wab-exe-as-a-lolbin/
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection and not filter
    filter:
        Details: '%CommonProgramFiles%\System\wab32.dll'
    selection:
        TargetObject|endswith: \Software\Microsoft\WAB\DLLPath
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
