
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: VBScript Payload Stored in Registry
id: 46490193-1b22-4c29-bdd6-5bf63907216f
status: experimental
description: Detects VBScript content stored into registry keys as seen being used
    by UNC2452 group
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/03/05 15:13:21
references:
  - https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection and not 1 of filter*
    filter:
        TargetObject|contains: Software\Microsoft\Windows\CurrentVersion\Run
    filter_dotnet:
        Details|contains:
          - \Microsoft.NET\Primary Interop Assemblies\Microsoft.mshtml.dll
          - <\Microsoft.mshtml,fileVersion=
          - _mshtml_dll_
          - <\Microsoft.mshtml,culture=
        Image|endswith: \msiexec.exe
        TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Installer\UserData\
    selection:
        Details|contains:
          - 'vbscript:'
          - 'jscript:'
          - mshtml,
          - RunHTMLApplication
          - Execute(
          - CreateObject
          - window.close
        TargetObject|contains: Software\Microsoft\Windows\CurrentVersion
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - attack.t1547.001
  - DEMO
