
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Disable Windows Firewall by Registry
id: e78c408a-e2ea-43cd-b5ea-51975cf358c0
status: experimental
description: Detect set EnableFirewall to 0 to disable the Windows firewall
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/19 15:37:31
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1562.004/T1562.004.md
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        Details: DWORD (0x00000000)
        TargetObject|endswith:
          - \SOFTWARE\Policies\Microsoft\WindowsFirewall\StandardProfile\EnableFirewall
          - \SOFTWARE\Policies\Microsoft\WindowsFirewall\DomainProfile\EnableFirewall
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.defense_evasion
  - attack.t1562.004
  - DEMO
