
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential EventLog File Location Tampering
id: 0cb8d736-995d-4ce7-a31e-1e8d452a1459
status: experimental
description: Detects tampering with EventLog service "file" key. In order to change
    the default location of an Evtx file. This technique is used to tamper with log
    collection and alerting
author: D3F7A5105
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/02 17:10:01
references:
  - https://learn.microsoft.com/en-us/windows/win32/eventlog/eventlog-key
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection and not filter
    filter:
        Details|contains: \System32\Winevt\Logs\
    selection:
        TargetObject|contains: \SYSTEM\CurrentControlSet\Services\EventLog\
        TargetObject|endswith: \File
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.defense_evasion
  - attack.t1562.002
  - DEMO
