
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Persistence Using DebugPath
id: df4dc653-1029-47ba-8231-3c44238cc0ae
status: experimental
description: Detects potential persistence using Appx DebugPath
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/27 15:59:51
references:
  - https://oddvar.moe/2018/09/06/persistence-using-universal-windows-platform-apps-appx/
  - https://github.com/rootm0s/WinPwnage
logsource:
    category: registry_set
    product: windows
detection:
    condition: 1 of selection_*
    selection_debug:
        TargetObject|contains: Classes\ActivatableClasses\Package\Microsoft.
        TargetObject|endswith: \DebugPath
    selection_default:
        TargetObject|contains: \Software\Microsoft\Windows\CurrentVersion\PackagedAppXDebug\Microsoft.
        TargetObject|endswith: \(Default)
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - attack.t1546.015
  - DEMO
