
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious Desktop Background Change Via Registry
id: 85b88e05-dadc-430b-8a9e-53ff1cd30aae
related:
  - type: similar
    id: 8cbc9475-8d05-4e27-9c32-df960716c701
status: experimental
description: |
    Detects regsitry value settings that would replace the user's desktop background.
    This is a common technique used by malware to change the desktop background to a ransom note or other image.
author: Nasreddine Bencherchali (Nextron Systems), Stephen Lincoln @slincoln-aiq (AttackIQ)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/12/21 22:27:31
references:
  - https://www.attackiq.com/2023/09/20/emulating-rhysida/
  - https://research.checkpoint.com/2023/the-rhysida-ransomware-activity-analysis-and-ties-to-vice-society/
  - https://www.trendmicro.com/en_us/research/23/h/an-overview-of-the-new-rhysida-ransomware.html
  - https://www.virustotal.com/gui/file/a864282fea5a536510ae86c77ce46f7827687783628e4f2ceb5bf2c41b8cd3c6/behavior
  - https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.WindowsDesktop::Wallpaper
  - https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.ControlPanelDisplay::CPL_Personalization_NoDesktopBackgroundUI
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection_keys and 1 of selection_values_* and not 1 of filter_main_*
    filter_main_svchost:
        Image|endswith: \svchost.exe
    selection_keys:
        TargetObject|contains:
          - Control Panel\Desktop
          - CurrentVersion\Policies\ActiveDesktop
          - CurrentVersion\Policies\System
    selection_values_1:
        Details: DWORD (0x00000001)
        TargetObject|endswith: NoChangingWallpaper
    selection_values_2:
        TargetObject|endswith: \Wallpaper
    selection_values_3:
        Details: "2"
        TargetObject|endswith: \WallpaperStyle
falsepositives: Administrative scripts that change the desktop background to a company
    logo or other image.
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.impact
  - attack.t1112
  - attack.t1491.001
  - DEMO
