
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PowerShell Script Execution Policy Enabled
id: 8218c875-90b9-42e2-b60d-0b0069816d10
related:
  - type: derived
    id: fad91067-08c5-4d1a-8d8c-d96a21b37814
status: experimental
description: Detects the enabling of the PowerShell script execution policy. Once
    enabled, this policy allows scripts to be executed.
author: Nasreddine Bencherchali (Nextron Systems), Thurein Oo
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/18 17:13:31
references:
  - https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.PowerShell::EnableScripts
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        Details: DWORD (0x00000001)
        TargetObject|endswith: \Policies\Microsoft\Windows\PowerShell\EnableScripts
falsepositives: Likely
level: low
customer: 'demo'
tags:
  - attack.execution
  - DEMO
