
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Macro Enabled In A Potentially Suspicious Document
id: a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd
related:
  - type: derived
    id: 295a59c1-7b79-4b47-a930-df12c15fc9c2
status: experimental
description: Detects registry changes to Office trust records where the path is located
    in a potentially suspicious location
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/21 19:04:01
references:
  - https://twitter.com/inversecos/status/1494174785621819397
  - Internal Research
logsource:
    category: registry_set
    product: windows
detection:
    condition: all of selection_*
    selection_paths:
        TargetObject|contains:
          - /AppData/Local/Microsoft/Windows/INetCache/
          - /AppData/Local/Temp/
          - /PerfLogs/
          - C:/Users/Public/
          - file:///D:/
          - file:///E:/
    selection_value:
        TargetObject|contains: \Security\Trusted Documents\TrustRecords
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.defense_evasion
  - attack.t1112
  - DEMO
