
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Disable Windows Defender Functionalities Via Registry Keys
id: 0eb46774-f1ab-4a74-8238-1155855f2263
related:
  - type: obsoletes
    id: a64e4198-c1c8-46a5-bc9c-324c86455fd4
  - type: obsoletes
    id: fd115e64-97c7-491f-951c-fc8da7e042fa
status: experimental
description: Detects when attackers or tools disable Windows Defender functionalities
    via the Windows registry
author: AlertIQ, Ján Trenčanský, frack113, Nasreddine Bencherchali, Swachchhanda Shrawan
    Poudel
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/01 21:28:21
references:
  - https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
  - https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105
  - https://admx.help/?Category=Windows_7_2008R2&Policy=Microsoft.Policies.WindowsDefender::SpyNetReporting
  - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
  - https://www.tenforums.com/tutorials/32236-enable-disable-microsoft-defender-pua-protection-windows-10-a.html
  - https://www.tenforums.com/tutorials/105533-enable-disable-windows-defender-exploit-protection-settings.html
  - https://www.tenforums.com/tutorials/123792-turn-off-tamper-protection-microsoft-defender-antivirus.html
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection_main and 1 of selection_dword_*
    selection_dword_0:
        Details: DWORD (0x00000000)
        TargetObject|endswith:
          - \App and Browser protection\DisallowExploitProtectionOverride
          - \Features\TamperProtection
          - \MpEngine\MpEnablePus
          - \PUAProtection
          - \Signature Update\ForceUpdateFromMU
          - \SpyNet\SpynetReporting
          - \SpyNet\SubmitSamplesConsent
          - \Windows Defender Exploit Guard\Controlled Folder Access\EnableControlledFolderAccess
    selection_dword_1:
        Details: DWORD (0x00000001)
        TargetObject|endswith:
          - \DisableAntiSpyware
          - \DisableAntiVirus
          - \Real-Time Protection\DisableBehaviorMonitoring
          - \Real-Time Protection\DisableIntrusionPreventionSystem
          - \Real-Time Protection\DisableIOAVProtection
          - \Real-Time Protection\DisableOnAccessProtection
          - \Real-Time Protection\DisableRealtimeMonitoring
          - \Real-Time Protection\DisableScanOnRealtimeEnable
          - \Real-Time Protection\DisableScriptScanning
          - \Reporting\DisableEnhancedNotifications
          - \SpyNet\DisableBlockAtFirstSeen
    selection_main:
        TargetObject|contains:
          - \SOFTWARE\Microsoft\Windows Defender\
          - \SOFTWARE\Policies\Microsoft\Windows Defender Security Center\
          - \SOFTWARE\Policies\Microsoft\Windows Defender\
falsepositives: Administrator actions via the Windows Defender interface
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - DEMO
