
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: New BgInfo.EXE Custom DB Path Registry Configuration
id: 53330955-dc52-487f-a3a2-da24dcff99b5
status: experimental
description: Detects setting of a new registry database value related to BgInfo configuration.
    Attackers can for example set this value to save the results of the commands executed
    by BgInfo in order to exfiltrate information.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/08/16 19:06:21
references:
  - Internal Research
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        EventType: SetValue
        TargetObject|endswith: \Software\Winternals\BGInfo\Database
falsepositives: Legitimate use of external DB to save the results
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1112
  - DEMO
