
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious ODBC Driver Registered
id: e4d22291-f3d5-4b78-9a0c-a1fbaf32a6a4
status: experimental
description: Detects the registration of a new ODBC driver where the driver is located
    in a potentially suspicious location
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/23 17:59:41
references:
  - https://www.hexacorn.com/blog/2020/08/23/odbcconf-lolbin-trifecta/
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        Details|contains:
          - :\PerfLogs\
          - :\ProgramData\
          - :\Temp\
          - :\Users\Public\
          - :\Windows\Registration\CRMLog
          - :\Windows\System32\com\dmp\
          - :\Windows\System32\FxsTmp\
          - :\Windows\System32\Microsoft\Crypto\RSA\MachineKeys\
          - :\Windows\System32\spool\drivers\color\
          - :\Windows\System32\spool\PRINTERS\
          - :\Windows\System32\spool\SERVERS\
          - :\Windows\System32\Tasks_Migrated\
          - :\Windows\System32\Tasks\Microsoft\Windows\SyncCenter\
          - :\Windows\SysWOW64\com\dmp\
          - :\Windows\SysWOW64\FxsTmp\
          - :\Windows\SysWOW64\Tasks\Microsoft\Windows\PLA\System\
          - :\Windows\SysWOW64\Tasks\Microsoft\Windows\SyncCenter\
          - :\Windows\Tasks\
          - :\Windows\Temp\
          - :\Windows\Tracing\
          - \AppData\Local\Temp\
          - \AppData\Roaming\
        TargetObject|contains: \SOFTWARE\ODBC\ODBCINST.INI\
        TargetObject|endswith:
          - \Driver
          - \Setup
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - attack.t1003
  - DEMO
