
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Wow6432Node Classes Autorun Keys Modification
id: 18f2065c-d36c-464a-a748-bcf909acb2e3
related:
  - type: obsoletes
    id: 17f878b8-9968-4578-b814-c4217fc5768c
status: test
description: Detects modification of autostart extensibility point (ASEP) in registry.
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
    oscd.community, Tim Shelton, frack113 (split)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/25 17:33:21
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
  - https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
  - https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
logsource:
    category: registry_set
    product: windows
detection:
    condition: wow_classes_base and wow_classes and not filter
    filter:
        Details: (Empty)
    wow_classes:
        TargetObject|contains:
          - \Folder\ShellEx\ExtShellFolderViews
          - \Folder\ShellEx\DragDropHandlers
          - \Folder\ShellEx\ColumnHandlers
          - \Directory\Shellex\DragDropHandlers
          - \Directory\Shellex\CopyHookHandlers
          - \CLSID\{AC757296-3522-4E11-9862-C17BE5A1767E}\Instance
          - \CLSID\{ABE3B9A4-257D-4B97-BD1A-294AF496222E}\Instance
          - \CLSID\{7ED96837-96F0-4812-B211-F13C24117ED3}\Instance
          - \CLSID\{083863F1-70DE-11d0-BD40-00A0C911CE86}\Instance
          - \AllFileSystemObjects\ShellEx\DragDropHandlers
          - \ShellEx\PropertySheetHandlers
          - \ShellEx\ContextMenuHandlers
    wow_classes_base:
        TargetObject|contains: \Software\Wow6432Node\Classes
fields:
  - SecurityID
  - ObjectName
  - OldValueType
  - NewValueType
falsepositives:
  - Legitimate software automatically (mostly, during installation) sets up autorun
    keys for legitimate reason
  - Legitimate administrator sets up autorun keys for legitimate reason
level: medium
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - attack.t1547.001
  - DEMO
