
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential PowerShell Execution Policy Tampering
id: fad91067-08c5-4d1a-8d8c-d96a21b37814
related:
  - type: similar
    id: cf2e938e-9a3e-4fe8-a347-411642b28a9f
  - type: similar
    id: 87e3c4e8-a6a8-4ad9-bb4f-46e7ff99a180
  - type: similar
    id: 61d0475c-173f-4844-86f7-f3eebae1c66b
status: experimental
description: Detects changes to the PowerShell execution policy in order to bypass
    signing requirements for script execution
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/11 18:48:01
references:
  - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.3
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_svchost:
        Image|contains:
          - :\Windows\System32\
          - :\Windows\SysWOW64\
    selection:
        Details|contains:
          - Bypass
          - Unrestricted
        TargetObject|endswith:
          - \ShellIds\Microsoft.PowerShell\ExecutionPolicy
          - \Policies\Microsoft\Windows\PowerShell\ExecutionPolicy
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/12/14
tags:
  - attack.defense_evasion
  - DEMO
