
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Change Winevt Event Access Permission Via Registry
id: 7d9263bd-dc47-4a58-bc92-5474abab390c
status: experimental
description: Detects tampering with the "ChannelAccess" registry key in order to change
    access to Windows event channel
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/17 19:08:11
references:
  - https://app.any.run/tasks/77b2e328-8f36-46b2-b2e2-8a80398217ab/
  - https://learn.microsoft.com/en-us/windows/win32/api/winevt/
  - https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection and not 1 of filter*
    filter_ti_worker:
        Image|endswith: \TiWorker.exe
    filter_trustedinstaller:
        Image: C:\Windows\servicing\TrustedInstaller.exe
    selection:
        Details|contains:
          - (A;;0x1;;;SY)
          - (A;;0x5;;;BA)
          - (A;;0x1;;;LA)
        TargetObject|endswith: \ChannelAccess
        TargetObject|startswith: HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\WINEVT\Channels\
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.defense_evasion
  - attack.t1562.002
  - DEMO
