
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Usage of Renamed Sysinternals Tools - RegistrySet
id: 8023f872-3f1d-4301-a384-801889917ab4
related:
  - type: derived
    id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
  - type: similar
    id: f50f3c09-557d-492d-81db-9064a8d4e211
status: experimental
description: Detects non-sysinternals tools setting the "accepteula" key which normally
    is set on sysinternals tool execution
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/24 18:52:01
references:
  - Internal Research
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_image_names:
        Image|endswith:
          - \PsExec.exe
          - \PsExec64.exe
          - \procdump.exe
          - \procdump64.exe
          - \handle.exe
          - \handle64.exe
          - \livekd.exe
          - \livekd64.exe
          - \procexp.exe
          - \procexp64.exe
          - \psloglist.exe
          - \psloglist64.exe
          - \pspasswd.exe
          - \pspasswd64.exe
          - \ADExplorer.exe
          - \ADExplorer64.exe
    filter_optional_null:
        Image: []
    selection:
        TargetObject|contains:
          - \PsExec
          - \ProcDump
          - \Handle
          - \LiveKd
          - \Process Explorer
          - \PsLoglist
          - \PsPasswd
          - \Active Directory Explorer
        TargetObject|endswith: \EulaAccepted
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.resource_development
  - attack.t1588.002
  - DEMO
