
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Sysinternals Tools AppX Versions Execution
id: d29a20b2-be4b-4827-81f2-3d8a59eab5fc
status: experimental
description: Detects execution of Sysinternals tools via an AppX package. Attackers
    could install the Sysinternals Suite to get access to tools such as psexec and
    procdump to avoid detection based on System paths
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/16 17:29:01
references:
  - Internal Research
logsource:
    product: windows
    service: appmodel-runtime
detection:
    condition: selection
    selection:
        EventID: "201"
        ImageName:
          - procdump.exe
          - psloglist.exe
          - psexec.exe
          - livekd.exe
          - ADExplorer.exe
falsepositives: Legitimate usage of the applications from the Windows Store
level: low
customer: 'demo'
modified: 2023/09/12
tags:
  - attack.defense_evasion
  - attack.execution
  - DEMO
