title: New BITS Job Created From Uncommon/Suspicious Location
id: 598932c4-4cb4-4a50-9c58-983663962258
related:
    - id: d48e23fb-9471-4e38-9d2b-dd7016bcb817
      type: similar
status: experimental
description: Detects the creation of a new BITS job by an application located in an uncommon or suspicious location
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/27
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.t1197
logsource:
    product: windows
    service: bits-client
detection:
    selection_eid:
        EventID: 3
    selection_paths:
        - processPath|contains:
            - '\Downloads\'
            - '\Desktop\'
        - processPath|startswith:
            - 'C:\PerfLogs\'
            - 'C:\Windows\' # This could be prone to FP requires further data
            - 'C:\$Recycle.Bin\'
            - 'C:\Users\Public\'
    filter_main_sys_folders:
        processPath|startswith:
            - 'C:\Windows\System32\'
            - 'C:\Windows\SysWOW64\'
    condition: all of selection_* and not 1 of filter_main_*
falsepositives:
    - Unknown
level: medium # TODO: Increase after more testing
