
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: NTLM Brute Force
id: 9c8acf1a-cbf9-4db6-b63c-74baabe03e59
status: test
description: Detects common NTLM brute force device names
author: Jerry Shockley '@jsh0x'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/02 09:51:21
references:
  - https://www.varonis.com/blog/investigate-ntlm-brute-force
logsource:
    product: windows
    service: ntlm
    definition: Requires events from Microsoft-Windows-NTLM/Operational
detection:
    condition: selection and devicename
    devicename:
        WorkstationName:
          - Rdesktop
          - Remmina
          - Freerdp
          - Windows7
          - Windows8
          - Windows2012
          - Windows2016
          - Windows2019
    selection:
        EventID: "8004"
falsepositives: Systems with names equal to the spoofed ones used by the brute force
    tools
level: medium
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1110
  - DEMO
