
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: CobaltStrike Service Installations - Security
id: d7a95147-145f-4678-b85d-d1ff4a3bb3f6
related:
  - type: derived
    id: 5a105d34-05fc-401e-8553-272b45c1522d
status: test
description: Detects known malicious service installs that appear in cases in which
    a Cobalt Strike beacon elevates privileges or lateral movement
author: Florian Roth (Nextron Systems), Wojciech Lesicki
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/05/26 18:05:41
references:
  - https://www.sans.org/webcasts/119395
  - https://www.crowdstrike.com/blog/getting-the-bacon-from-cobalt-strike-beacon/
  - https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/
logsource:
    product: windows
    service: security
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
detection:
    condition: event_id and 1 of selection*
    event_id:
        EventID: "4697"
    selection1:
        ServiceFileName|contains|all:
          - ADMIN$
          - .exe
    selection2:
        ServiceFileName|contains|all:
          - '%COMSPEC%'
          - start
          - powershell
    selection3:
        ServiceFileName|contains: powershell -nop -w hidden -encodedcommand
    selection4:
        ServiceFileName|base64offset|contains: 'IEX (New-Object Net.Webclient).DownloadString(''http://127.0.0.1:'
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/11/27
tags:
  - attack.execution
  - attack.privilege_escalation
  - attack.lateral_movement
  - attack.t1021.002
  - attack.t1543.003
  - attack.t1569.002
  - DEMO
