
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: SCM Database Privileged Operation
id: dae8171c-5ec6-4396-b210-8466585b53e9
status: test
description: Detects non-system users performing privileged operation os the SCM database
author: Roberto Rodriguez @Cyb3rWard0g, Tim Shelton
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/08/15 14:35:21
references:
  - https://threathunterplaybook.com/hunts/windows/190826-RemoteSCMHandle/notebook.html
logsource:
    product: windows
    service: security
detection:
    condition: selection and not filter
    filter:
        ProcessName|endswith: :\Windows\System32\services.exe
        SubjectLogonId: "0x3e4"
    selection:
        EventID: "4674"
        ObjectName: servicesactive
        ObjectType: SC_MANAGER OBJECT
        PrivilegeList: SeTakeOwnershipPrivilege
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/09/18
tags:
  - attack.privilege_escalation
  - attack.t1548
  - DEMO
