
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Remote Logon with Explicit Credentials
id: 941e5c45-cda7-4864-8cea-bbb7458d194a
status: test
description: Detects suspicious processes logging on with explicit credentials
author: oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st,
    Tim Shelton
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/05 19:17:01
references:
  - https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
logsource:
    product: windows
    service: security
detection:
    condition: selection and not 1 of filter*
    filter1:
        TargetServerName: localhost
    filter2:
        SubjectUserName|endswith: $
        TargetUserName|endswith: $
    selection:
        EventID: "4648"
        ProcessName|endswith:
          - \cmd.exe
          - \powershell.exe
          - \pwsh.exe
          - \winrs.exe
          - \wmic.exe
          - \net.exe
          - \net1.exe
          - \reg.exe
falsepositives: Administrators that use the RunAS command or scheduled tasks
level: medium
customer: 'demo'
modified: 2022/08/03
tags:
  - attack.t1078
  - attack.lateral_movement
  - DEMO
