
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Password Protected ZIP File Opened
id: 00ba9da1-b510-4f6b-b258-8d338836180f
status: test
description: Detects the extraction of password protected ZIP archives. See the filename
    variable for more details on which file has been opened.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/05/09 14:44:31
references:
  - https://twitter.com/sbousseaden/status/1523383197513379841
logsource:
    product: windows
    service: security
detection:
    condition: selection and not filter
    filter:
        TargetName|contains: \Temporary Internet Files\Content.Outlook
    selection:
        EventID: "5379"
        TargetName|contains: Microsoft_Windows_Shell_ZipFolder:filename
falsepositives: Legitimate used of encrypted ZIP files
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1027
  - DEMO
