
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Pass the Hash Activity 2
id: 8eef149c-bd26-49f2-9e5a-9b00e3af499b
status: stable
description: Detects the attack technique pass the hash which is used to move laterally
    inside the network
author: Dave Kennedy, Jeff Warren (method) / David Vassallo (rule)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/06/14 11:56:31
references:
  - https://github.com/iadgov/Event-Forwarding-Guidance/tree/master/Events
  - https://blog.binarydefense.com/reliably-detecting-pass-the-hash-through-event-log-analysis
  - https://blog.stealthbits.com/how-to-detect-pass-the-hash-attacks/
logsource:
    product: windows
    service: security
    definition: The successful use of PtH for lateral movement between workstations
        would trigger event ID 4624
detection:
    condition: 1 of selection_* and not filter
    filter:
        TargetUserName: ANONYMOUS LOGON
    selection_logon3:
        EventID: "4624"
        KeyLength: "0"
        LogonProcessName: NtLmSsp
        LogonType: "3"
        SubjectUserSid: S-1-0-0
    selection_logon9:
        EventID: "4624"
        LogonProcessName: seclogo
        LogonType: "9"
falsepositives: Administrator activity
level: medium
customer: 'demo'
modified: 2022/10/05
tags:
  - attack.lateral_movement
  - attack.t1550.002
  - DEMO
