
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: New or Renamed User Account with '$' Character
id: cfeed607-6aa4-4bbd-9627-b637deb723c8
status: test
description: |
    Detects the creation of a user with the "$" character. This can be used by attackers to hide a user or trick detection systems that lack the parsing mechanisms.
author: Ilyas Ochkov, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/25 17:14:21
references:
  - https://twitter.com/SBousseaden/status/1387743867663958021
logsource:
    product: windows
    service: security
detection:
    condition: 1 of selection_* and not 1 of filter_main_*
    filter_main_homegroup:
        EventID: "4720"
        TargetUserName: HomeGroupUser$
    selection_create:
        EventID: "4720"
        SamAccountName|contains: $
    selection_rename:
        EventID: "4781"
        NewTargetUserName|contains: $
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2024/01/16
tags:
  - attack.defense_evasion
  - attack.t1036
  - DEMO
