
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Successful Overpass the Hash Attempt
id: 192a0330-c20b-4356-90b6-7b7049ae0b87
status: test
description: Detects successful logon with logon type 9 (NewCredentials) which matches
    the Overpass the Hash behavior of e.g Mimikatz's sekurlsa::pth module.
author: Roberto Rodriguez (source), Dominik Schaudel (rule)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/02/12 15:39:51
references:
  - https://web.archive.org/web/20220419045003/https://cyberwardog.blogspot.com/2017/04/chronicles-of-threat-hunter-hunting-for.html
logsource:
    product: windows
    service: security
detection:
    condition: selection
    selection:
        AuthenticationPackageName: Negotiate
        EventID: "4624"
        LogonProcessName: seclogo
        LogonType: "9"
falsepositives: Runas command-line tool using /netonly parameter
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.lateral_movement
  - attack.s0002
  - attack.t1550.002
  - DEMO
