
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Impacket PsExec Execution
id: 32d56ea1-417f-44ff-822b-882873f5f43b
status: test
description: Detects execution of Impacket's psexec.py.
author: Bhabesh Raj
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/12/14 12:41:41
references:
  - https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html
logsource:
    product: windows
    service: security
    definition: The advanced audit policy setting "Object Access > Audit Detailed
        File Share" must be configured for Success/Failure
detection:
    condition: selection1
    selection1:
        EventID: "5145"
        RelativeTargetName|contains:
          - RemCom_stdin
          - RemCom_stdout
          - RemCom_stderr
        ShareName: \\\\\*\\IPC$
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/09/22
tags:
  - attack.lateral_movement
  - attack.t1021.002
  - DEMO
