
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Possible Shadow Credentials Added
id: f598ea0c-c25a-4f72-a219-50c44411c791
status: test
description: Detects possible addition of shadow credentials to an active directory
    object.
author: Nasreddine Bencherchali (Nextron Systems), Elastic (idea)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/17 14:43:51
references:
  - https://www.elastic.co/guide/en/security/8.4/potential-shadow-credentials-added-to-ad-object.html
  - https://cyberstoph.org/posts/2022/03/detecting-shadow-credentials/
  - https://twitter.com/SBousseaden/status/1581300963650187264?
logsource:
    product: windows
    service: security
    definition: The "Audit Directory Service Changes" logging policy must be configured
        in order to receive events. Audit events are generated only for objects with
        configured system access control lists (SACLs). Audit events are generated
        only for objects with configured system access control lists (SACLs) and only
        when accessed in a manner that matches their SACL settings. This policy covers
        the following events ids - 5136, 5137, 5138, 5139, 5141. Note that the default
        policy does not cover User objects. For that a custom AuditRule need to be
        setup (See https://github.com/OTRF/Set-AuditRule)
detection:
    condition: selection
    selection:
        AttributeLDAPDisplayName: msDS-KeyCredentialLink
        EventID: "5136"
falsepositives: Modifications in the msDS-KeyCredentialLink attribute can be done
    legitimately by the Azure AD Connect synchronization account or the ADFS service
    account. These accounts can be added as Exceptions. (From elastic FP section)
level: high
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1556
  - DEMO
