
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: ISO Image Mounted
id: 0248a7bc-8a9a-4cd8-a57e-3ae8e073a073
status: test
description: Detects the mount of an ISO image on an endpoint
author: Syed Hasan (@syedhasan009)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/05/29 10:12:21
references:
  - https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/malicious-spam-campaign-uses-iso-image-files-to-deliver-lokibot-and-nanocore
  - https://www.proofpoint.com/us/blog/threat-insight/threat-actor-profile-ta2719-uses-colorful-lures-deliver-rats-local-languages
  - https://twitter.com/MsftSecIntel/status/1257324139515269121
  - https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1553.005/T1553.005.md#atomic-test-1---mount-iso-image
logsource:
    product: windows
    service: security
    definition: The advanced audit policy setting "Object Access > Audit Removable
        Storage" must be configured for Success/Failure
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_generic:
        ObjectName:
          - \Device\CdRom0\autorun.ico
          - \Device\CdRom0\setup.exe
          - \Device\CdRom0\setup64.exe
    selection:
        EventID: "4663"
        ObjectName|startswith: \Device\CdRom
        ObjectServer: Security
        ObjectType: File
falsepositives: Software installation ISO files
level: medium
customer: 'demo'
modified: 2023/11/09
tags:
  - attack.initial_access
  - attack.t1566.001
  - DEMO
