
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Defrag Deactivation - Security
id: c5a178bf-9cfb-4340-b584-e4df39b6a3e7
related:
  - type: derived
    id: 958d81aa-8566-4cea-a565-59ccd4df27b0
status: test
description: Detects the deactivation and disabling of the Scheduled defragmentation
    task as seen by Slingshot APT group
author: Florian Roth (Nextron Systems), Bartlomiej Czyz (@bczyz1)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/03/04 13:50:51
references:
  - https://securelist.com/apt-slingshot/84312/
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Policy : Audit Other Object Access Events > Success'
detection:
    condition: selection
    selection:
        EventID: "4701"
        TaskName: \Microsoft\Windows\Defrag\ScheduledDefrag
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/11/27
tags:
  - attack.persistence
  - attack.t1053
  - attack.s0111
  - detection.emerging_threats
  - DEMO
