
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Denied Access To Remote Desktop
id: 8e5c03fa-b7f0-11ea-b242-07e0576828d9
status: test
description: |
    This event is generated when an authenticated user who is not allowed to log on remotely attempts to connect to this computer through Remote Desktop.
    Often, this event can be generated by attackers when searching for available windows servers in the network.
author: Pushkarev Dmitry
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/06/27 13:55:21
references:
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=4825
logsource:
    product: windows
    service: security
detection:
    condition: selection
    selection:
        EventID: "4825"
fields:
  - EventCode
  - AccountName
  - ClientAddress
falsepositives: Valid user was not added to RDP group
level: medium
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.lateral_movement
  - attack.t1021.001
  - DEMO
