
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Outgoing Logon with New Credentials
id: def8b624-e08f-4ae1-8612-1ba21190da6b
status: test
description: Detects logon events that specify new credentials
author: Max Altgelt (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/06 15:19:51
references:
  - https://go.recordedfuture.com/hubfs/reports/mtp-2021-0914.pdf
logsource:
    product: windows
    service: security
detection:
    condition: selection
    selection:
        EventID: "4624"
        LogonType: "9"
falsepositives: Legitimate remote administration activity
level: low
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.lateral_movement
  - attack.t1550
  - DEMO
