
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Azure AD Health Service Agents Registry Keys Access
id: 1d2ab8ac-1a01-423b-9c39-001510eae8e8
status: test
description: |
    This detection uses Windows security events to detect suspicious access attempts to the registry key values and sub-keys of Azure AD Health service agents (e.g AD FS).
    Information from AD Health service agents can be used to potentially abuse some of the features provided by those services in the cloud (e.g. Federation).
    This detection requires an access control entry (ACE) on the system access control list (SACL) of the following securable object: HKLM:\SOFTWARE\Microsoft\ADHealthAgent.
    Make sure you set the SACL to propagate to its sub-keys.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/26 18:58:01
references:
  - https://o365blog.com/post/hybridhealthagent/
  - https://github.com/OTRF/Set-AuditRule/blob/c3dec5443414231714d850565d364ca73475ade5/rules/registry/aad_connect_health_service_agent.yml
logsource:
    product: windows
    service: security
detection:
    condition: selection and not filter
    filter:
        ProcessName|contains:
          - Microsoft.Identity.Health.Adfs.DiagnosticsAgent.exe
          - Microsoft.Identity.Health.Adfs.InsightsService.exe
          - Microsoft.Identity.Health.Adfs.MonitoringAgent.Startup.exe
          - Microsoft.Identity.Health.Adfs.PshSurrogate.exe
          - Microsoft.Identity.Health.Common.Clients.ResourceMonitor.exe
    selection:
        EventID:
          - "4656"
          - "4663"
        ObjectName: \REGISTRY\MACHINE\SOFTWARE\Microsoft\ADHealthAgent
        ObjectType: Key
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.discovery
  - attack.t1012
  - DEMO
