
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DPAPI Domain Backup Key Extraction
id: 4ac1f50b-3bd0-4968-902d-868b4647937e
status: test
description: Detects tools extracting LSA secret DPAPI domain backup key from Domain
    Controllers
author: Roberto Rodriguez @Cyb3rWard0g
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/06/20 14:27:41
references:
  - https://threathunterplaybook.com/hunts/windows/190620-DomainDPAPIBackupKeyExtraction/notebook.html
logsource:
    product: windows
    service: security
detection:
    condition: selection
    selection:
        AccessMask: "0x2"
        EventID: "4662"
        ObjectName|contains: BCKUPKEY
        ObjectType: SecretObject
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/02/24
tags:
  - attack.credential_access
  - attack.t1003.004
  - DEMO
