
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DNS Server Error Failed Loading the ServerLevelPluginDLL
id: cbe51394-cd93-4473-b555-edf0144952d9
related:
  - type: derived
    id: e61e8a88-59a9-451c-874e-70fcc9740d67
  - type: derived
    id: f63b56ee-3f79-4b8a-97fb-5c48007e8573
status: test
description: Detects a DNS server error in which a specified plugin DLL (in registry)
    could not be loaded
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/05/08 20:19:21
references:
  - https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
  - https://technet.microsoft.com/en-us/library/cc735829(v=ws.10).aspx
  - https://twitter.com/gentilkiwi/status/861641945944391680
logsource:
    product: windows
    service: dns-server
detection:
    condition: selection
    selection:
        EventID:
          - "150"
          - "770"
          - "771"
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/05
tags:
  - attack.defense_evasion
  - attack.t1574.002
  - DEMO
