
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: UNC4841 - Potential SEASPY Execution
id: f6a711f3-d032-4f9e-890b-bbe776236c84
status: experimental
description: Detects execution of specific named binaries which were used by UNC4841
    to deploy their SEASPY backdoor
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/16 14:15:31
references:
  - https://www.mandiant.com/resources/blog/barracuda-esg-exploited-globally
logsource:
    category: process_creation
    product: linux
detection:
    condition: selection
    selection:
        Image|endswith:
          - /BarracudaMailService
          - /resize2fstab
          - /resize_reisertab
falsepositives: Unlikely
level: critical
customer: 'demo'
tags:
  - attack.execution
  - detection.emerging_threats
  - DEMO
