
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: UNC4841 - Download Tar File From Untrusted Direct IP Via Wget
id: 23835beb-ec38-4e74-a5d4-b99af6684e91
status: experimental
description: Detects execution of "wget" to download a "tar" from an IP address that
    doesn't have a trusted certificate. As seen used by UNC4841 during their Barracuda
    ESG zero day exploitation.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/16 20:16:01
references:
  - https://www.mandiant.com/resources/blog/barracuda-esg-exploited-globally
logsource:
    category: process_creation
    product: linux
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_local_ips:
        CommandLine|contains:
          - https://10.
          - https://192.168.
          - https://172.16.
          - https://172.17.
          - https://172.18.
          - https://172.19.
          - https://172.20.
          - https://172.21.
          - https://172.22.
          - https://172.23.
          - https://172.24.
          - https://172.25.
          - https://172.26.
          - https://172.27.
          - https://172.28.
          - https://172.29.
          - https://172.30.
          - https://172.31.
          - https://127.
          - https://169.254.
    selection:
        CommandLine|contains: --no-check-certificate
        CommandLine|endswith: .tar
        CommandLine|re: https://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
        Image|endswith: /wget
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1140
  - detection.emerging_threats
  - DEMO
