title: NCat Command Line Flags - Linux
id: 281b0753-8f45-4cc2-b4af-17767902c780
related:
    - id: 4c43f8da-ad24-4b81-a9de-1df10d81e1fa
      type: similar
status: test
description: Detects command line flags often used with NCat - the networking utility often used for hacking
references:
    - https://nmap.org/ncat/
author: Florian Roth
date: 2022/12/07
modified: 2023/03/28
tags:
    - attack.command_and_control
logsource:
    product: linux
    category: process_creation
detection:
    selection_specific:
        CommandLine|contains:
            - ' -lnvp '
            - ' -lvp '
            - ' -l -v -p '
            - ' -l -n -v -p '
            - 'nc -l -p '
            - 'ncat -l'
    selection_ncat:
        CommandLine|contains:
            - 'nc '
            - 'ncat '
    selection_flags:
        CommandLine|contains:
            - ' -e /bin/sh'
            - ' -e /bin/bash'
    condition: selection_specific or ( selection_ncat and selection_flags )
falsepositives:
    - Unlikely
level: high
