
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Creation Of a Suspicious ADS File Outside a Browser Download
id: 573df571-a223-43bc-846e-3f98da481eca
status: experimental
description: Detects the creation of a suspicious ADS (Alternate Data Stream) file
    by software other than browsers
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/10/22 21:10:01
references:
  - https://www.bleepingcomputer.com/news/security/exploited-windows-zero-day-lets-javascript-files-bypass-security-warnings/
logsource:
    category: create_stream_hash
    product: windows
detection:
    condition: selection and not 1 of filter_optional_*
    filter_optional_brave:
        Image|endswith: \brave.exe
    filter_optional_chrome:
        Image:
          - C:\Program Files\Google\Chrome\Application\chrome.exe
          - C:\Program Files (x86)\Google\Chrome\Application\chrome.exe
    filter_optional_edge_1:
      - Image|startswith: C:\Program Files (x86)\Microsoft\EdgeWebView\Application\
      - Image|endswith: \WindowsApps\MicrosoftEdge.exe
      - Image:
          - C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe
          - C:\Program Files\Microsoft\Edge\Application\msedge.exe
    filter_optional_edge_2:
        Image|endswith:
          - \msedge.exe
          - \msedgewebview2.exe
        Image|startswith:
          - C:\Program Files (x86)\Microsoft\EdgeCore\
          - C:\Program Files\Microsoft\EdgeCore\
    filter_optional_firefox:
        Image:
          - C:\Program Files\Mozilla Firefox\firefox.exe
          - C:\Program Files (x86)\Mozilla Firefox\firefox.exe
    filter_optional_ie:
        Image:
          - C:\Program Files (x86)\Internet Explorer\iexplore.exe
          - C:\Program Files\Internet Explorer\iexplore.exe
    filter_optional_maxthon:
        Image|endswith: \maxthon.exe
    filter_optional_opera:
        Image|endswith: \opera.exe
    filter_optional_safari:
        Image|endswith: \safari.exe
    filter_optional_seamonkey:
        Image|endswith: \seamonkey.exe
    filter_optional_snipping_tool:
        Image|endswith: \SnippingTool\SnippingTool.exe
        Image|startswith: C:\Program Files\WindowsApps\Microsoft.ScreenSketch_
        TargetFilename|contains|all:
          - \AppData\Local\Packages\Microsoft.ScreenSketch_
          - '\TempState\Screenshot '
        TargetFilename|endswith: .png:Zone.Identifier
        TargetFilename|startswith: C:\Users\
    filter_optional_vivaldi:
        Image|endswith: \vivaldi.exe
    filter_optional_whale:
        Image|endswith: \whale.exe
    selection:
        Contents|startswith: '[ZoneTransfer]  ZoneId=3'
        TargetFilename|contains:
          - .exe
          - .scr
          - .bat
          - .cmd
          - .docx
          - .hta
          - .jse
          - .lnk
          - .pptx
          - .ps
          - .reg
          - .sct
          - .vb
          - .wsc
          - .wsf
          - .xlsx
        TargetFilename|endswith: :Zone.Identifier
falsepositives:
  - Other legitimate browsers not currently included in the filter (please add them)
  - Legitimate downloads via scripting or command-line tools (Investigate to determine
    if it's legitimate)
level: medium
customer: 'demo'
modified: 2023/06/12
tags:
  - attack.defense_evasion
  - DEMO
