
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious File Download From File Sharing Websites
id: 52182dfb-afb7-41db-b4bc-5336cb29b464
related:
  - type: similar
    id: ae02ed70-11aa-4a22-b397-c0d0e8f6ea99
status: experimental
description: Detects the download of suspicious file type from a well-known file and
    paste sharing domain
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/24 19:23:31
references:
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90015
  - https://www.cisa.gov/uscert/ncas/alerts/aa22-321a
  - https://fabian-voith.de/2020/06/25/sysmon-v11-1-reads-alternate-data-streams/
  - https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
logsource:
    category: create_stream_hash
    product: windows
detection:
    condition: all of selection*
    selection_domain:
        Contents|contains:
          - .githubusercontent.com
          - anonfiles.com
          - cdn.discordapp.com
          - cdn.discordapp.com/attachments/
          - ddns.net
          - dl.dropboxusercontent.com
          - ghostbin.co
          - glitch.me
          - gofile.io
          - hastebin.com
          - mediafire.com
          - mega.nz
          - onrender.com
          - paste.ee
          - pastebin.com
          - pastebin.pl
          - pastetext.net
          - privatlab.com
          - privatlab.net
          - send.exploit.in
          - sendspace.com
          - storage.googleapis.com
          - storjshare.io
          - supabase.co
          - temp.sh
          - transfer.sh
          - ufile.io
    selection_extension:
        TargetFilename|contains:
          - .exe:Zone
          - .vbs:Zone
          - .vbe:Zone
          - .dll:Zone
          - .one:Zone
          - .hta:Zone
          - .lnk:Zone
          - .xll:Zone
          - .cpl:Zone
falsepositives: Some false positives might occur with binaries download via Github
level: high
customer: 'demo'
modified: 2024/02/09
tags:
  - attack.defense_evasion
  - attack.s0139
  - attack.t1564.004
  - DEMO
