
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Unusual File Download from Direct IP Address
id: 025bd229-fd1f-4fdb-97ab-20006e1a5368
status: test
description: Detects the download of suspicious file type from URLs with IP
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/07 17:15:11
references:
  - https://github.com/trustedsec/SysmonCommunityGuide/blob/adcdfee20999f422b974c8d4149bf4c361237db7/chapters/file-stream-creation-hash.md
  - https://labs.withsecure.com/publications/detecting-onenote-abuse
logsource:
    category: create_stream_hash
    product: windows
detection:
    condition: selection
    selection:
        Contents|re: http[s]?://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
        TargetFilename|contains:
          - .ps1:Zone
          - .bat:Zone
          - .exe:Zone
          - .vbe:Zone
          - .vbs:Zone
          - .dll:Zone
          - .one:Zone
          - .cmd:Zone
          - .hta:Zone
          - .xll:Zone
          - .lnk:Zone
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/10
tags:
  - attack.defense_evasion
  - attack.t1564.004
  - DEMO
