
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Python SQL Exceptions
id: 19aefed0-ffd4-47dc-a7fc-f8b1425e84f9
status: stable
description: Generic rule for SQL exceptions in Python according to PEP 249
author: Thomas Patzke
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/08/12 11:34:01
references:
  - https://www.python.org/dev/peps/pep-0249/#exceptions
logsource:
    category: application
    product: python
detection:
    condition: keywords
    keywords:
      - DataError
      - IntegrityError
      - ProgrammingError
      - OperationalError
falsepositives: Application bugs
level: medium
customer: 'demo'
modified: 2020/09/01
tags:
  - attack.initial_access
  - attack.t1190
  - DEMO
