
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Microsoft Office Child Process - MacOS
id: 69483748-1525-4a6c-95ca-90dc8d431b68
status: test
description: Detects suspicious child processes spawning from microsoft office suite
    applications such as word or excel. This could indicates malicious macro execution
author: Sohan G (D4rkCiph3r)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/31 18:31:21
references:
  - https://redcanary.com/blog/applescript/
  - https://objective-see.org/blog/blog_0x4B.html
logsource:
    category: process_creation
    product: macos
detection:
    condition: selection
    selection:
        Image|endswith:
          - /bash
          - /curl
          - /dash
          - /fish
          - /osacompile
          - /osascript
          - /sh
          - /zsh
          - /python
          - /python3
          - /wget
        ParentImage|contains:
          - Microsoft Word
          - Microsoft Excel
          - Microsoft PowerPoint
          - Microsoft OneNote
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/02/04
tags:
  - attack.execution
  - attack.persistence
  - attack.t1059.002
  - attack.t1137.002
  - attack.t1204.002
  - DEMO
