
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Base64 Decoded From Images
id: 09a910bf-f71f-4737-9c40-88880ba5913d
status: experimental
description: |
    Detects the use of tail to extract bytes at an offset from an image and then decode the base64 value to create a new file with the decoded content. The detected execution is a bash one-liner.
author: Joseliyo Sanchez, @Joseliyo_Jstnk
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/12/20 14:59:51
references:
  - https://www.virustotal.com/gui/file/16bafdf741e7a13137c489f3c8db1334f171c7cb13b62617d691b0a64783cc48/behavior
  - https://www.virustotal.com/gui/file/483fafc64a2b84197e1ef6a3f51e443f84dc5742602e08b9e8ec6ad690b34ed0/behavior
logsource:
    category: process_creation
    product: macos
detection:
    condition: all of selection_*
    selection_b64:
        CommandLine|contains|all:
          - base64
          - -d
          - '>'
    selection_files:
        CommandLine|contains:
          - .avif
          - .gif
          - .jfif
          - .jpeg
          - .jpg
          - .pjp
          - .pjpeg
          - .png
          - .svg
          - .webp
    selection_image:
        Image|endswith: /bash
    selection_view:
        CommandLine|contains|all:
          - tail
          - -c
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1140
  - DEMO
