
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Security Software Discovery - MacOs
id: 0ed75b9c-c73b-424d-9e7d-496cd565fbe0
status: test
description: Detects usage of system utilities (only grep for now) to discover security
    software discovery
author: Daniil Yugoslavskiy, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/19 15:08:31
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518.001/T1518.001.md
logsource:
    category: process_creation
    product: macos
detection:
    condition: image and 1 of selection_cli_*
    image:
        Image: /usr/bin/grep
    selection_cli_1:
        CommandLine|contains:
          - nessusd
          - santad
          - CbDefense
          - falcond
          - td-agent
          - packetbeat
          - filebeat
          - auditbeat
          - osqueryd
          - BlockBlock
          - LuLu
    selection_cli_2:
        CommandLine|contains|all:
          - Little
          - Snitch
falsepositives: Legitimate activities
level: medium
customer: 'demo'
modified: 2022/11/27
tags:
  - attack.discovery
  - attack.t1518.001
  - DEMO
