
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Local Groups Discovery - MacOs
id: 89bb1f97-c7b9-40e8-b52b-7d6afbd67276
status: test
description: Detects enumeration of local system groups
author: Ömer Günal, Alejandro Ortuno, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/11 13:33:51
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md
logsource:
    category: process_creation
    product: macos
detection:
    condition: 1 of selection*
    selection_1:
        CommandLine|contains|all:
          - -q
          - group
        Image|endswith: /dscacheutil
    selection_2:
        CommandLine|contains: /etc/group
        Image|endswith: /cat
    selection_3:
        CommandLine|contains|all:
          - -list
          - /groups
        Image|endswith: /dscl
falsepositives: Legitimate administration activities
level: informational
customer: 'demo'
modified: 2022/11/27
tags:
  - attack.discovery
  - attack.t1069.001
  - DEMO
