title: Potential Quarantine Enumeration Via Sqlite
id: 03e1ccd8-bd7f-488b-a24a-c070f65ea665
status: experimental
description: Detects potential quarantine enumeration activity using Sqlite as seen being used by malware such as Silver Sparrow
references:
    - https://redcanary.com/threat-detection-report/threats/silver-sparrow/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/28
tags:
    - attack.reconnaissance
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith: '/sqlite3'
        CommandLine|contains: 'LSQuarantineDataURLString'
    condition: selection
falsepositives:
    - Unknown
level: high
