
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: File and Directory Discovery - MacOS
id: 089dbdf6-b960-4bcc-90e3-ffc3480c20f6
status: test
description: Detects usage of system utilities to discover files and directories
author: Daniil Yugoslavskiy, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/19 14:58:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1083/T1083.md
logsource:
    category: process_creation
    product: macos
detection:
    condition: 1 of select*
    select_file_with_asterisk:
        CommandLine|re: (.){200,}
        Image: /usr/bin/file
    select_find_execution:
        Image: /usr/bin/find
    select_mdfind_execution:
        Image: /usr/bin/mdfind
    select_recursive_ls:
        CommandLine|contains: -R
        Image: /bin/ls
    select_tree_execution|endswith:
        Image: /tree
falsepositives: Legitimate activities
level: informational
customer: 'demo'
modified: 2022/11/25
tags:
  - attack.discovery
  - attack.t1083
  - DEMO
