
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Credentials from Password Stores - Keychain
id: b120b587-a4c2-4b94-875d-99c9807d6955
status: test
description: Detects passwords dumps from Keychain
author: Tim Ismilyaev, oscd.community, Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/19 17:19:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.001/T1555.001.md
  - https://gist.github.com/Capybara/6228955
logsource:
    category: process_creation
    product: macos
detection:
    condition: 1 of selection*
    selection1:
        CommandLine|contains:
          - find-certificate
          - ' export '
        Image: /usr/bin/security
    selection2:
        CommandLine|contains:
          - ' dump-keychain '
          - ' login-keychain '
falsepositives: Legitimate administration activities
level: medium
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.credential_access
  - attack.t1555.001
  - DEMO
