
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Remote Printing Abuse for Lateral Movement
id: bc3a4b0c-e167-48e1-aa88-b3020950e560
status: test
description: Detects remote RPC calls to possibly abuse remote printing service via
    MS-RPRN / MS-PAR
author: Sagie Dulce, Dekel Paz
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/01 17:06:21
references:
  - https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527
  - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rprn/d42db7d5-f141-4466-8f47-0a4be14e2fc1
  - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-pan/e44d984c-07d3-414c-8ffc-f8c8ad8512a8
  - https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-RPRN-PAR.md
  - https://github.com/zeronetworks/rpcfirewall
  - https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
    category: application
    product: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes
        with "audit:true action:block uuid:12345678-1234-abcd-ef00-0123456789ab or
        76f03f96-cdfd-44fc-a22c-64950a001209 or ae33069b-a2a8-46ee-a235-ddfd339be281
        or 0b6edbfa-4a24-4fc6-8a23-942b1eca65d1'
detection:
    condition: selection
    selection:
        EventID: "3"
        EventLog: RPCFW
        InterfaceUuid:
          - 12345678-1234-abcd-ef00-0123456789ab
          - 76f03f96-cdfd-44fc-a22c-64950a001209
          - 0b6edbfa-4a24-4fc6-8a23-942b1eca65d1
          - ae33069b-a2a8-46ee-a235-ddfd339be281
falsepositives: Actual printing
level: high
customer: 'demo'
modified: 2022/01/01
tags:
  - attack.lateral_movement
  - DEMO
