
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Remote DCOM/WMI Lateral Movement
id: 68050b10-e477-4377-a99b-3721b422d6ef
status: test
description: Detects remote RPC calls that performs remote DCOM operations. These
    could be abused for lateral movement via DCOM or WMI.
author: Sagie Dulce, Dekel Paz
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/01 13:53:51
references:
  - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-srvs/accf23b0-0f57-441c-9185-43041f1b0ee9
  - https://github.com/zeronetworks/rpcfirewall
  - https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
logsource:
    category: application
    product: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes
        with "audit:true action:block uuid:367abb81-9844-35f1-ad32-98f038001003'
detection:
    condition: selection
    selection:
        EventID: "3"
        EventLog: RPCFW
        InterfaceUuid:
          - 4d9f4ab8-7d1c-11cf-861e-0020af6e7c57
          - 99fcfec4-5260-101b-bbcb-00aa0021347a
          - 000001a0-0000-0000-c000-000000000046
          - 00000131-0000-0000-c000-000000000046
          - 00000143-0000-0000-c000-000000000046
          - 00000000-0000-0000-c000-000000000046
falsepositives: Some administrative tasks on remote host
level: high
customer: 'demo'
modified: 2022/01/01
tags:
  - attack.lateral_movement
  - attack.t1021.003
  - attack.t1047
  - DEMO
