
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PUA - Sysinternal Tool Execution - Registry
id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
status: test
description: Detects the execution of a Sysinternals Tool via the creation of the
    "accepteula" registry key
author: Markus Neis
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/08/28 16:51:51
references:
  - https://twitter.com/Moti_B/status/1008587936735035392
logsource:
    category: registry_add
    product: windows
detection:
    condition: selection
    selection:
        EventType: CreateKey
        TargetObject|endswith: \EulaAccepted
falsepositives:
  - Legitimate use of SysInternals tools
  - Programs that use the same Registry Key
level: low
customer: 'demo'
modified: 2023/02/07
tags:
  - attack.resource_development
  - attack.t1588.002
  - DEMO
