
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PUA - Sysinternals Tools Execution - Registry
id: c7da8edc-49ae-45a2-9e61-9fd860e4e73d
related:
  - type: derived
    id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
  - type: obsoletes
    id: 9841b233-8df8-4ad7-9133-b0b4402a9014
status: test
description: Detects the execution of some potentially unwanted tools such as PsExec,
    Procdump, etc. (part of the Sysinternals suite) via the creation of the "accepteula"
    registry key.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/24 17:30:11
references:
  - https://twitter.com/Moti_B/status/1008587936735035392
logsource:
    category: registry_add
    product: windows
detection:
    condition: selection
    selection:
        EventType: CreateKey
        TargetObject|contains:
          - \Active Directory Explorer
          - \Handle
          - \LiveKd
          - \Process Explorer
          - \ProcDump
          - \PsExec
          - \PsLoglist
          - \PsPasswd
          - \SDelete
          - \Sysinternals
        TargetObject|endswith: \EulaAccepted
falsepositives: Legitimate use of SysInternals tools. Filter the legitimate paths
    used in your environment
level: medium
customer: 'demo'
modified: 2023/02/07
tags:
  - attack.resource_development
  - attack.t1588.002
  - DEMO
