
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Default Credentials Usage
id: 1a395cbc-a84a-463a-9086-ed8a70e573c7
status: stable
description: |
    Before deploying any new asset, change all default passwords to have values consistent with administrative level accounts.
    Sigma detects default credentials usage. Sigma for Qualys vulnerability scanner. Scan type - Vulnerability Management.
author: Alexandr Yampolskyi, SOC Prime
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/03/26 12:41:21
references:
  - https://www.cisecurity.org/controls/cis-controls-list/
  - https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
  - https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
  - https://community.qualys.com/docs/DOC-6406-reporting-toolbox-focused-search-lists
logsource:
    product: qualys
detection:
    condition: selection
    selection:
        host.scan.vuln:
          - "10693"
          - "11507"
          - "11633"
          - "11804"
          - "11821"
          - "11847"
          - "11867"
          - "11931"
          - "11935"
          - "11950"
          - "12541"
          - "12558"
          - "12559"
          - "12560"
          - "12562"
          - "12563"
          - "12565"
          - "12587"
          - "12590"
          - "12599"
          - "12702"
          - "12705"
          - "12706"
          - "12907"
          - "12928"
          - "12929"
          - "13053"
          - "13178"
          - "13200"
          - "13218"
          - "13241"
          - "13253"
          - "13274"
          - "13296"
          - "13301"
          - "13327"
          - "13373"
          - "13374"
          - "13409"
          - "13530"
          - "13532"
          - "20065"
          - "20073"
          - "20081"
          - "27202"
          - "27358"
          - "38702"
          - "38719"
          - "42045"
          - "42417"
          - "43029"
          - "43220"
          - "43221"
          - "43222"
          - "43223"
          - "43225"
          - "43246"
          - "43431"
          - "43484"
          - "86857"
          - "87098"
          - "87106"
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.initial_access
  - DEMO
