
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: MSExchange Transport Agent Installation - Builtin
id: 4fe151c2-ecf9-4fae-95ae-b88ec9c2fca6
related:
  - type: derived
    id: 83809e84-4475-4b69-bc3e-4aad8568612f
status: test
description: Detects the Installation of a Exchange Transport Agent
author: Tobias Michalski (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/06/08 18:51:31
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=7
logsource:
    product: windows
    service: msexchange-management
detection:
    condition: selection
    selection: Install-TransportAgent
fields:
  - AssemblyPath
falsepositives: Legitimate installations of exchange TransportAgents. AssemblyPath
    is a good indicator for this.
level: medium
customer: 'demo'
modified: 2022/11/27
tags:
  - attack.persistence
  - attack.t1505.002
  - DEMO
