
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Persistence Via TypedPaths
id: 086ae989-9ca6-4fe7-895a-759c5544f247
status: experimental
description: Detects modification addition to the 'TypedPaths' key in the user or
    admin registry from a non standard application. Which might indicate persistence
    attempt
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/22 15:45:51
references:
  - https://twitter.com/dez_/status/1560101453150257154
  - https://forensafe.com/blogs/typedpaths.html
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection and not filter
    filter:
        Image:
          - C:\Windows\explorer.exe
          - C:\Windows\SysWOW64\explorer.exe
    selection:
        TargetObject|contains: \Software\Microsoft\Windows\CurrentVersion\Explorer\TypedPaths\
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - DEMO
