
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Disabled Windows Defender Eventlog
id: fcddca7c-b9c0-4ddf-98da-e1e2d18b0157
status: experimental
description: Detects the disabling of the Windows Defender eventlog as seen in relation
    to Lockbit 3.0 infections
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/04 15:04:41
references:
  - https://twitter.com/WhichbufferArda/status/1543900539280293889/photo/2
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        Details: DWORD (0x00000000)
        TargetObject|contains: \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Windows
            Defender/Operational\Enabled
falsepositives: Other Antivirus software installations could cause Windows to disable
    that eventlog (unknown)
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - DEMO
