
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DHCP Callout DLL Installation
id: 9d3436ef-9476-4c43-acca-90ce06bdf33a
status: test
description: Detects the installation of a Callout DLL via CalloutDlls and CalloutEnabled
    parameter in Registry, which can be used to execute code in context of the DHCP
    server (restart required)
author: Dimitrios Slamaris
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/05/15 13:12:11
references:
  - https://blog.3or.de/mimilib-dhcp-server-callout-dll-injection.html
  - https://technet.microsoft.com/en-us/library/cc726884(v=ws.10).aspx
  - https://msdn.microsoft.com/de-de/library/windows/desktop/aa363389(v=vs.85).aspx
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        TargetObject|endswith:
          - \Services\DHCPServer\Parameters\CalloutDlls
          - \Services\DHCPServer\Parameters\CalloutEnabled
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.defense_evasion
  - attack.t1574.002
  - attack.t1112
  - DEMO
