
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Signing Bypass Via Windows Developer Features - Registry
id: b110ebaf-697f-4da1-afd5-b536fa27a2c1
related:
  - type: similar
    id: a383dec4-deec-4e6e-913b-ed9249670848
status: experimental
description: Detects when the enablement of developer features such as "Developer
    Mode" or "Application Sideloading". Which allows the user to install untrusted
    packages.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/12 23:21:11
references:
  - https://twitter.com/malmoeb/status/1560536653709598721
  - https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        Details: DWORD (0x00000001)
        TargetObject|contains:
          - \Microsoft\Windows\CurrentVersion\AppModelUnlock
          - \Policies\Microsoft\Windows\Appx\
        TargetObject|endswith:
          - \AllowAllTrustedApps
          - \AllowDevelopmentWithoutDevLicense
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.defense_evasion
  - DEMO
