
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious New Printer Ports in Registry (CVE-2020-1048)
id: 7ec912f2-5175-4868-b811-ec13ad0f8567
status: test
description: Detects a new and suspicious printer port creation in Registry that could
    be an attempt to exploit CVE-2020-1048
author: EagleEye Team, Florian Roth (Nextron Systems), NVISO
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/05/13 19:05:11
references:
  - https://windows-internals.com/printdemon-cve-2020-1048/
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        Details|contains:
          - .dll
          - .exe
          - .bat
          - .com
          - 'C:'
        TargetObject|startswith: HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Ports
falsepositives: New printer port install on host
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - attack.execution
  - attack.defense_evasion
  - attack.t1112
  - DEMO
