
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Running Chrome VPN Extensions via the Registry 2 VPN Extension
id: b64a026b-8deb-4c1d-92fd-98893209dff1
status: test
description: Running Chrome VPN Extensions via the Registry install 2 vpn extension
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/28 21:49:21
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1133/T1133.md#atomic-test-1---running-chrome-vpn-extensions-via-the-registry-2-vpn-extension
logsource:
    category: registry_set
    product: windows
detection:
    condition: all of chrome_*
    chrome_ext:
        TargetObject|contains: Software\Wow6432Node\Google\Chrome\Extensions
        TargetObject|endswith: update_url
    chrome_vpn:
        TargetObject|contains:
          - fdcgdnkidjaadafnichfpabhfomcebme
          - fcfhplploccackoneaefokcmbjfbkenj
          - bihmplhobchoageeokmgbdihknkjbknd
          - gkojfkhlekighikafcpjkiklfbnlmeio
          - jajilbjjinjmgcibalaakngmkilboobh
          - gjknjjomckknofjidppipffbpoekiipm
          - nabbmpekekjknlbkgpodfndbodhijjem
          - kpiecbcckbofpmkkkdibbllpinceiihk
          - nlbejmccbhkncgokjcmghpfloaajcffj
          - omghfjlpggmjjaagoclmmobgdodcjboh
          - bibjcjfmgapbfoljiojpipaooddpkpai
          - mpcaainmfjjigeicjnlkdfajbioopjko
          - jljopmgdobloagejpohpldgkiellmfnc
          - lochiccbgeohimldjooaakjllnafhaid
          - nhnfcgpcbfclhfafjlooihdfghaeinfc
          - ookhnhpkphagefgdiemllfajmkdkcaim
          - namfblliamklmeodpcelkokjbffgmeoo
          - nbcojefnccbanplpoffopkoepjmhgdgh
          - majdfhpaihoncoakbjgbdhglocklcgno
          - lnfdmdhmfbimhhpaeocncdlhiodoblbd
          - eppiocemhmnlbhjplcgkofciiegomcon
          - cocfojppfigjeefejbpfmedgjbpchcng
          - foiopecknacmiihiocgdjgbjokkpkohc
          - hhdobjgopfphlmjbmnpglhfcgppchgje
          - jgbaghohigdbgbolncodkdlpenhcmcge
          - inligpkjkhbpifecbdjhmdpcfhnlelja
          - higioemojdadgdbhbbbkfbebbdlfjbip
          - hipncndjamdcmphkgngojegjblibadbe
          - iolonopooapdagdemdoaihahlfkncfgg
          - nhfjkakglbnnpkpldhjmpmmfefifedcj
          - jpgljfpmoofbmlieejglhonfofmahini
          - fgddmllnllkalaagkghckoinaemmogpe
          - ejkaocphofnobjdedneohbbiilggdlbi
          - keodbianoliadkoelloecbhllnpiocoi
          - hoapmlpnmpaehilehggglehfdlnoegck
          - poeojclicodamonabcabmapamjkkmnnk
          - dfkdflfgjdajbhocmfjolpjbebdkcjog
          - kcdahmgmaagjhocpipbodaokikjkampi
          - klnkiajpmpkkkgpgbogmcgfjhdoljacg
          - lneaocagcijjdpkcabeanfpdbmapcjjg
          - pgfpignfckbloagkfnamnolkeaecfgfh
          - jplnlifepflhkbkgonidnobkakhmpnmh
          - jliodmnojccaloajphkingdnpljdhdok
          - hnmpcagpplmpfojmgmnngilcnanddlhb
          - ffbkglfijbcbgblgflchnbphjdllaogb
          - kcndmbbelllkmioekdagahekgimemejo
          - jdgilggpfmjpbodmhndmhojklgfdlhob
          - bihhflimonbpcfagfadcnbbdngpopnjb
          - ppajinakbfocjfnijggfndbdmjggcmde
          - oofgbpoabipfcfjapgnbbjjaenockbdp
          - bhnhkdgoefpmekcgnccpnhjfdgicfebm
          - knmmpciebaoojcpjjoeonlcjacjopcpf
          - dhadilbmmjiooceioladdphemaliiobo
          - jedieiamjmoflcknjdjhpieklepfglin
          - mhngpdlhojliikfknhfaglpnddniijfh
          - omdakjcmkglenbhjadbccaookpfjihpa
          - npgimkapccfidfkfoklhpkgmhgfejhbj
          - akeehkgglkmpapdnanoochpfmeghfdln
          - gbmdmipapolaohpinhblmcnpmmlgfgje
          - aigmfoeogfnljhnofglledbhhfegannp
          - cgojmfochfikphincbhokimmmjenhhgk
          - ficajfeojakddincjafebjmfiefcmanc
          - ifnaibldjfdmaipaddffmgcmekjhiloa
          - jbnmpdkcfkochpanomnkhnafobppmccn
          - apcfdffemoinopelidncddjbhkiblecc
          - mjolnodfokkkaichkcjipfgblbfgojpa
          - oifjbnnafapeiknapihcmpeodaeblbkn
          - plpmggfglncceinmilojdkiijhmajkjh
          - mjnbclmflcpookeapghfhapeffmpodij
          - bblcccknbdbplgmdjnnikffefhdlobhp
          - aojlhgbkmkahabcmcpifbolnoichfeep
          - lcmammnjlbmlbcaniggmlejfjpjagiia
          - knajdeaocbpmfghhmijicidfcmdgbdpm
          - bdlcnpceagnkjnjlbbbcepohejbheilk
          - edknjdjielmpdlnllkdmaghlbpnmjmgb
          - eidnihaadmmancegllknfbliaijfmkgo
          - ckiahbcmlmkpfiijecbpflfahoimklke
          - macdlemfnignjhclfcfichcdhiomgjjb
          - chioafkonnhbpajpengbalkececleldf
          - amnoibeflfphhplmckdbiajkjaoomgnj
          - llbhddikeonkpbhpncnhialfbpnilcnc
          - pcienlhnoficegnepejpfiklggkioccm
          - iocnglnmfkgfedpcemdflhkchokkfeii
          - igahhbkcppaollcjeaaoapkijbnphfhb
          - njpmifchgidinihmijhcfpbdmglecdlb
          - ggackgngljinccllcmbgnpgpllcjepgc
          - kchocjcihdgkoplngjemhpplmmloanja
          - bnijmipndnicefcdbhgcjoognndbgkep
          - lklekjodgannjcccdlbicoamibgbdnmi
          - dbdbnchagbkhknegmhgikkleoogjcfge
          - egblhcjfjmbjajhjhpmnlekffgaemgfh
          - ehbhfpfdkmhcpaehaooegfdflljcnfec
          - bkkgdjpomdnfemhhkalfkogckjdkcjkg
          - almalgbpmcfpdaopimbdchdliminoign
          - akkbkhnikoeojlhiiomohpdnkhbkhieh
          - gbfgfbopcfokdpkdigfmoeaajfmpkbnh
          - bniikohfmajhdcffljgfeiklcbgffppl
          - lejgfmmlngaigdmmikblappdafcmkndb
          - ffhhkmlgedgcliajaedapkdfigdobcif
          - gcknhkkoolaabfmlnjonogaaifnjlfnp
          - pooljnboifbodgifngpppfklhifechoe
          - fjoaledfpmneenckfbpdfhkmimnjocfa
          - aakchaleigkohafkfjfjbblobjifikek
          - dpplabbmogkhghncfbfdeeokoefdjegm
          - padekgcemlokbadohgkifijomclgjgif
          - bfidboloedlamgdmenmlbipfnccokknp
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - attack.t1133
  - DEMO
