
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Persistence Via App Paths Default Property
id: 707e097c-e20f-4f67-8807-1f72ff4500d6
status: experimental
description: |
    Detects changes to the "Default" property for keys located in the \Software\Microsoft\Windows\CurrentVersion\App Paths\ registry. Which might be used as a method of persistence
    The entries found under App Paths are used primarily for the following purposes.
    First, to map an application's executable file name to that file's fully qualified path.
    Second, to prepend information to the PATH environment variable on a per-application, per-process basis.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/10 19:46:41
references:
  - https://www.hexacorn.com/blog/2013/01/19/beyond-good-ol-run-key-part-3/
  - https://docs.microsoft.com/en-us/windows/win32/shell/app-registration?redirectedfrom=MSDN
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        Details|contains:
          - \Users\Public
          - \AppData\Local\Temp\
          - \Windows\Temp\
          - \Desktop\
          - \Downloads\
          - '%temp%'
          - '%tmp%'
          - iex
          - Invoke-
          - rundll32
          - regsvr32
          - mshta
          - cscript
          - wscript
          - .bat
          - .hta
          - .dll
          - .ps1
        TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\App Paths
        TargetObject|endswith:
          - (Default)
          - Path
falsepositives: Legitimate applications registering their binary from on of the suspicious
    locations mentioned above (tune it)
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - attack.t1546.012
  - DEMO
