
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Path In Keyboard Layout IME File Registry Value
id: 9d8f9bb8-01af-4e15-a3a2-349071530530
related:
  - type: derived
    id: b888e3f2-224d-4435-b00b-9dd66e9ea1f1
status: experimental
description: |
    Detects usage of Windows Input Method Editor (IME) keyboard layout feature, which allows an attacker to load a DLL into the process after sending the WM_INPUTLANGCHANGEREQUEST message.
    Before doing this, the client needs to register the DLL in a special registry key that is assumed to implement this keyboard layout. This registry key should store a value named "Ime File" with a DLL path.
    IMEs are essential for languages that have more characters than can be represented on a standard keyboard, such as Chinese, Japanese, and Korean.
author: X__Junior (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/11/21 20:49:51
references:
  - https://www.linkedin.com/pulse/guntior-story-advanced-bootkit-doesnt-rely-windows-disk-baranov-wue8e/
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection_registry and 1 of selection_folders_*
    selection_folders_1:
        Details|contains:
          - :\Perflogs\
          - :\Users\Public\
          - :\Windows\Temp\
          - \AppData\Local\Temp\
          - \AppData\Roaming\
          - \Temporary Internet
    selection_folders_2:
      - Details|contains|all:
          - :\Users\
          - \Favorites\
      - Details|contains|all:
          - :\Users\
          - \Favourites\
      - Details|contains|all:
          - :\Users\
          - \Contacts\
    selection_registry:
        TargetObject|contains|all:
          - \Control\Keyboard Layouts\
          - Ime File
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - DEMO
