
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Disable Sysmon Event Logging Via Registry
id: 4916a35e-bfc4-47d0-8e25-a003d7067061
status: experimental
description: Detects changes in Sysmon driver altitude. If the Sysmon driver is configured
    to load at an altitude of another registered service, it will fail to load at
    boot.
author: B.Talebi
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/28 16:45:11
references:
  - https://posts.specterops.io/shhmon-silencing-sysmon-via-driver-unload-682b5be57650
  - https://youtu.be/zSihR3lTf7g
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        TargetObject|endswith: \Instances\Sysmon Instance\Altitude
        TargetObject|startswith: HKLM\SYSTEM\CurrentControlSet\
falsepositives: Legitimate driver altitude change to hide sysmon
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - DEMO
