
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Registry Persistence via Explorer Run Key
id: b7916c2a-fa2f-4795-9477-32b731f70f11
status: test
description: Detects a possible persistence mechanism using RUN key for Windows Explorer
    and pointing to a suspicious folder
author: Florian Roth (Nextron Systems), oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/07/18 16:58:11
references:
  - https://researchcenter.paloaltonetworks.com/2018/07/unit42-upatre-continues-evolve-new-anti-analysis-techniques/
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        Details|contains:
          - :\$Recycle.bin\
          - :\ProgramData\
          - :\Temp\
          - :\Users\Default\
          - :\Users\Public\
          - :\Windows\Temp\
          - \AppData\Local\Temp\
        TargetObject|endswith: \Microsoft\Windows\CurrentVersion\Policies\Explorer\Run
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/12/11
tags:
  - attack.persistence
  - attack.t1547.001
  - DEMO
