
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: CurrentVersion NT Autorun Keys Modification
id: cbf93e5d-ca6c-4722-8bea-e9119007c248
related:
  - type: obsoletes
    id: 17f878b8-9968-4578-b814-c4217fc5768c
status: experimental
description: Detects modification of autostart extensibility point (ASEP) in registry.
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
    oscd.community, Tim Shelton, frack113 (split)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/25 17:35:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
  - https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
  - https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
logsource:
    category: registry_set
    product: windows
detection:
    condition: nt_current_version_base and nt_current_version and not 1 of filter_*
    filter_edge:
        Image|endswith: \MicrosoftEdgeUpdate.exe
        Image|startswith: C:\Program Files (x86)\Microsoft\Temp\
    filter_empty:
        Details: (Empty)
    filter_legitimate_subkey:
        TargetObject|contains: \Image File Execution Options\
        TargetObject|endswith:
          - \DisableExceptionChainValidation
          - \MitigationOptions
    filter_msoffice:
      - TargetObject|contains:
          - \ClickToRunStore\HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\
          - \ClickToRun\REGISTRY\MACHINE\Software\Microsoft\Windows NT\CurrentVersion\
      - Image:
          - C:\Program Files\Microsoft Office\root\integration\integrator.exe
          - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
    filter_ngen:
        Image|endswith: \ngen.exe
        Image|startswith: C:\Windows\Microsoft.NET\Framework
    filter_officeclicktorun:
        Image|endswith: \OfficeClickToRun.exe
        Image|startswith:
          - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
          - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
    filter_onedrive:
        Details|endswith: \AppData\Local\Microsoft\OneDrive\Update\OneDriveSetup.exe"
        Details|startswith: C:\Windows\system32\cmd.exe /q /c del /q "C:\Users\
        Image|endswith: \AppData\Local\Microsoft\OneDrive\StandaloneUpdater\OneDriveSetup.exe
        TargetObject|endswith: \Microsoft\Windows\CurrentVersion\RunOnce\Delete Cached
            Update Binary
    filter_security_extension_dc:
        Details:
          - DWORD (0x00000009)
          - DWORD (0x000003c0)
        Image: C:\Windows\system32\svchost.exe
        TargetObject|contains:
          - \Winlogon\GPExtensions\{827D319E-6EAC-11D2-A4EA-00C04F79F83A}\PreviousPolicyAreas
          - \Winlogon\GPExtensions\{827D319E-6EAC-11D2-A4EA-00C04F79F83A}\MaxNoGPOListChangesInterval
    nt_current_version:
        TargetObject|contains:
          - \Winlogon\VmApplet
          - \Winlogon\Userinit
          - \Winlogon\Taskman
          - \Winlogon\Shell
          - \Winlogon\GpExtensions
          - \Winlogon\AppSetup
          - \Winlogon\AlternateShells\AvailableShells
          - \Windows\IconServiceLib
          - \Windows\Appinit_Dlls
          - \Image File Execution Options
          - \Font Drivers
          - \Drivers32
          - \Windows\Run
          - \Windows\Load
    nt_current_version_base:
        TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion
fields:
  - SecurityID
  - ObjectName
  - OldValueType
  - NewValueType
falsepositives:
  - Legitimate software automatically (mostly, during installation) sets up autorun
    keys for legitimate reason
  - Legitimate administrator sets up autorun keys for legitimate reason
level: medium
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - attack.t1547.001
  - DEMO
