
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Enabling COR Profiler Environment Variables
id: ad89044a-8f49-4673-9a55-cbd88a1b374f
status: test
description: Detects .NET Framework CLR and .NET Core CLR "cor_enable_profiling" and
    "cor_profiler" variables being set and configured.
author: Jose Rodriguez (@Cyb3rPandaH), OTR (Open Threat Research), Jimmy Bayne (@bohops)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/09/10 17:20:51
references:
  - https://twitter.com/jamieantisocial/status/1304520651248668673
  - https://www.slideshare.net/JamieWilliams130/started-from-the-bottom-exploiting-data-sources-to-uncover-attck-behaviors
  - https://www.sans.org/cyber-security-summit/archives
  - https://learn.microsoft.com/en-us/dotnet/core/runtime-config/debugging-profiling
logsource:
    category: registry_set
    product: windows
detection:
    condition: 1 of selection_*
    selection_1:
        TargetObject|endswith:
          - \COR_ENABLE_PROFILING
          - \COR_PROFILER
          - \CORECLR_ENABLE_PROFILING
    selection_2:
        TargetObject|contains: \CORECLR_PROFILER_PATH
level: medium
customer: 'demo'
modified: 2023/11/24
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.defense_evasion
  - attack.t1574.012
  - DEMO
