
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Persistence Via AutodialDLL
id: e6fe26ee-d063-4f5b-b007-39e90aaf50e3
status: experimental
description: Detects change the the "AutodialDLL" key which could be used as a persistence
    method to load custom DLL via the "ws2_32" library
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/10 15:47:21
references:
  - https://www.hexacorn.com/blog/2015/01/13/beyond-good-ol-run-key-part-24/
  - https://persistence-info.github.io/Data/autodialdll.html
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        TargetObject|contains: \Services\WinSock2\Parameters\AutodialDLL
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - DEMO
