
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Winlogon AllowMultipleTSSessions Enable
id: f7997770-92c3-4ec9-b112-774c4ef96f96
status: experimental
description: |
    Detects when the 'AllowMultipleTSSessions' value is enabled.
    Which allows for multiple Remote Desktop connection sessions to be opened at once.
    This is often used by attacker as a way to connect to an RDP session without disconnecting the other users
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/09 16:44:51
references:
  - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        Details|endswith: DWORD (0x00000001)
        TargetObject|endswith: \Microsoft\Windows NT\CurrentVersion\Winlogon\AllowMultipleTSSessions
falsepositives: Legitimate use of the multi session functionality
level: medium
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - attack.defense_evasion
  - attack.t1112
  - DEMO
