
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Persistence Via Disk Cleanup Handler - Autorun
id: d4e2745c-f0c6-4bde-a3ab-b553b3f693cc
status: experimental
description: |
    Detects when an attacker modifies values of the Disk Cleanup Handler in the registry to achieve persistence via autorun.
    The disk cleanup manager is part of the operating system.
    It displays the dialog box […] The user has the option of enabling or disabling individual handlers by selecting or clearing their check box in the disk cleanup manager's UI.
    Although Windows comes with a number of disk cleanup handlers, they aren't designed to handle files produced by other applications.
    Instead, the disk cleanup manager is designed to be flexible and extensible by enabling any developer to implement and register their own disk cleanup handler.
    Any developer can extend the available disk cleanup services by implementing and registering a disk cleanup handler.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/21 17:46:51
references:
  - https://persistence-info.github.io/Data/diskcleanuphandler.html
  - https://www.hexacorn.com/blog/2018/09/02/beyond-good-ol-run-key-part-86/
logsource:
    category: registry_set
    product: windows
detection:
    condition: root and 1 of selection_*
    root:
        TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\VolumeCaches\
    selection_autorun:
        Details: DWORD (0x00000001)
        TargetObject|contains: \Autorun
    selection_pre_after:
        Details|contains:
          - cmd
          - powershell
          - rundll32
          - mshta
          - cscript
          - wscript
          - wsl
          - \Users\Public\
          - \Windows\TEMP\
          - \Microsoft\Windows\Start Menu\Programs\Startup\
        TargetObject|contains:
          - \CleanupString
          - \PreCleanupString
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - DEMO
