
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: ServiceDll Hijack
id: 612e47e9-8a59-43a6-b404-f48683f45bd6
status: experimental
description: Detects changes to the "ServiceDLL" value related to a service in the
    registry. This is often used as a method of persistence.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/04 10:30:31
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md#atomic-test-4---tinyturla-backdoor-service-w64time
  - https://www.hexacorn.com/blog/2013/09/19/beyond-good-ol-run-key-part-4/
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection and not 1 of filter*
    filter_domain_controller:
        Details: '%%systemroot%%\system32\ntdsa.dll'
        Image: C:\Windows\system32\lsass.exe
        TargetObject|endswith: \CurrentControlSet\Services\NTDS\Parameters\ServiceDll
    filter_poqexec:
        Image: C:\Windows\System32\poqexec.exe
    filter_printextensionmanger:
        Details: C:\Windows\system32\spool\drivers\x64\3\PrintConfig.dll
    selection:
        TargetObject|endswith: \Parameters\ServiceDll
        TargetObject|startswith: HKLM\System\CurrentControlSet\Services\
falsepositives:
  - Administrative scripts
  - Installation of a service
level: medium
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1543.003
  - DEMO
