
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Persistence Via MyComputer Registry Keys
id: 8fbe98a8-8f9d-44f8-aa71-8c572e29ef06
status: experimental
description: Detects modification to the "Default" value of the "MyComputer" key and
    subkeys to point to a custom binary that will be launched whenever the associated
    action is executed (see reference section for example)
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/09 19:30:31
references:
  - https://www.hexacorn.com/blog/2017/01/18/beyond-good-ol-run-key-part-55/
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        TargetObject|contains: \Microsoft\Windows\CurrentVersion\Explorer\MyComputer
        TargetObject|endswith: (Default)
falsepositives: Unlikely but if you experience FPs add specific processes and locations
    you would like to monitor for
level: high
customer: 'demo'
modified: 2024/01/11
tags:
  - attack.persistence
  - DEMO
