
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Enable Microsoft Dynamic Data Exchange
id: 63647769-326d-4dde-a419-b925cc0caf42
status: test
description: Enable Dynamic Data Exchange protocol (DDE) in all supported editions
    of Microsoft Word or Excel.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/02/26 15:51:51
references:
  - https://msrc.microsoft.com/update-guide/vulnerability/ADV170021
logsource:
    category: registry_set
    product: windows
detection:
    condition: 1 of selection_*
    selection_excel:
        Details: DWORD (0x00000000)
        TargetObject|endswith:
          - \Excel\Security\DisableDDEServerLaunch
          - \Excel\Security\DisableDDEServerLookup
    selection_word:
        Details:
          - DWORD (0x00000001)
          - DWORD (0x00000002)
        TargetObject|endswith: \Word\Security\AllowDDE
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.execution
  - attack.t1559.002
  - DEMO
