
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Registry Disable System Restore
id: 5de03871-5d46-4539-a82d-3aa992a69a83
status: experimental
description: Detects the modification of the registry to disable a system restore
    on the computer
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/04 14:25:01
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-9---disable-system-restore-through-registry
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection
    selection:
        Details: DWORD (0x00000001)
        TargetObject|contains:
          - \Policies\Microsoft\Windows NT\SystemRestore
          - \Microsoft\Windows NT\CurrentVersion\SystemRestore
        TargetObject|endswith:
          - DisableConfig
          - DisableSR
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/08/17
tags:
  - attack.impact
  - attack.t1490
  - DEMO
