
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential PendingFileRenameOperations Tamper
id: 4eec988f-7bf0-49f1-8675-1e6a510b3a2a
status: test
description: Detect changes to the "PendingFileRenameOperations" registry key from
    uncommon or suspicious images lcoations to stage currently used files for rename
    after reboot.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/27 18:09:41
references:
  - https://any.run/report/3ecd4763ffc944fdc67a9027e459cd4f448b1a8d1b36147977afaf86bbf2a261/64b0ba45-e7ce-423b-9a1d-5b4ea59521e6
  - https://devblogs.microsoft.com/scripting/determine-pending-reboot-statuspowershell-style-part-1/
  - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc960241(v=technet.10)?redirectedfrom=MSDN
  - https://www.trendmicro.com/en_us/research/21/j/purplefox-adds-new-backdoor-that-uses-websockets.html
  - https://www.trendmicro.com/en_us/research/19/i/purple-fox-fileless-malware-with-rookit-component-delivered-by-rig-exploit-kit-now-abuses-powershell.html
logsource:
    category: registry_set
    product: windows
detection:
    condition: selection_main and 1 of selection_susp_*
    selection_main:
        EventType: SetValue
        TargetObject|contains: \CurrentControlSet\Control\Session Manager\PendingFileRenameOperations
    selection_susp_images:
        Image|endswith:
          - \reg.exe
          - \regedit.exe
    selection_susp_paths:
        Image|contains:
          - \AppData\Local\Temp\
          - \Users\Public\
falsepositives: Installers and updaters may set currently in use files for rename
    after a reboot.
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1036.003
  - DEMO
