
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Non PowerShell WSMAN COM Provider
id: df9a0e0e-fedb-4d6c-8668-d765dfc92aa7
status: test
description: Detects suspicious use of the WSMAN provider without PowerShell.exe as
    the host application.
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/06/24 17:10:31
references:
  - https://twitter.com/chadtilbury/status/1275851297770610688
  - https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/
  - https://github.com/bohops/WSMan-WinRM
logsource:
    product: windows
    service: powershell-classic
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_ps:
        Data|contains:
          - HostApplication=powershell
          - HostApplication=C:\Windows\System32\WindowsPowerShell\v1.0\powershell
          - HostApplication=C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell
          - HostApplication=C:/Windows/System32/WindowsPowerShell/v1.0/powershell
          - HostApplication=C:/Windows/SysWOW64/WindowsPowerShell/v1.0/powershell
    selection:
        Data|contains: ProviderName=WSMan
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/10/27
tags:
  - attack.execution
  - attack.t1059.001
  - attack.lateral_movement
  - attack.t1021.003
  - DEMO
