
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Defense Evasion Via Raw Disk Access By Uncommon Tools
id: db809f10-56ce-4420-8c86-d6a7d793c79c
status: test
description: Detects raw disk access using uncommon tools or tools that are located
    in suspicious locations (heavy filtering is required), which could indicate possible
    defense evasion attempts
author: Teymur Kheirkhabarov, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/22 22:05:01
references:
  - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
logsource:
    category: raw_access_thread
    product: windows
detection:
    condition: not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_floppy:
        Device|contains: floppy
    filter_main_generic:
        Image|contains:
          - :\$WINDOWS.~BT\
          - :\Program Files (x86)\
          - :\Program Files\
          - :\Windows\CCM\
          - :\Windows\explorer.exe
          - :\Windows\servicing\
          - :\Windows\SoftwareDistribution\
          - :\Windows\System32\
          - :\Windows\SystemApps\
          - :\Windows\uus\
          - :\Windows\WinSxS\
    filter_main_microsoft_appdata:
        Image|contains|all:
          - :\Users\
          - \AppData\
          - \Microsoft\
    filter_main_null:
        Image: []
    filter_main_ssd_nvme:
        Image|contains: :\Windows\Temp\
        Image|endswith:
          - \Executables\SSDUpdate.exe
          - \HostMetadata\NVMEHostmetadata.exe
    filter_main_system_images:
        Image:
          - Registry
          - System
    filter_main_systemsettings:
        Image|endswith: :\Windows\ImmersiveControlPanel\SystemSettings.exe
    filter_main_windefender:
        Image|contains: :\ProgramData\Microsoft\Windows Defender\Platform\
        Image|endswith: \MsMpEng.exe
    filter_optional_Keybase:
        Image|contains: \AppData\Local\Keybase\upd.exe
    filter_optional_github_desktop:
        Image|contains: \AppData\Local\GitHubDesktop\app-
        Image|endswith: \resources\app\git\mingw64\bin\git.exe
    filter_optional_nextron:
        Image|contains: :\Windows\Temp\asgard2-agent\
        Image|endswith: \thor.exe
falsepositives: Likely
level: low
customer: 'demo'
modified: 2023/11/28
tags:
  - attack.defense_evasion
  - attack.t1006
  - DEMO
