
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-06-21 19:00
# Generated for User: demo
# Number of Rules: 3228
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Access To Windows Outlook Mail Files By Uncommon Application
id: fc3e237f-2fef-406c-b90d-b3ae7e02fa8f
status: experimental
description: |
    Detects file access requests to Windows Outlook Mail by uncommon processes.
    Could indicate potential attempt of credential stealing.
    Requires heavy baselining before usage
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/05/10 21:33:01
references:
  - https://darkdefender.medium.com/windows-10-mail-app-forensics-39025f5418d2
  - https://github.com/redcanaryco/atomic-red-team/blob/58496ee3306e6e42a7054d36a94e6eb561ee3081/atomics/T1070.008/T1070.008.md#atomic-test-4---copy-and-modify-mailbox-data-on-windows
logsource:
    category: file_access
    product: windows
    definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
    condition: 1 of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_generic:
        Image|contains:
          - :\Program Files (x86)\
          - :\Program Files\
          - :\Windows\system32\
          - :\Windows\SysWOW64\
    filter_main_system:
        Image: System
    filter_optional_defender:
        Image|contains: :\ProgramData\Microsoft\Windows Defender\
        Image|endswith:
          - \MpCopyAccelerator.exe
          - \MsMpEng.exe
    filter_optional_thor:
        Image|endswith:
          - \thor64.exe
          - \thor.exe
    selection_unistore:
        FileName|contains: \AppData\Local\Comms\Unistore\data
    selection_unistoredb:
        FileName|endswith: \AppData\Local\Comms\UnistoreDB\store.vol
falsepositives:
  - Antivirus, Anti-Spyware, Anti-Malware Software
  - Backup software
  - Legitimate software installed on partitions other than "C:\"
  - Searching software such as "everything.exe"
level: low
customer: 'demo'
tags:
  - attack.t1070.008
  - attack.defense_evasion
  - DEMO
