
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Access To Browser Credential Files By Uncommon Application
id: 91cb43db-302a-47e3-b3c8-7ede481e27bf
status: experimental
description: |
    Detects file access requests to browser credential stores by uncommon processes.
    Could indicate potential attempt of credential stealing.
    Requires heavy baselining before usage
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/09 21:07:01
references:
  - https://www.zscaler.com/blogs/security-research/ffdroider-stealer-targeting-social-media-platform-users
  - https://github.com/lclevy/firepwd
logsource:
    category: file_access
    product: windows
    definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
    condition: 1 of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_generic:
        Image|contains:
          - :\Program Files\
          - :\Program Files (x86)\
          - :\WINDOWS\system32\
          - :\WINDOWS\SysWOW64\
    filter_main_system:
        Image: System
    filter_optional_defender:
        Image|contains: :\ProgramData\Microsoft\Windows Defender\
        Image|endswith:
          - \MpCopyAccelerator.exe
          - \MsMpEng.exe
    filter_optional_thor:
        Image|endswith:
          - \thor64.exe
          - \thor.exe
    selection_chromium:
        FileName|contains:
          - \Appdata\Local\Chrome\User Data\Default\Login Data
          - \AppData\Local\Google\Chrome\User Data\Default\Network\Cookies
          - \AppData\Local\Google\Chrome\User Data\Local State
    selection_firefox:
        FileName|endswith:
          - \cookies.sqlite
          - release\key3.db
          - release\key4.db
          - release\logins.json
    selection_ie:
        FileName|endswith: \Appdata\Local\Microsoft\Windows\WebCache\WebCacheV01.dat
falsepositives:
  - Antivirus, Anti-Spyware, Anti-Malware Software
  - Backup software
  - Legitimate software installed on partitions other than "C:\"
  - Searching software such as "everything.exe"
level: medium
customer: 'demo'
modified: 2023/12/18
tags:
  - attack.t1003
  - attack.credential_access
  - DEMO
