
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: BloodHound Collection Files
id: 02773bed-83bf-469f-b7ff-e676e7d78bab
status: test
description: Detects default file names outputted by the BloodHound collection tool
    SharpHound
author: C.J. May
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/09 13:14:11
references:
  - https://academy.hackthebox.com/course/preview/active-directory-bloodhound/bloodhound--data-collection
logsource:
    category: file_event
    product: windows
detection:
    condition: selection and not 1 of filter_optional_*
    filter_optional_ms_winapps:
        Image|endswith: \svchost.exe
        TargetFilename|endswith: \pocket_containers.json
        TargetFilename|startswith: C:\Program Files\WindowsApps\Microsoft.
    selection:
        TargetFilename|endswith:
          - BloodHound.zip
          - _computers.json
          - _containers.json
          - _domains.json
          - _gpos.json
          - _groups.json
          - _ous.json
          - _users.json
falsepositives: Some false positives may arise in some environment and this may require
    some tuning. Add additional filters or reduce level depending on the level of
    noise
level: high
customer: 'demo'
modified: 2023/03/29
tags:
  - attack.discovery
  - attack.t1087.001
  - attack.t1087.002
  - attack.t1482
  - attack.t1069.001
  - attack.t1069.002
  - attack.execution
  - attack.t1059.001
  - DEMO
