
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Creation with Colorcpl
id: e15b518d-b4ce-4410-a9cd-501f23ce4a18
status: test
description: Once executed, colorcpl.exe will copy the arbitrary file to c:\windows\system32\spool\drivers\color\
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/21 15:05:01
references:
  - https://twitter.com/eral4m/status/1480468728324231172?s=20
logsource:
    category: file_event
    product: windows
detection:
    condition: selection and not 1 of filter_*
    filter_ext:
        TargetFilename|endswith:
          - .icm
          - .gmmp
          - .cdmp
          - .camp
    selection:
        Image|endswith: \colorcpl.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/05
tags:
  - attack.defense_evasion
  - attack.t1564
  - DEMO
