
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: LSASS Process Dump Artefact In CrashDumps Folder
id: 6902955a-01b7-432c-b32a-6f5f81d8f625
status: test
description: Detects the presence of an LSASS dump file in the "CrashDumps" folder.
    This could be a sign of LSASS credential dumping. Techniques such as the LSASS
    Shtinkering have been seen abusing the Windows Error Reporting to dump said process.
author: '@pbssubhash'
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/12/08 18:03:01
references:
  - https://github.com/deepinstinct/Lsass-Shtinkering
  - https://media.defcon.org/DEF%20CON%2030/DEF%20CON%2030%20presentations/Asaf%20Gilboa%20-%20LSASS%20Shtinkering%20Abusing%20Windows%20Error%20Reporting%20to%20Dump%20LSASS.pdf
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
        TargetFilename|contains: lsass.exe.
        TargetFilename|endswith: .dmp
        TargetFilename|startswith: C:\Windows\System32\config\systemprofile\AppData\Local\CrashDumps\
falsepositives: Rare legitimate dump of the process by the operating system due to
    a crash of lsass
level: high
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1003.001
  - DEMO
