
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: CVE-2021-1675 Print Spooler Exploitation Filename Pattern
id: 2131cfb3-8c12-45e8-8fa0-31f5924e9f07
status: test
description: Detects the default filename used in PoC code against print spooler vulnerability
    CVE-2021-1675
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/06/29 19:46:41
references:
  - https://github.com/hhlxf/PrintNightmare
  - https://github.com/afwu/PrintNightmare
  - https://github.com/cube0x0/CVE-2021-1675
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
        TargetFilename|contains: C:\Windows\System32\spool\drivers\x64\3\old\1\123
fields:
  - ComputerName
  - TargetFilename
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2022/12/25
tags:
  - attack.execution
  - attack.privilege_escalation
  - attack.resource_development
  - attack.t1587
  - cve.2021.1675
  - detection.emerging_threats
  - DEMO
