
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: LiveKD Driver Creation By Uncommon Process
id: 059c5af9-5131-4d8d-92b2-de4ad6146712
related:
  - type: similar
    id: 16fe46bb-4f64-46aa-817d-ff7bec4a2352
status: experimental
description: Detects the creation of the LiveKD driver by a process image other than
    "livekd.exe".
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/16 16:51:41
references:
  - Internal Research
logsource:
    category: file_event
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_legit_name:
        Image|endswith:
          - \livekd.exe
          - \livek64.exe
    selection:
        TargetFilename: C:\Windows\System32\drivers\LiveKdD.SYS
falsepositives: Administrators might rename LiveKD before its usage which could trigger
    this. Add additional names you use to the filter
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - DEMO
