
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Startup Folder Persistence
id: 28208707-fe31-437f-9a7f-4b1108b94d2e
related:
  - type: similar
    id: 2aa0a6b4-a865-495b-ab51-c28249537b75
status: test
description: Detects when a file with a suspicious extension is created in the startup
    folder
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/10 16:15:11
references:
  - https://github.com/last-byte/PersistenceSniper
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
        TargetFilename|contains: \Windows\Start Menu\Programs\Startup\
        TargetFilename|endswith:
          - .vbs
          - .vbe
          - .bat
          - .ps1
          - .hta
          - .dll
          - .jar
          - .msi
          - .scr
          - .cmd
falsepositives: Rare legitimate usage of some of the extensions mentioned in the rule
level: high
customer: 'demo'
modified: 2023/01/06
tags:
  - attack.persistence
  - attack.t1547.001
  - DEMO
