
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: CrackMapExec File Indicators
id: 736ffa74-5f6f-44ca-94ef-1c0df4f51d2a
related:
  - type: obsoletes
    id: 9433ff9c-5d3f-4269-99f8-95fc826ea489
status: experimental
description: Detects file creation events with filename patterns used by CrackMapExec.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/03/11 13:21:11
references:
  - https://github.com/byt3bl33d3r/CrackMapExec/
logsource:
    category: file_event
    product: windows
detection:
    condition: selection_path and 1 of selection_names_*
    selection_names_re:
      - TargetFilename|re: \\[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}\.txt$
      - TargetFilename|re: \\[a-zA-Z]{8}\.tmp$
    selection_names_str:
        TargetFilename|endswith:
          - \temp.ps1
          - \msol.ps1
    selection_path:
        TargetFilename|startswith: C:\Windows\Temp\
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.credential_access
  - attack.t1003.001
  - DEMO
