
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-06-21 19:00
# Generated for User: demo
# Number of Rules: 3228
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Forest Blizzard APT - JavaScript Constrained File Creation
id: ec7c4e9b-9bc9-47c7-a32f-b53b598da642
status: experimental
description: |
    Detects the creation of JavaScript files inside of the DriverStore directory.
    Forest Blizzard used this to exploit the CVE-2022-38028 vulnerability in Windows Print Spooler service by modifying a JavaScript constraints file and executing it with SYSTEM-level permissions.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/04/23 20:47:31
references:
  - https://www.microsoft.com/en-us/security/blog/2024/04/22/analyzing-forest-blizzards-custom-post-compromise-tool-for-exploiting-cve-2022-38028-to-obtain-credentials/
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
        TargetFilename|endswith: \.js
        TargetFilename|startswith: C:\Windows\System32\DriverStore\FileRepository\
falsepositives: Unlikely
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1562.002
  - DEMO
