
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: NTDS.DIT Creation By Uncommon Parent Process
id: 4e7050dd-e548-483f-b7d6-527ab4fa784d
related:
  - type: similar
    id: 11b1ed55-154d-4e82-8ad7-83739298f720
status: test
description: Detects creation of a file named "ntds.dit" (Active Directory Database)
    by an uncommon parent process or directory
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/03/11 16:58:11
references:
  - https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
  - https://www.n00py.io/2022/03/manipulating-user-passwords-without-mimikatz/
  - https://pentestlab.blog/tag/ntds-dit/
  - https://github.com/samratashok/nishang/blob/414ee1104526d7057f9adaeee196d91ae447283e/Gather/Copy-VSS.ps1
logsource:
    category: file_event
    product: windows
    definition: 'Requirements: The "ParentImage" field is not available by default
        on EID 11 of Sysmon logs. To be able to use this rule to the full extent you
        need to enrich the log with additional ParentImage data'
detection:
    condition: selection_file and 1 of selection_process_*
    selection_file:
        TargetFilename|endswith: \ntds.dit
    selection_process_parent:
        ParentImage|endswith:
          - \cscript.exe
          - \httpd.exe
          - \nginx.exe
          - \php-cgi.exe
          - \powershell.exe
          - \pwsh.exe
          - \w3wp.exe
          - \wscript.exe
    selection_process_parent_path:
        ParentImage|contains:
          - \apache
          - \tomcat
          - \AppData\
          - \Temp\
          - \Public\
          - \PerfLogs\
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/05
tags:
  - attack.credential_access
  - attack.t1003.003
  - DEMO
