
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: PSScriptPolicyTest Creation By Uncommon Process
id: 1027d292-dd87-4a1a-8701-2abe04d7783c
status: experimental
description: Detects the creation of the "PSScriptPolicyTest" PowerShell script by
    an uncommon process. This file is usually generated by Microsoft Powershell to
    test against Applocker.
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/06/01 18:37:51
references:
  - https://www.paloaltonetworks.com/blog/security-operations/stopping-powershell-without-powershell/
logsource:
    category: file_event
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_generic:
        Image|endswith:
          - :\Program Files\PowerShell\7-preview\pwsh.exe
          - :\Program Files\PowerShell\7\pwsh.exe
          - :\Windows\System32\dsac.exe
          - :\Windows\System32\sdiagnhost.exe
          - :\Windows\System32\ServerManager.exe
          - :\Windows\System32\WindowsPowerShell\v1.0\powershell_ise.exe
          - :\Windows\System32\WindowsPowerShell\v1.0\powershell.exe
          - :\Windows\System32\wsmprovhost.exe
          - :\Windows\SysWOW64\sdiagnhost.exe
          - :\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell_ise.exe
          - :\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell.exe
    selection:
        TargetFilename|contains: __PSScriptPolicyTest_
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/12/11
tags:
  - attack.defense_evasion
  - DEMO
