
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: UAC Bypass Using .NET Code Profiler on MMC
id: 93a19907-d4f9-4deb-9f91-aac4692776a6
status: test
description: Detects the pattern of UAC Bypass using .NET Code Profiler and mmc.exe
    DLL hijacking (UACMe 39)
author: Christian Burkard (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/08/30 15:46:21
references:
  - https://github.com/hfiref0x/UACME
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
        TargetFilename|endswith: \AppData\Local\Temp\pe386.dll
        TargetFilename|startswith: C:\Users\
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1548.002
  - DEMO
