
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Cred Dump Tools Dropped Files
id: 8fbf3271-1ef6-4e94-8210-03c2317947f6
status: test
description: Files with well-known filenames (parts of credential dump software or
    files produced by them) creation
author: Teymur Kheirkhabarov, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/11/01 13:23:41
references:
  - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
logsource:
    category: file_event
    product: windows
detection:
    condition: selection
    selection:
      - TargetFilename|contains:
          - \fgdump-log
          - \kirbi
          - \pwdump
          - \pwhashes
          - \wce_ccache
          - \wce_krbtkts
      - TargetFilename|endswith:
          - \cachedump.exe
          - \cachedump64.exe
          - \DumpExt.dll
          - \DumpSvc.exe
          - \Dumpy.exe
          - \fgexec.exe
          - \lsremora.dll
          - \lsremora64.dll
          - \NTDS.out
          - \procdump64.exe
          - \pstgdump.exe
          - \pwdump.exe
          - \SAM.out
          - \SECURITY.out
          - \servpw.exe
          - \servpw64.exe
          - \SYSTEM.out
          - \test.pwd
          - \wceaux.dll
falsepositives: Legitimate Administrator using tool for password recovery
level: high
customer: 'demo'
modified: 2022/09/21
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.t1003.002
  - attack.t1003.003
  - attack.t1003.004
  - attack.t1003.005
  - DEMO
