
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: AD Groups Or Users Enumeration Using PowerShell - PoshModule
id: 815bfc17-7fc6-4908-a55e-2f37b98cedb4
status: test
description: |
    Adversaries may attempt to find domain-level groups and permission settings.
    The knowledge of domain-level permission groups can help adversaries determine which groups exist and which users belong to a particular group.
    Adversaries may use this information to determine which users have elevated permissions, such as domain administrators.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/15 21:21:11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    condition: 1 of selection_*
    selection_ad_principal:
      - Payload|contains: get-ADPrincipalGroupMembership
      - ContextInfo|contains: get-ADPrincipalGroupMembership
    selection_get_aduser:
      - Payload|contains|all:
          - get-aduser
          - '-f '
          - '-pr '
          - DoesNotRequirePreAuth
      - ContextInfo|contains|all:
          - get-aduser
          - '-f '
          - '-pr '
          - DoesNotRequirePreAuth
falsepositives: Administrator script
level: low
customer: 'demo'
modified: 2023/01/20
tags:
  - attack.discovery
  - attack.t1069.001
  - DEMO
