
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious PowerShell Download - PoshModule
id: de41232e-12e8-49fa-86bc-c05c7e722df9
related:
  - type: derived
    id: 65531a81-a694-4e31-ae04-f8ba5bc33759
status: test
description: Detects suspicious PowerShell download command
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/03/05 17:28:11
references:
  - https://learn.microsoft.com/en-us/dotnet/api/system.net.webclient.downloadfile?view=net-8.0
  - https://learn.microsoft.com/en-us/dotnet/api/system.net.webclient.downloadstring?view=net-8.0
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    condition: all of selection_*
    selection_function:
        ContextInfo|contains:
          - .DownloadFile(
          - .DownloadString(
    selection_webclient_:
        ContextInfo|contains: System.Net.WebClient
falsepositives: PowerShell scripts that download content from the Internet
level: medium
customer: 'demo'
modified: 2023/01/20
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
