
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Invoke-Obfuscation Via Use MSHTA - PowerShell Module
id: 07ad2ea8-6a55-4ac6-bf3e-91b8e59676eb
related:
  - type: derived
    id: e55a5195-4724-480e-a77e-3ebe64bd3759
status: test
description: Detects Obfuscated Powershell via use MSHTA in Scripts
author: Nikita Nazarov, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/08 18:57:21
references:
  - https://github.com/SigmaHQ/sigma/issues/1009
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    condition: selection
    selection:
        Payload|contains|all:
          - set
          - '&&'
          - mshta
          - vbscript:createobject
          - .run
          - (window.close)
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/04
tags:
  - attack.defense_evasion
  - attack.t1027
  - attack.execution
  - attack.t1059.001
  - DEMO
