
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: AWS Console GetSigninToken Potential Abuse
id: f8103686-e3e8-46f3-be72-65f7fcb4aa53
status: experimental
description: |
    Detects potentially suspicious events involving "GetSigninToken".
    An adversary using the "aws_consoler" tool can leverage this console API to create temporary federated credential that help obfuscate which AWS credential is compromised (the original access key) and enables the adversary to pivot from the AWS CLI to console sessions without the need for MFA using the new access key issued in this request.
author: Chester Le Bron (@123Le_Bron)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/02/26 16:57:11
references:
  - https://github.com/NetSPI/aws_consoler
  - https://www.crowdstrike.com/blog/analysis-of-intrusion-campaign-targeting-telecom-and-bpo-companies/
logsource:
    product: aws
    service: cloudtrail
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_console_ua:
        userAgent|contains: Jersey/${project.version}
    selection:
        eventName: GetSigninToken
        eventSource: signin.amazonaws.com
falsepositives: GetSigninToken events will occur when using AWS SSO portal to login
    and will generate false positives if you do not filter for the expected user agent(s),
    see filter. Non-SSO configured roles would be abnormal and should be investigated.
level: medium
customer: 'demo'
tags:
  - attack.lateral_movement
  - attack.t1021.007
  - attack.t1550.001
  - DEMO
