
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: AWS IAM S3Browser LoginProfile Creation
id: db014773-b1d3-46bd-ba26-133337c0ffee
status: experimental
description: Detects S3 Browser utility performing reconnaissance looking for existing
    IAM Users without a LoginProfile defined then (when found) creating a LoginProfile.
author: daniel.bohannon@permiso.io (@danielhbohannon)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/17 15:43:11
references:
  - https://permiso.io/blog/s/unmasking-guivil-new-cloud-threat-actor
logsource:
    product: aws
    service: cloudtrail
detection:
    condition: selection
    selection:
        eventName:
          - GetLoginProfile
          - CreateLoginProfile
        eventSource: iam.amazonaws.com
        userAgent|contains: S3 Browser
falsepositives: Valid usage of S3 Browser for IAM LoginProfile listing and/or creation
level: high
customer: 'demo'
tags:
  - attack.execution
  - attack.persistence
  - attack.t1059.009
  - attack.t1078.004
  - DEMO
