
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Security Support Provider (SSP) Added to LSA Configuration
id: eeb30123-9fbd-4ee8-aaa0-2e545bbed6dc
status: test
description: Detects the addition of a SSP to the registry. Upon a reboot or API call,
    SSP DLLs gain access to encrypted and plaintext passwords stored in Windows.
author: iwillkeepwatch
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/01/18 20:43:21
references:
  - https://powersploit.readthedocs.io/en/latest/Persistence/Install-SSP/
logsource:
    category: registry_event
    product: windows
detection:
    condition: selection_registry and not exclusion_images
    exclusion_images:
        Image:
          - C:\Windows\system32\msiexec.exe
          - C:\Windows\syswow64\MsiExec.exe
    selection_registry:
        TargetObject:
          - HKLM\System\CurrentControlSet\Control\Lsa\Security Packages
          - HKLM\System\CurrentControlSet\Control\Lsa\OSConfig\Security Packages
falsepositives: Unlikely
level: critical
customer: 'demo'
modified: 2022/08/09
tags:
  - attack.persistence
  - attack.t1547.005
  - DEMO
