
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: NetNTLM Downgrade Attack - Registry
id: d67572a0-e2ec-45d6-b8db-c100d14b8ef2
status: test
description: Detects NetNTLM downgrade attack
author: Florian Roth (Nextron Systems), wagga
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/03/20 14:47:11
references:
  - https://web.archive.org/web/20171113231705/https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks
logsource:
    category: registry_event
    product: windows
detection:
    condition: selection
    selection:
        TargetObject|contains|all:
          - SYSTEM\
          - ControlSet
          - \Control\Lsa
        TargetObject|endswith:
          - \lmcompatibilitylevel
          - \NtlmMinClientSec
          - \RestrictSendingNTLMTraffic
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/11/29
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - attack.t1112
  - DEMO
