
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Windows Credential Editor Registry
id: a6b33c02-8305-488f-8585-03cb2a7763f2
status: test
description: Detects the use of Windows Credential Editor (WCE)
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/12/31 15:15:41
references:
  - https://www.ampliasecurity.com/research/windows-credentials-editor/
logsource:
    category: registry_event
    product: windows
detection:
    condition: selection
    selection:
        TargetObject|contains: Services\WCESERVICE\Start
falsepositives: Unknown
level: critical
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.credential_access
  - attack.t1003.001
  - attack.s0005
  - DEMO
