
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: OilRig APT Registry Persistence
id: 7bdf2a7c-3acc-4091-9581-0a77dad1c5b5
related:
  - type: similar
    id: 53ba33fd-3a50-4468-a5ef-c583635cfa92
  - type: similar
    id: c0580559-a6bd-4ef6-b9b7-83703d98b561
  - type: similar
    id: ce6e34ca-966d-41c9-8d93-5b06c8b97a06
status: test
description: Detects OilRig registry persistence as reported by Nyotron in their March
    2018 report
author: Florian Roth (Nextron Systems), Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy,
    oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/03/23 14:06:51
references:
  - https://web.archive.org/web/20180402134442/https://nyotron.com/wp-content/uploads/2018/03/Nyotron-OilRig-Malware-Report-March-2018C.pdf
logsource:
    category: registry_event
    product: windows
detection:
    condition: selection
    selection:
        TargetObject|endswith:
          - SOFTWARE\Microsoft\Windows\CurrentVersion\UMe
          - SOFTWARE\Microsoft\Windows\CurrentVersion\UT
falsepositives: Unlikely
level: critical
customer: 'demo'
modified: 2023/03/08
tags:
  - attack.persistence
  - attack.g0049
  - attack.t1053.005
  - attack.s0111
  - attack.t1543.003
  - attack.defense_evasion
  - attack.t1112
  - attack.command_and_control
  - attack.t1071.004
  - DEMO
