
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Disable Security Events Logging Adding Reg Key MiniNt
id: 919f2ef0-be2d-4a7a-b635-eb2b41fde044
status: test
description: Detects the addition of a key 'MiniNt' to the registry. Upon a reboot,
    Windows Event Log service will stopped write events.
author: Ilyas Ochkov, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/25 19:31:31
references:
  - https://twitter.com/0gtweet/status/1182516740955226112
logsource:
    category: registry_event
    product: windows
detection:
    condition: selection
    selection:
      - EventType: CreateKey
        TargetObject: HKLM\SYSTEM\CurrentControlSet\Control\MiniNt
      - NewName: HKLM\SYSTEM\CurrentControlSet\Control\MiniNt
fields:
  - EventID
  - Image
  - TargetObject
  - NewName
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.defense_evasion
  - attack.t1562.001
  - attack.t1112
  - DEMO
