
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Windows Registry Trust Record Modification
id: 295a59c1-7b79-4b47-a930-df12c15fc9c2
related:
  - type: similar
    id: a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd
status: test
description: Alerts on trust record modification within the registry, indicating usage
    of macros
author: Antonlovesdnb, Trent Liffick (@tliffick)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/02/19 17:27:11
references:
  - https://outflank.nl/blog/2018/01/16/hunting-for-evil-detect-macros-being-executed/
  - http://az4n6.blogspot.com/2016/02/more-on-trust-records-macros-and.html
  - https://twitter.com/inversecos/status/1494174785621819397
logsource:
    category: registry_event
    product: windows
detection:
    condition: selection
    selection:
        TargetObject|contains: \Security\Trusted Documents\TrustRecords
falsepositives: This will alert on legitimate macro usage as well, additional tuning
    is required
level: medium
customer: 'demo'
modified: 2023/06/21
tags:
  - attack.initial_access
  - attack.t1566.001
  - DEMO
