
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Sysmon Blocked File Shredding
id: c3e5c1b1-45e9-4632-b242-27939c170239
status: experimental
description: Triggers on any Sysmon "FileBlockShredding" event, which indicates a
    violation of the configured shredding policy.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/07/20 13:36:51
references:
  - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
logsource:
    product: windows
    service: sysmon
detection:
    condition: selection
    selection:
        EventID: "28"
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.defense_evasion
  - DEMO
