
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Remote Thread Created In KeePass.EXE
id: 77564cc2-7382-438b-a7f6-395c2ae53b9a
status: test
description: Detects remote thread creation in "KeePass.exe" which could indicates
    potential password dumping activity
author: Timon Hackenjos
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/22 14:50:31
references:
  - https://www.cisa.gov/uscert/ncas/alerts/aa20-259a
  - https://github.com/denandz/KeeFarce
  - https://github.com/GhostPack/KeeThief
logsource:
    category: create_remote_thread
    product: windows
detection:
    condition: selection
    selection:
        TargetImage|endswith: \KeePass.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/05/05
tags:
  - attack.credential_access
  - attack.t1555.005
  - DEMO
