
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Credential Dumping Attempt Via PowerShell Remote Thread
id: fb656378-f909-47c1-8747-278bf09f4f4f
related:
  - type: obsoletes
    id: 3f07b9d1-2082-4c56-9277-613a621983cc
  - type: similar
    id: 0f920ebe-7aea-4c54-b202-9aa0c609cfe5
status: test
description: Detects remote thread creation by PowerShell processes into "lsass.exe"
author: oscd.community, Natalia Shornikova
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/06 23:10:31
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
logsource:
    category: create_remote_thread
    product: windows
detection:
    condition: selection
    selection:
        SourceImage|endswith:
          - \powershell.exe
          - \pwsh.exe
        TargetImage|endswith: \lsass.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/12/18
tags:
  - attack.credential_access
  - attack.t1003.001
  - DEMO
