
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Rare Remote Thread Creation By Uncommon Source Image
id: 02d1d718-dd13-41af-989d-ea85c7fab93f
related:
  - type: derived
    id: 66d31e5f-52d6-40a4-9615-002d3789a119
status: experimental
description: Detects uncommon processes creating remote threads.
author: Perez Diego (@darkquassar), oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/27 19:19:41
references:
  - Personal research, statistical analysis
  - https://lolbas-project.github.io
logsource:
    category: create_remote_thread
    product: windows
detection:
    condition: selection
    selection:
        SourceImage|endswith:
          - \bash.exe
          - \cscript.exe
          - \cvtres.exe
          - \defrag.exe
          - \dnx.exe
          - \esentutl.exe
          - \excel.exe
          - \expand.exe
          - \find.exe
          - \findstr.exe
          - \forfiles.exe
          - \gpupdate.exe
          - \hh.exe
          - \installutil.exe
          - \lync.exe
          - \makecab.exe
          - \mDNSResponder.exe
          - \monitoringhost.exe
          - \msbuild.exe
          - \mshta.exe
          - \mspaint.exe
          - \outlook.exe
          - \ping.exe
          - \provtool.exe
          - \python.exe
          - \regsvr32.exe
          - \robocopy.exe
          - \runonce.exe
          - \sapcimc.exe
          - \smartscreen.exe
          - \spoolsv.exe
          - \tstheme.exe
          - \userinit.exe
          - \vssadmin.exe
          - \vssvc.exe
          - \w3wp.exe
          - \winscp.exe
          - \winword.exe
          - \wmic.exe
          - \wscript.exe
falsepositives: This rule is best put in testing first in order to create a baseline
    that reflects the data in your environment.
level: high
customer: 'demo'
modified: 2024/01/17
tags:
  - attack.privilege_escalation
  - attack.defense_evasion
  - attack.t1055
  - DEMO
