
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Password Dumper Remote Thread in LSASS
id: f239b326-2f41-4d6b-9dfa-c846a60ef505
status: stable
description: |
    Detects password dumper activity by monitoring remote thread creation EventID 8 in combination with the lsass.exe process as TargetImage.
    The process in field Process is the malicious program. A single execution can lead to hundreds of events.
author: Thomas Patzke
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/02/19 15:36:11
references:
  - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/WCE.htm
logsource:
    category: create_remote_thread
    product: windows
detection:
    condition: selection
    selection:
        StartModule: ""
        TargetImage|endswith: \lsass.exe
falsepositives: Antivirus products
level: high
customer: 'demo'
modified: 2021/06/21
tags:
  - attack.credential_access
  - attack.s0005
  - attack.t1003.001
  - DEMO
