
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Bitbucket Unauthorized Access To A Resource
id: 7215374a-de4f-4b33-8ba5-70804c9251d3
status: experimental
description: Detects unauthorized access attempts to a resource.
author: Muhammad Faisal (@faisalusuf)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/02/25 17:16:51
references:
  - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Advance" log level is required to receive these audit
        events.'
detection:
    condition: selection
    selection:
        auditType.action: Unauthorized access to a resource
        auditType.category: Security
falsepositives: Access attempts to non-existent repositories or due to outdated plugins.
    Usually "Anonymous" user is reported in the "author.name" field in most cases.
level: critical
customer: 'demo'
tags:
  - attack.resource_development
  - attack.t1586
  - DEMO
