
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Bitbucket User Details Export Attempt Detected
id: 5259cbf2-0a75-48bf-b57a-c54d6fabaef3
status: experimental
description: Detects user data export activity.
author: Muhammad Faisal (@faisalusuf)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/02/25 18:11:31
references:
  - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
  - https://support.atlassian.com/security-and-access-policies/docs/export-user-accounts
logsource:
    product: bitbucket
    service: audit
    definition: 'Requirements: "Advance" log level is required to receive these audit
        events.'
detection:
    condition: selection
    selection:
        auditType.action:
          - User permissions export failed
          - User permissions export started
          - User permissions exported
        auditType.category: Users and groups
falsepositives: Legitimate user activity.
level: medium
customer: 'demo'
tags:
  - attack.collection
  - attack.reconnaissance
  - attack.discovery
  - attack.t1213
  - attack.t1082
  - attack.t1591.004
  - DEMO
