title: Setting Suspicious Powershell Cmdlet Alias Via CLI
id: 358f662a-f523-4ccb-9a45-b7dbdd156e18
related:
    - id: 734eb6a3-b329-4772-8670-5c7c2398ce14
      type: similar
status: experimental
description: Detects when attackers set aliases for powershell commands or cmdlet using the "new-alias" cmdlet to avoid detection based on command-line argument
references:
    - https://app.any.run/tasks/63cd5e03-647a-4f1d-81b1-9c70bb793c73/
author: Nasreddine Bencherchali
date: 2022/06/07
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1059
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_alias:
        CommandLine|contains:
            - 'New-Alias '
            - ' nal '
            - 'Set-Alias '
            - ' sal '
    selection_value:
        CommandLine|contains: # More variants will be added as they are discovered
            - ' -Value iex'
            - ' -Value iwr'
            - ' -Value Invoke-'
    condition: 1 of selection*
falsepositives:
    - Unknown
level: high
