title: Cmdkey Windows Shell ZipFolder Genric Add
id: ab551b05-c907-4d42-a96a-12d0897798d4
status: experimental
description: Detects execution of cmdkey with the generic flag to add the password of password-protected zip file. This is used to then automatically extract the content of the zip file programmatically (see the github reference for an example)
date: 2022/11/09
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://github.com/Tylous/ZipExec/blob/f8d661fab20cb4d52e47f140f48f9ea34d176acb/Demo/Example.js
    - https://twitter.com/sbousseaden/status/1523383197513379841?lang=en
    - https://twitter.com/SBousseaden/status/1589536286817554432
    - https://www.joesandbox.com/analysis/299523/2/html
author: Nasreddine Bencherchali
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmdkey:
        - Image|endswith: '\cmdkey.exe'
        - OriginalFileName: 'cmdkey.exe'
    selection_cli:
        CommandLine|contains:
            # Example: cmdkey /generic:Microsoft_Windows_Shell_ZipFolder:filename=C:\temp\test.zip /pass:test /user:""
            - 'filename='
            - 'Microsoft_Windows_Shell_ZipFolder'
    condition: all of selection*
falsepositives:
    - Legitimate addition of the password by administrator for ease of use
level: medium
