
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: File Download From Browser Process Via Inline URL
id: 94771a71-ba41-4b6e-a757-b531372eaab6
status: test
description: Detects execution of a browser process with a URL argument pointing to
    a file with a potentially interesting extension. This can be abused to download
    arbitrary files or to hide from the user for example by launching the browser
    in a minimized state.
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/11 18:21:31
references:
  - https://twitter.com/mrd0x/status/1478116126005641220
  - https://lolbas-project.github.io/lolbas/Binaries/Msedge/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_extensions:
        CommandLine|endswith:
          - .7z
          - .dat
          - .dll
          - .exe
          - .hta
          - .ps1
          - .psm1
          - .txt
          - .vbe
          - .vbs
          - .zip
    selection_http:
        CommandLine|contains: http
    selection_img:
        Image|endswith:
          - \brave.exe
          - \chrome.exe
          - \msedge.exe
          - \opera.exe
          - \vivaldi.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/11/09
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
