
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Russian APT Credential Theft Activity
id: b83f5166-9237-4b5e-9cd4-7b5d52f4d8ee
status: stable
description: Detects Russian group activity as described in Global Threat Report 2019
    by Crowdstrike
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/02/21 18:20:51
references:
  - https://www.documentcloud.org/documents/5743766-Global-Threat-Report-2019.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_adexplorer:
        CommandLine|contains|all:
          - adexplorer -snapshot "" c:\users\
          - \downloads\
          - .snp
    selection_xcopy:
        CommandLine|contains|all:
          - xcopy /S /E /C /Q /H \\\\
          - \sysvol\
falsepositives: Unlikely
level: critical
customer: 'demo'
modified: 2023/03/08
tags:
  - attack.credential_access
  - attack.t1552.001
  - attack.t1003.003
  - detection.emerging_threats
  - DEMO
