title: Villain PowerShell ReverseShell Encoded/Obfuscated Usage
id: e70a4a40-40b8-401c-ae7a-7b1e4f2da0ce
status: experimental
description: Detects the execution of encoded/obfuscated PowerShell code similar to the one used in Villain payloads
author: Nasreddine Bencherchali
references:
    - https://github.com/t3l3machus/Villain/
date: 2022/12/29
tags:
    - attack.command_and_control
    - attack.t1090
logsource:
    category: process_creation
    product: windows
detection:
    selection_encoded_body:
        # All UTF-16 encoded and base64 encoded values of "-Body (["
        CommandLine|contains:
            - 'LQBiAG8AZAB5ACAA'
            - '0AYgBvAGQAeQAgA'
            - 'tAGIAbwBkAHkAIA'
            - 'LQBCAG8AZAB5ACAA'
            - '0AQgBvAGQAeQAgA'
            - 'tAEIAbwBkAHkAIA'
            - 'LQBiAE8AZAB5ACAA'
            - '0AYgBPAGQAeQAgA'
            - 'tAGIATwBkAHkAIA'
            - 'LQBCAE8AZAB5ACAA'
            - '0AQgBPAGQAeQAgA'
            - 'tAEIATwBkAHkAIA'
            - 'LQBiAG8ARAB5ACAA'
            - '0AYgBvAEQAeQAgA'
            - 'tAGIAbwBEAHkAIA'
            - 'LQBCAG8ARAB5ACAA'
            - '0AQgBvAEQAeQAgA'
            - 'tAEIAbwBEAHkAIA'
            - 'LQBiAE8ARAB5ACAA'
            - '0AYgBPAEQAeQAgA'
            - 'tAGIATwBEAHkAIA'
            - 'LQBCAE8ARAB5ACAA'
            - '0AQgBPAEQAeQAgA'
            - 'tAEIATwBEAHkAIA'
            - 'LQBiAG8AZABZACAA'
            - '0AYgBvAGQAWQAgA'
            - 'tAGIAbwBkAFkAIA'
            - 'LQBCAG8AZABZACAA'
            - '0AQgBvAGQAWQAgA'
            - 'tAEIAbwBkAFkAIA'
            - 'LQBiAE8AZABZACAA'
            - '0AYgBPAGQAWQAgA'
            - 'tAGIATwBkAFkAIA'
            - 'LQBCAE8AZABZACAA'
            - '0AQgBPAGQAWQAgA'
            - 'tAEIATwBkAFkAIA'
            - 'LQBiAG8ARABZACAA'
            - '0AYgBvAEQAWQAgA'
            - 'tAGIAbwBEAFkAIA'
            - 'LQBCAG8ARABZACAA'
            - '0AQgBvAEQAWQAgA'
            - 'tAEIAbwBEAFkAIA'
            - 'LQBiAE8ARABZACAA'
            - '0AYgBPAEQAWQAgA'
            - 'tAGIATwBEAFkAIA'
            - 'LQBCAE8ARABZACAA'
            - '0AQgBPAEQAWQAgA'
            - 'tAEIATwBEAFkAIA'
    selection_encoded_window:
        # All UTF-16 encoded and base64 encoded values of " -Windo"
        CommandLine|contains:
            - 'IAAtAHcAaQBuAGQAbw'
            - 'AALQB3AGkAbgBkAG8A'
            - 'gAC0AdwBpAG4AZABvA'
            - 'ACAALQBXAGkAbgBkAG8A'
            - 'AgAC0AVwBpAG4AZABvA'
            - 'AIAAtAFcAaQBuAGQAbw'
            - 'ACAALQB3AEkAbgBkAG8A'
            - 'AgAC0AdwBJAG4AZABvA'
            - 'AIAAtAHcASQBuAGQAbw'
            - 'ACAALQBXAEkAbgBkAG8A'
            - 'AgAC0AVwBJAG4AZABvA'
            - 'AIAAtAFcASQBuAGQAbw'
            - 'ACAALQB3AGkATgBkAG8A'
            - 'AgAC0AdwBpAE4AZABvA'
            - 'AIAAtAHcAaQBOAGQAbw'
            - 'ACAALQBXAGkATgBkAG8A'
            - 'AgAC0AVwBpAE4AZABvA'
            - 'AIAAtAFcAaQBOAGQAbw'
            - 'ACAALQB3AEkATgBkAG8A'
            - 'AgAC0AdwBJAE4AZABvA'
            - 'AIAAtAHcASQBOAGQAbw'
            - 'ACAALQBXAEkATgBkAG8A'
            - 'AgAC0AVwBJAE4AZABvA'
            - 'AIAAtAFcASQBOAGQAbw'
            - 'ACAALQB3AGkAbgBEAG8A'
            - 'AgAC0AdwBpAG4ARABvA'
            - 'AIAAtAHcAaQBuAEQAbw'
            - 'ACAALQBXAGkAbgBEAG8A'
            - 'AgAC0AVwBpAG4ARABvA'
            - 'AIAAtAFcAaQBuAEQAbw'
            - 'ACAALQB3AEkAbgBEAG8A'
            - 'AgAC0AdwBJAG4ARABvA'
            - 'AIAAtAHcASQBuAEQAbw'
            - 'ACAALQBXAEkAbgBEAG8A'
            - 'AgAC0AVwBJAG4ARABvA'
            - 'AIAAtAFcASQBuAEQAbw'
            - 'ACAALQB3AGkATgBEAG8A'
            - 'AgAC0AdwBpAE4ARABvA'
            - 'AIAAtAHcAaQBOAEQAbw'
            - 'ACAALQBXAGkATgBEAG8A'
            - 'AgAC0AVwBpAE4ARABvA'
            - 'AIAAtAFcAaQBOAEQAbw'
            - 'ACAALQB3AEkATgBEAG8A'
            - 'AgAC0AdwBJAE4ARABvA'
            - 'AIAAtAHcASQBOAEQAbw'
            - 'ACAALQBXAEkATgBEAG8A'
            - 'AgAC0AVwBJAE4ARABvA'
            - 'AIAAtAFcASQBOAEQAbw'
            - 'ACAALQB3AGkAbgBkAE8A'
            - 'AgAC0AdwBpAG4AZABPA'
            - 'AIAAtAHcAaQBuAGQATw'
            - 'ACAALQBXAGkAbgBkAE8A'
            - 'AgAC0AVwBpAG4AZABPA'
            - 'AIAAtAFcAaQBuAGQATw'
            - 'ACAALQB3AEkAbgBkAE8A'
            - 'AgAC0AdwBJAG4AZABPA'
            - 'AIAAtAHcASQBuAGQATw'
            - 'ACAALQBXAEkAbgBkAE8A'
            - 'AgAC0AVwBJAG4AZABPA'
            - 'AIAAtAFcASQBuAGQATw'
            - 'ACAALQB3AGkATgBkAE8A'
            - 'AgAC0AdwBpAE4AZABPA'
            - 'AIAAtAHcAaQBOAGQATw'
            - 'ACAALQBXAGkATgBkAE8A'
            - 'AgAC0AVwBpAE4AZABPA'
            - 'AIAAtAFcAaQBOAGQATw'
            - 'ACAALQB3AEkATgBkAE8A'
            - 'AgAC0AdwBJAE4AZABPA'
            - 'AIAAtAHcASQBOAGQATw'
            - 'ACAALQBXAEkATgBkAE8A'
            - 'AgAC0AVwBJAE4AZABPA'
            - 'AIAAtAFcASQBOAGQATw'
            - 'ACAALQB3AGkAbgBEAE8A'
            - 'AgAC0AdwBpAG4ARABPA'
            - 'AIAAtAHcAaQBuAEQATw'
            - 'ACAALQBXAGkAbgBEAE8A'
            - 'AgAC0AVwBpAG4ARABPA'
            - 'AIAAtAFcAaQBuAEQATw'
            - 'ACAALQB3AEkAbgBEAE8A'
            - 'AgAC0AdwBJAG4ARABPA'
            - 'AIAAtAHcASQBuAEQATw'
            - 'ACAALQBXAEkAbgBEAE8A'
            - 'AgAC0AVwBJAG4ARABPA'
            - 'AIAAtAFcASQBuAEQATw'
            - 'ACAALQB3AGkATgBEAE8A'
            - 'AgAC0AdwBpAE4ARABPA'
            - 'AIAAtAHcAaQBOAEQATw'
            - 'ACAALQBXAGkATgBEAE8A'
            - 'AgAC0AVwBpAE4ARABPA'
            - 'AIAAtAFcAaQBOAEQATw'
            - 'ACAALQB3AEkATgBEAE8A'
            - 'AgAC0AdwBJAE4ARABPA'
            - 'AIAAtAHcASQBOAEQATw'
            - 'ACAALQBXAEkATgBEAE8A'
            - 'AgAC0AVwBJAE4ARABPA'
            - 'AIAAtAFcASQBOAEQATw'
    selection_encoded_error:
        # All UTF-16 encoded and base64 encoded values of "-Error"
        CommandLine|contains:
            - 'LQBlAHIAcgBvAHIA'
            - '0AZQByAHIAbwByA'
            - 'tAGUAcgByAG8Acg'
            - 'AC0ARQByAHIAbwByA'
            - 'AtAEUAcgByAG8Acg'
            - 'ALQBFAHIAcgBvAHIA'
            - 'AC0AZQBSAHIAbwByA'
            - 'AtAGUAUgByAG8Acg'
            - 'ALQBlAFIAcgBvAHIA'
            - 'AC0ARQBSAHIAbwByA'
            - 'AtAEUAUgByAG8Acg'
            - 'ALQBFAFIAcgBvAHIA'
            - 'AC0AZQByAFIAbwByA'
            - 'AtAGUAcgBSAG8Acg'
            - 'ALQBlAHIAUgBvAHIA'
            - 'AC0ARQByAFIAbwByA'
            - 'AtAEUAcgBSAG8Acg'
            - 'ALQBFAHIAUgBvAHIA'
            - 'AC0AZQBSAFIAbwByA'
            - 'AtAGUAUgBSAG8Acg'
            - 'ALQBlAFIAUgBvAHIA'
            - 'AC0ARQBSAFIAbwByA'
            - 'AtAEUAUgBSAG8Acg'
            - 'ALQBFAFIAUgBvAHIA'
            - 'AC0AZQByAHIATwByA'
            - 'AtAGUAcgByAE8Acg'
            - 'ALQBlAHIAcgBPAHIA'
            - 'AC0ARQByAHIATwByA'
            - 'AtAEUAcgByAE8Acg'
            - 'ALQBFAHIAcgBPAHIA'
            - 'AC0AZQBSAHIATwByA'
            - 'AtAGUAUgByAE8Acg'
            - 'ALQBlAFIAcgBPAHIA'
            - 'AC0ARQBSAHIATwByA'
            - 'AtAEUAUgByAE8Acg'
            - 'ALQBFAFIAcgBPAHIA'
            - 'AC0AZQByAFIATwByA'
            - 'AtAGUAcgBSAE8Acg'
            - 'ALQBlAHIAUgBPAHIA'
            - 'AC0ARQByAFIATwByA'
            - 'AtAEUAcgBSAE8Acg'
            - 'ALQBFAHIAUgBPAHIA'
            - 'AC0AZQBSAFIATwByA'
            - 'AtAGUAUgBSAE8Acg'
            - 'ALQBlAFIAUgBPAHIA'
            - 'AC0ARQBSAFIATwByA'
            - 'AtAEUAUgBSAE8Acg'
            - 'ALQBFAFIAUgBPAHIA'
            - 'AC0AZQByAHIAbwBSA'
            - 'AtAGUAcgByAG8AUg'
            - 'ALQBlAHIAcgBvAFIA'
            - 'AC0ARQByAHIAbwBSA'
            - 'AtAEUAcgByAG8AUg'
            - 'ALQBFAHIAcgBvAFIA'
            - 'AC0AZQBSAHIAbwBSA'
            - 'AtAGUAUgByAG8AUg'
            - 'ALQBlAFIAcgBvAFIA'
            - 'AC0ARQBSAHIAbwBSA'
            - 'AtAEUAUgByAG8AUg'
            - 'ALQBFAFIAcgBvAFIA'
            - 'AC0AZQByAFIAbwBSA'
            - 'AtAGUAcgBSAG8AUg'
            - 'ALQBlAHIAUgBvAFIA'
            - 'AC0ARQByAFIAbwBSA'
            - 'AtAEUAcgBSAG8AUg'
            - 'ALQBFAHIAUgBvAFIA'
            - 'AC0AZQBSAFIAbwBSA'
            - 'AtAGUAUgBSAG8AUg'
            - 'ALQBlAFIAUgBvAFIA'
            - 'AC0ARQBSAFIAbwBSA'
            - 'AtAEUAUgBSAG8AUg'
            - 'ALQBFAFIAUgBvAFIA'
            - 'AC0AZQByAHIATwBSA'
            - 'AtAGUAcgByAE8AUg'
            - 'ALQBlAHIAcgBPAFIA'
            - 'AC0ARQByAHIATwBSA'
            - 'AtAEUAcgByAE8AUg'
            - 'ALQBFAHIAcgBPAFIA'
            - 'AC0AZQBSAHIATwBSA'
            - 'AtAGUAUgByAE8AUg'
            - 'ALQBlAFIAcgBPAFIA'
            - 'AC0ARQBSAHIATwBSA'
            - 'AtAEUAUgByAE8AUg'
            - 'ALQBFAFIAcgBPAFIA'
            - 'AC0AZQByAFIATwBSA'
            - 'AtAGUAcgBSAE8AUg'
            - 'ALQBlAHIAUgBPAFIA'
            - 'AC0ARQByAFIATwBSA'
            - 'AtAEUAcgBSAE8AUg'
            - 'ALQBFAHIAUgBPAFIA'
            - 'AC0AZQBSAFIATwBSA'
            - 'AtAGUAUgBSAE8AUg'
            - 'ALQBlAFIAUgBPAFIA'
            - 'AC0ARQBSAFIATwBSA'
            - 'AtAEUAUgBSAE8AUg'
            - 'ALQBFAFIAUgBPAFIA'
    condition: all of selection_encoded_*
falsepositives:
    - Unknown
level: high
