title: Sdiagnhost Calling Suspicious Descendant Process
id: 8655fa4b-e956-4ed4-b20d-151dfd8c802d
status: experimental
description: Detects sdiagnhost.exe calling a suspicious process as descendant ass seen in CVE-2022-30190 / Follina exploitation
author: Nextron Systems
references:
    - https://twitter.com/nao_sec/status/1530196847679401984
    - https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
date: 2022/06/01
modified: 2022/10/31
tags:
    - attack.defense_evasion
    - attack.t1036
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ProcessTree|contains: '\sdiagnhost.exe|'
        Image|endswith:
            # Add more suspicious LOLBins
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\cmd.exe'
            - '\mshta.exe'
            - '\cscript.exe'
            - '\wscript.exe'
            - '\taskkill.exe'
            - '\regsvr32.exe'
            - '\rundll32.exe'
            - '\calc.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
