title: Suspicious Tasks Running System Processes
id: b62ed848-810c-4e17-88a0-261539b05622
status: experimental
description: Detects suspicious execution of scheduled tasks with processes masquerading as system processes
references:
    - https://www.cisa.gov/uscert/sites/default/files/publications/aa22-320a_joint_csa_iranian_government-sponsored_apt_actors_compromise_federal%20network_deploy_crypto%20miner_credential_harvester.pdf
author: Nasreddine Bencherchali
date: 2022/11/17
tags:
    - attack.persistence
    - attack.execution
    - attack.privilege_escalation
    - attack.t1053.005
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\svchost.exe'
        ParentCommandLine|contains|all:
            - '-k netsvcs'
            - '-s Schedule'
        Image|endswith:
            # Add more suspicious binaries
            - '\calc.exe'
            - '\LogonUI.exe'
            - '\LsaIso.exe'
            - '\lsass.exe'
            - '\notepad.exe'
            - '\RuntimeBroker.exe'
            - '\smss.exe'
            - '\svchost.exe'
            - '\winlogon.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
