title: Renamed PortQry
id: 2cda88da-4e26-431a-88d8-77a7d8010315
status: experimental
description: Detects usage of a renamed version of PortQry tool for reconnaissance
references:
    - https://ss64.com/nt/portqry.html
    - https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/portqry-command-line-port-scanner-v2
    - https://www.cybereason.com/blog/research/deadringer-exposing-chinese-threat-actors-targeting-major-telcos
    - https://www.cybereason.com/blog/research/operation-soft-cell-a-worldwide-campaign-against-telecommunications-providers
    - https://www.welivesecurity.com/2021/06/10/backdoordiplomacy-upgrading-quarian-turian/
author: Nasreddine Bencherchali
date: 2022/05/10
modified: 2022/11/04
tags:
    - attack.discovery
    - attack.t1049
logsource:
    category: process_creation
    product: windows
detection:
    selection_cli_ip:
        CommandLine|contains:
            - ' -n 10.'
            - ' -n 127.'
            - ' -n 192.'
            - ' -n 172.'
    selection_cli_ports:
        CommandLine|contains:
            - ' -e 3389'
            - ' -e 53'
            - ' -e 445'
            - ' -e 135'
    filter:
        Image|endswith: '\PortQry.exe'
    condition: all of selection_cli_* and not filter
falsepositives:
    - Other command line tools that use the same flags and match the first characters of the values
level: high
