title: Uncommon DLL Export Called Using Rundll32
id: b337da90-6da5-42f0-ad64-ff47eb610123
status: experimental
description: Detects the execution rundll32 with uncommon export names often used in malware. Such as single letter or very short export names
references:
    - Internal Research
author: Nasreddine Bencherchali
date: 2022/12/14
tags:
    - attack.defense_evasion
    - attack.t1218.011
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\rundll32.exe'
        - OriginalFileName: 'RUNDLL32.EXE'
    selection_cli:
        # Example:
        #   rundll32 /S c:\\ProgramData\\msruntime.dll,fff # https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
        #   C:\Windows\system32\rundll32.exe C:\PROGRA~2\055553F1\05555332.dll,f1 # https://app.any.run/tasks/17e4a334-c2ce-49bc-b989-43870b6f9303
        - CommandLine|re: ',[a-zA-Z0-9]{1,6}'
        - CommandLine|re: ', [a-zA-Z0-9]{1,6}'
    selection_paths:
        CommandLine|contains:
            - '\ProgramData\'
            - '\AppData\'
            - '\Perflogs\'
            - '\Temp\'
            - '%tmp%'
            - '%temp%'
            - '%programdata%'
            - '%appdata%'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
