title: Suspicious Files In Data Root Folders - ProcCreation
id: c8af1f4a-a0c9-4a3b-873d-3e5fcbd07abb
status: experimental
description: Detects launch of suspicious files located inside of the appdata subfolders first level. UUsually appdata and programdata stores binaries or other files inside of folders and not on at the root of the subfolder. A file placed at the root of these folders could be indicative of suspicious activity
references:
    - Internal Research
author: Nasreddine Bencherchali
date: 2022/08/11
modified: 2022/11/28
tags:
    - attack.execution
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        # Add more suspicious extensions at the end of the regex
        - Image|re: '([Pp]rogram[Dd]ata|\\[Aa]pp[Dd]ata\\([Ll]ocal|[Rr]oaming|[Ll]ocal[Ll]ow))\\[^\\]{1,26}\.(EXE|exe|msi|MSI)$'
        - CommandLine|re: '([Pp]rogram[Dd]ata|%[Aa]pp[Dd]ata%|%[Ll]ocal[Aa]pp[Dd]ata%|\\[Aa]pp[Dd]ata\\([Ll]ocal|[Rr]oaming|[Ll]ocal[Ll]ow))\\[^\\]{1,26}\.(EXE|exe|bat|BAT|msi|MSI|ps1|PS1|vbs|VBS|vbe|VBE|dll|DLL|hta|HTA)($|\s)'
    condition: selection
falsepositives:
    - Unlikely
level: high
