
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential File Download Via MS-AppInstaller Protocol Handler
id: 180c7c5c-d64b-4a63-86e9-68910451bc8b
related:
  - type: derived
    id: 7cff77e1-9663-46a3-8260-17f2e1aa9d0a
status: experimental
description: |
    Detects usage of the "ms-appinstaller" protocol handler via command line to potentially download arbitrary files via AppInstaller.EXE
    The downloaded files are temporarly stored in ":\Users\%username%\AppData\Local\Packages\Microsoft.DesktopAppInstaller_8wekyb3d8bbwe\AC\INetCache\<RANDOM-8-CHAR-DIRECTORY>"
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/11/09 21:36:41
references:
  - https://lolbas-project.github.io/lolbas/Binaries/AppInstaller/
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - ms-appinstaller://?source=
          - http
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.execution
  - attack.t1218
  - DEMO
