
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: File Download via CertOC.EXE
id: 70ad0861-d1fe-491c-a45f-fa48148a300d
related:
  - type: similar
    id: b86f6dea-0b2f-41f5-bdcc-a057bd19cd6a
status: test
description: Detects when a user downloads a file by using CertOC.exe
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/05/16 12:46:41
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Certoc/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection*
    selection_cli:
        CommandLine|contains|all:
          - -GetCACAPS
          - http
    selection_img:
      - Image|endswith: \certoc.exe
      - OriginalFileName: CertOC.exe
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/10/18
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
