title: Suspicious Windows Defender Exclusions Added
id: 8aa52eab-3271-46c2-921a-7d2612278b0b
related:
    - id: 17769c90-230e-488b-a463-e05c08e9d48f
      type: similar
    - id: c1344fa2-323b-4d2e-9176-84b4d4821c88
      type: similar
status: experimental
description: Detects execution of the PowerShell "Add-MpPreference" or "Set-MpPreference" cmdlets to add dangerous exclusions to Windows Defender
references:
    - https://www.cisa.gov/uscert/sites/default/files/publications/aa22-320a_joint_csa_iranian_government-sponsored_apt_actors_compromise_federal%20network_deploy_crypto%20miner_credential_harvester.pdf
author: Nasreddine Bencherchali
date: 2022/11/17
modified: 2022/12/06
tags:
    - attack.defense_evasion
    - attack.t1562
    - attack.execution
    - attack.t1059
logsource:
    product: windows
    category: process_creation
detection:
    selection_args_pref:
        CommandLine|contains:
            - 'Add-MpPreference '
            - 'Set-MpPreference '
    selection_excludext_cmdlet:
        CommandLine|contains: ' -ExclusionExtension '
    selection_excludext_extensions:
        # Example: Add-MpPreference -ExclusionExtension '.dll'
        CommandLine|contains:
            # Single quote variations
            - '".bat"'
            - '".dll"'
            - '".exe"'
            - '".hta"'
            - '".ps1"'
            - '".psm1"'
            - '".sct"'
            - '".vbe"'
            - '".vbs"'
            # Double quote variations
            - "'.bat'"
            - "'.dll'"
            - "'.exe'"
            - "'.hta'"
            - "'.ps1'"
            - "'.psm1'"
            - "'.sct'"
            - "'.vbe'"
            - "'.vbs'"
            # Without quotes
            - 'sion .bat'
            - 'sion .dll'
            - 'sion .exe'
            - 'sion .hta'
            - 'sion .ps1'
            - 'sion .psm1'
            - 'sion .sct'
            - 'sion .vbe'
            - 'sion .vbs'
    selection_excludepath_cmdlet:
        CommandLine|contains:
            - ' -ExclusionPath '
            - ' -AttackSurfaceReductionOnlyExclusions '
    selection_excludepath_paths:
        # Example: Add-MpPreference -ExclusionProcess 'powershell.exe' -ExclusionPath 'C:\' " -verb runas
        CommandLine|contains:
            # Single quote variations
            - '"C:\"'
            - '"C:\Users"'
            - '"C:\Perflogs"'
            - '"C:\Users\"'
            - '"C:\Perflogs\"'
            - '"C:\Windows\Temp"'
            - '"C:\Temp"'
            # Double quote variations
            - "'C:\\'"
            - "'C:\\Users'"
            - "'C:\\Perflogs'"
            - "'C:\\Users\\'"
            - "'C:\\Perflogs\\'"
            - "'C:\\Windows\\Temp'"
            - "'C:\\Temp'"
            # Other
            - '%Public%'
            - '%Temp%'
            - '%Tmp%'
            - '$env:TEMP'
            - '$env:public'
            - '$env:USERPROFILE'
            - '%USERPROFILE%'
            # Without Quotes (We add the last few characters from the arguments to avoid FP and provide context)
            - 'path C:\Windows\Temp'
            - 'path C:\Temp'
            - 'path C:\Perflogs'
            - 'ions C:\Windows\Temp'
            - 'ions C:\Temp'
            - 'ions C:\Perflogs'
    selection_excludeprocess_cmdlet:
        CommandLine|contains: ' -ExclusionProcess '
    selection_excludeprocess_processes:
        # Example: Add-MpPreference -ExclusionProcess 'powershell.exe' -ExclusionPath 'C:\' " -verb runas
        CommandLine|contains:
            # Single quote variations
            - '"cmd.exe"'
            - '"cscript.exe"'
            - '"mshta.exe"'
            - '"pwsh.exe"'
            - '"powershell.exe"'
            - '"regsvr32.exe"'
            - '"rundll32.exe"'
            - '"wscript.exe"'
            # Double quote variations
            - "'cmd.exe'"
            - "'cscript.exe'"
            - "'mshta.exe'"
            - "'pwsh.exe'"
            - "'powershell.exe'"
            - "'regsvr32.exe'"
            - "'rundll32.exe'"
            - "'wscript.exe'"
            # Without Quotes
            - 'cess cmd.exe'
            - 'cess cscript.exe'
            - 'cess mshta.exe'
            - 'cess pwsh.exe'
            - 'cess powershell.exe'
            - 'cess regsvr32.exe'
            - 'cess rundll32.exe'
            - 'cess wscript.exe'
    selection_exclude_app_controlled_access_cmdlet:
        # These cmdlet could cause FP with some third party apps since they like to get access. If you experience FP add another selection for interesting paths to avoid this
        CommandLine|contains: '-ControlledFolderAccessAllowedApplications '
    condition: selection_args_pref and (all of selection_excludext_* or all of selection_excludepath_* or all of selection_excludeprocess_* or selection_exclude_app_controlled_access_cmdlet)
falsepositives:
    - Rare administrator activity for testing purposes (should be investigated)
level: high
