
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Lace Tempest Cobalt Strike Download
id: aa5b0a40-ed88-46aa-9fdc-0337b379ca9d
status: experimental
description: Detects specific command line execution used by Lace Tempest to download
    Cobalt Strike as reported by SysAid Team
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/11/09 15:07:41
references:
  - https://www.sysaid.com/blog/service-desk/on-premise-software-security-vulnerability-notification
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection
    selection:
        CommandLine|contains|all:
          - -nop -w hidden -c IEX ((new-object net.webclient).downloadstring(
          - /a')
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.execution
  - detection.emerging_threats
  - DEMO
