title: Suspicious Schtasks Eventlog Trigger
id: 325791e1-aa8f-41e6-90a8-df774a242979
status: experimental
description: Detects suspicious scheduled task creation where the trigger is set to be a specific event log. This techniques has been seen used in order to evade detection
author: Nasreddine Bencherchali
date: 2023/01/19
tags:
    - attack.execution
    - attack.t1053.005
    - attack.s0111
references:
    - https://www.proofpoint.com/us/blog/threat-insight/serpent-no-swiping-new-backdoor-targets-french-entities-unique-attack-chain
logsource:
    category: process_creation
    product: windows
detection:
    selection_schtasks:
        - Image|endswith: '\schtasks.exe'
        - OriginalFileName: 'schtasks.exe'
    selection_cli:
        CommandLine|contains: '/EventID='
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
