title: HoaxShell PowerShell Reverse Shell Usage
id: fa499352-767f-4db6-8098-987f5ef1fb6f
status: experimental
description: Detects the execution of PowerShell code similar to the one used in HoaxShell payloads
author: Florian Roth
references:
    - https://github.com/t3l3machus/hoaxshell
date: 2022/11/29
tags:
    - attack.command_and_control
    - attack.t1090
logsource:
    category: process_creation
    product: windows
detection:
    selection_powershell:
        CommandLine|contains: 'powershell -e JABzAD0AJw'
    selection1_iwr:
        # =Invoke-WebRequest -UseBasicParsing -Uri $
        CommandLine|contains:
            - 'PQBJAG4AdgBvAGsAZQAtAFcAZQBiAFIAZQBxAHUAZQBzAHQAIAAtAFUAcwBlAEIAYQBzAGkAYwBQAGEAcgBzAGkAbgBnACAALQBVAHIAaQAgACQA'
            - '0ASQBuAHYAbwBrAGUALQBXAGUAYgBSAGUAcQB1AGUAcwB0ACAALQBVAHMAZQBCAGEAcwBpAGMAUABhAHIAcwBpAG4AZwAgAC0AVQByAGkAIAAkA'
            - '9AEkAbgB2AG8AawBlAC0AVwBlAGIAUgBlAHEAdQBlAHMAdAAgAC0AVQBzAGUAQgBhAHMAaQBjAFAAYQByAHMAaQBuAGcAIAAtAFUAcgBpACAAJA'
    selection1_join:
        #  -join ' ')
        CommandLine|contains:
            - 'IAAtAGoAbwBpAG4AIAAnACAAJwApAH0A'
            - 'AALQBqAG8AaQBuACAAJwAgACcAKQB9A'
            - 'gAC0AagBvAGkAbgAgACcAIAAnACkAfQ'
    selection2_error:
        #  -ErrorAction Stop -ErrorVariable e;$
        CommandLine|contains:
            - 'IAAtAEUAcgByAG8AcgBBAGMAdABpAG8AbgAgAFMAdABvAHAAIAAtAEUAcgByAG8AcgBWAGEAcgBpAGEAYgBsAGUAIABlADsAJA'
            - 'AALQBFAHIAcgBvAHIAQQBjAHQAaQBvAG4AIABTAHQAbwBwACAALQBFAHIAcgBvAHIAVgBhAHIAaQBhAGIAbABlACAAZQA7ACQA'
            - 'gAC0ARQByAHIAbwByAEEAYwB0AGkAbwBuACAAUwB0AG8AcAAgAC0ARQByAHIAbwByAFYAYQByAGkAYQBiAGwAZQAgAGUAOwAkA'
    selection2_headers:
        #  -Headers @{
        CommandLine|contains:
            - 'IAAtAEgAZQBhAGQAZQByAHMAIABAAHsA'
            - 'AALQBIAGUAYQBkAGUAcgBzACAAQAB7A'
            - 'gAC0ASABlAGEAZABlAHIAcwAgAEAAew'
    condition: selection_powershell or all of selection1* or all of selection2*
falsepositives:
    - Unknown
level: high
