title: Suspicious WMI Process Tree
id: f3161bac-7357-4650-a062-2f3bee1850c4
status: experimental
description: Detects suspicious WMI process tree that contains calls to unusual processes such as tasklist, whoami...etc. Which could be an indication of lateral movement
author: Nasreddine Bencherchali
references:
    - Internal Research
date: 2022/09/08
tags:
    - attack.execution
    - attack.lateral_movement
logsource:
    category: process_creation
    product: windows
detection:
    selection_wmi:
        ProcessTree|contains: '\WmiPrvSE.exe|'
    selection_shell:
        ProcessTree|contains:
            - '\Powershell.exe|'
            - '\cmd.exe|'
            - '\pwsh.exe|'
            - '\wsl.exe|'
    selection_susp:
        ProcessTree|contains:
            # Add more suspicious processes
            - '\whoami.exe'
            - '\tasklist.exe'
            - '\taskkill.exe'
            - '\netstat.exe'
            - '\ipconfig.exe'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
