title: Hacktool Dumpy LSASS Dumper
id: bfda582a-7210-48cc-a505-a687701498d0
description: Detects hacktool Dumpy, a tool that dynamically calls MiniDumpWriteDump to dump lsass memory content
status: experimental
references:
    - https://github.com/Kudaes/Dumpy
author: Florian Roth
date: 2022/09/13
modified: 2022/09/29
tags:
    - attack.credential_access
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\Dumpy.exe'
        - OriginalFileName: 'Dumpy.exe'
        - CommandLine|contains: '.exe dump -k '
    condition: selection
falsepositives:
    - Unknown
level: high
