
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential APT Mustang Panda Activity Against Australian Gov
id: 7806bb49-f653-48d3-a915-5115c1a85234
status: experimental
description: Detects specific command line execution used by Mustang Panda in a targeted
    attack against the Australian government as reported by Lab52
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/15 21:19:21
references:
  - https://lab52.io/blog/new-mustang-pandas-campaing-against-australia/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_1:
        CommandLine|contains|all:
          - copy SolidPDFCreator.dll
          - C:\Users\Public\Libraries\PhotoTvRHD\SolidPDFCreator.dll
    selection_2:
        CommandLine|contains|all:
          - 'reg '
          - \Windows\CurrentVersion\Run
          - SolidPDF
          - C:\Users\Public\Libraries\PhotoTvRHD\
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.execution
  - attack.g0129
  - detection.emerging_threats
  - DEMO
