title: Suspicious Sc Query Execution
id: 168c46d7-5038-4a6a-86c6-08bfb1012854
status: experimental
description: Detects suspicious execution of "sc.exe" to query information about all registered services on a system or specific important services
references:
    - https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
author: Nasreddine Bencherchali
date: 2022/11/10
modified: 2023/02/07
tags:
    - attack.discovery
    - attack.t1007
logsource:
    category: process_creation
    product: windows
detection:
    selection_root_img:
        Image|endswith: '\sc.exe'
        OriginalFileName|endswith: 'sc.exe'
    selection_root_query:
        CommandLine|contains: ' query' # Also covers queryex
    selection_type_keyword:
        CommandLine|contains: ' type='
    selection_type_values:
        CommandLine|contains:
            - 'service'
            - 'kernel'
    selection_service_keywords:
        CommandLine|contains:
            # Add more interesting services
            - 'aurora-agent'
            - 'sysmon'
            - 'eventlog'
            - 'windefend'
    condition: all of selection_root_* and (all of selection_type_* or selection_service_keywords)
falsepositives:
    - Legitimate query of a service by an administrator to get more information such as the state or PID
level: medium
