title: Potential Recon Activity Using Echo Separator
id: e89f7096-d86e-48b3-80c4-8a4f72e1e3f2
related:
    - id: 8e0bb260-d4b2-4fff-bb8d-3f82118e6892
      type: derived
status: experimental
description: Detects the use of "echo" as a seperator between different outputs. Often used by attackers during their recon activity to seperate the results of the different recon commanads
references:
    - https://thedfirreport.com/2023/01/09/unwrapping-ursnifs-gifts/
author: Nasreddine Bencherchali
date: 2023/01/19
tags:
    - attack.discovery
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\cmd.exe'
        - OriginalFileName: 'Cmd.Exe'
    selection_cli:
        CommandLine|contains|all:
            # Example:
            #   CommandLine: cmd /C "echo -------- >> %temp%"
            - ' /c'
            - ' >>'
        CommandLine|contains:
            - "'echo ----"
            - '"echo ----'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
