title: Hoaxshell Encoded Payload - ProcCreation
id: ebec86bd-9c62-40d6-8a0c-339ff1d89f5a
related:
    - id: b10153ca-605a-4a8f-85bd-4dbca64601d8
      type: similar
status: experimental
description: Detects the encoded payload of hoaxshell, an unconventional Windows reverse shell
author: Nasreddine Bencherchali
references:
    - https://github.com/t3l3machus/hoaxshell/
date: 2022/10/20
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        - OriginalFileName:
            - 'PowerShell.EXE'
            - 'pwsh.dll'
    selection_1:
        CommandLine|contains:
            # ($e+$r)
            - "KAAkAGUAKwAkAHIAKQ"
            - "gAJABlACsAJAByACkA"
            - "oACQAZQArACQAcgApA"
    selection_2:
        CommandLine|contains:
            # -ErrorAction Stop -ErrorVariable e
            - "LQBFAHIAcgBvAHIAQQBjAHQAaQBvAG4AIABTAHQAbwBwACAALQBFAHIAcgBvAHIAVgBhAHIAaQBhAGIAbABlACAAZQ"
            - "0ARQByAHIAbwByAEEAYwB0AGkAbwBuACAAUwB0AG8AcAAgAC0ARQByAHIAbwByAFYAYQByAGkAYQBiAGwAZQAgAGUA"
            - "tAEUAcgByAG8AcgBBAGMAdABpAG8AbgAgAFMAdABvAHAAIAAtAEUAcgByAG8AcgBWAGEAcgBpAGEAYgBsAGUAIABlA"
    condition: all of selection_*
falsepositives:
    - Unlikely
level: high
