title: SharpDPAPI Usage
id: 84b00bac-37dd-4118-8b16-40e8e982b29a
status: experimental
description: Detects usage of the SharpDPAPI tool based on commandline flags
author: Nasreddine Bencherchali
references:
    - https://github.com/GhostPack/SharpDPAPI#sharpdpapi-command-line-usage
date: 2022/05/18
tags:
    - attack.credential_access
    - attack.t1555
logsource:
    category: process_creation
    product: windows
detection:
    img_orig:
        - OriginalFileName: 'SharpDPAPI.exe'
        - Image|endswith: '\SharpDPAPI.exe'
    selection_search_cmd:
        CommandLine|contains: ' search '
    selection_search_options:
        CommandLine|contains:
            - ' /type:registry'
            - ' /type:folder'
            - ' /type:file'
            - ' /type:base64'
    selection_standalone:
        CommandLine|endswith:
            - ' machinecredentials'
            - ' machinemasterkeys'
            - ' machinetriage'
            - ' machinevaults'
    selection_other_cli:
        CommandLine|contains:
            - ' backupkey '
            - ' blob '
            - ' certificates '
            - ' credentials '
            - ' keepass '
            - ' masterkeys '
            - ' rdg '
            - ' vaults '
    selection_other_options_guid:
        CommandLine|contains|all:
            - ' {'
            - '}:'
    selection_other_options_flags:
        CommandLine|contains:
            - ' /server:'
            - ' /file:'
            - ' /unprotect'
            - ' /target:'
            - ' /pvk:'
            - ' /mkfile:'
            - ' /password:'
            - ' /machine'
    condition: img_orig or all of selection_search* or selection_standalone or (selection_other_cli and 1 of selection_other_options*)
falsepositives:
    - Unlikely
level: high
