title: Shells Spawned by Web Servers in Process Tree
id: 6dc0f4e1-7a11-429f-b240-d9f852cea8b3
status: test
description: Web servers that spawn shell processes could be the result of a successfully placed web shell or an other attack
author: Thomas Patzke, Florian Roth
date: 2022/03/22
modified: 2022/11/04
tags:
    - attack.persistence
    - attack.t1505.003
    - attack.t1190
logsource:
    category: process_creation
    product: windows
detection:
    selection_webserver_image:
        ProcessTree|contains:
            - '\w3wp.exe|'
            - '\php-cgi.exe|'
            - '\nginx.exe|'
            - '\httpd.exe|'
            - '\caddy.exe|'
            - '\ws_TomcatService.exe|'
            - '\tomcat.exe|'
            - '\UMWorkerProcess.exe|'  # https://www.fireeye.com/blog/threat-research/2021/03/detection-response-to-exploitation-of-microsoft-exchange-zero-day-vulnerabilities.html
    anomaly_children:
        - Image|endswith:
            - '\cmd.exe'
            - '\sh.exe'
            - '\bash.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\bitsadmin.exe'
            - '\wsl.exe'
        - OriginalFileName:
            - '\Cmd.Exe'
            - '\sh.exe'
            - '\bash.exe'
            - '\PowerShell.EXE'
            - '\pwsh.dll'
            - '\bitsadmin.exe'
            - '\wsl.exe'
    condition: 1 of selection* and anomaly_children
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Particular web applications may spawn a shell process legitimately
level: high
