
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: APT27 - Emissary Panda Activity
id: 9aa01d62-7667-4d3b-acb8-8cb5103e2014
status: test
description: Detects the execution of DLL side-loading malware used by threat group
    Emissary Panda aka APT27
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/09/03 13:26:51
references:
  - https://app.any.run/tasks/579e7587-f09d-4aae-8b07-472833262965
  - https://twitter.com/cyb3rops/status/1168863899531132929
  - https://research.nccgroup.com/2018/05/18/emissary-panda-a-potential-new-malicious-tool/
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_sllauncher:
        Image|endswith: \svchost.exe
        ParentImage|endswith: \sllauncher.exe
    selection_svchost:
        CommandLine|contains: -k
        Image|endswith: \svchost.exe
        ParentImage|contains: \AppData\Roaming\
falsepositives: Unlikely
level: critical
customer: 'demo'
modified: 2023/03/09
tags:
  - attack.defense_evasion
  - attack.t1574.002
  - attack.g0027
  - detection.emerging_threats
  - DEMO
