title: Direct Script Or Cmdlet Calls After IEX
id: 97d8b6aa-2394-4fa6-b15c-a3843136616c
status: experimental
description: Detects calls to cmdlets starting with "Invoke" after IEX
references:
    - https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
author: Nasreddine Bencherchali
date: 2022/06/03
modified: 2022/08/09
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_iex:
        CommandLine|contains: 'IEX ('
    selection_call:
        CommandLine|contains:
            - ';Invoke-'
            - '; Invoke-'
            - ';.\'
            - '; .\'
    condition: all of selection*
falsepositives:
    - Unknown
level: high
