
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Wusa.EXE Executed By Parent Process Located In Suspicious Location
id: ef64fc9c-a45e-43cc-8fd8-7d75d73b4c99
status: experimental
description: |
    Detects execution of the "wusa.exe" (Windows Update Standalone Installer) utility by a parent process that is located in a suspicious location.
author: X__Junior (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/11/26 22:55:41
references:
  - https://www.fortinet.com/blog/threat-research/konni-campaign-distributed-via-malicious-document
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_img and 1 of selection_paths_*
    selection_img:
        Image|endswith: \wusa.exe
    selection_paths_1:
        ParentImage|contains:
          - :\Perflogs\
          - :\Users\Public\
          - :\Windows\Temp\
          - \Appdata\Local\Temp\
          - \Temporary Internet
    selection_paths_2:
      - ParentImage|contains|all:
          - :\Users\
          - \Favorites\
      - ParentImage|contains|all:
          - :\Users\
          - \Favourites\
      - ParentImage|contains|all:
          - :\Users\
          - \Contacts\
      - ParentImage|contains|all:
          - :\Users\
          - \Pictures\
falsepositives: Unknown
level: high
customer: 'demo'
tags:
  - attack.execution
  - DEMO
