title: Suspicious Usage Of Nirsoft Password Recovery Tools
id: 548d9f7c-c231-4ad2-95d0-9aecaa1f2a77
description: Detects suspicious usage of nirsoft password recovery tools via export flags
status: experimental
author: Nasreddine Bencherchali
date: 2022/05/07
modified: 2022/05/13
references:
    - https://www.nirsoft.net/password_recovery_tools.html
    - https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/NirSoft%20Utilities/BrowsingHistoryView
    - https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/NirSoft%20Utilities/Password%20Recovery%20Tools
tags:
    - attack.credential_access
    - attack.t1555
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: # This list contains only the files available within the password-recovery zip
            - '\ChromePass.exe'
            - '\Dialupass.exe'
            - '\iepv.exe'
            - '\mailpv.exe'
            - '\mspass.exe'
            - '\netpass.exe'
            - '\PasswordFox.exe'
            - '\PstPassword.exe'
            - '\WebBrowserPassView.exe'
        - OriginalFileName:
            - 'PstPassword'
            - 'mspass.exe'
            - 'iepv.exe'
            - 'Dialupass'
            - 'ChromePass'
    selection_cli:
        CommandLine|contains:
            - ' /stext '
            - ' /scomma '
            - ' /shtml '
            - ' /skeepass '
            - ' /spassexp '
    condition: all of selection_*
falsepositives:
    - Legitimate usage to recover passwords
level: high
