title: Suspicious Encoded Powershell Commandline Payload Usage
id: d0a6a02d-0255-4095-a0ca-8fe8b8b6ef3d
status: experimental
description: Detects suspicious encoded powershell commandline payload usage
author: Paul Hager
date: 2022/02/22
modified: 2022/11/09
references:
    - https://docs.broadcom.com/doc/living-off-the-land-turning-your-infrastructure-against-you-en
    - https://unit42.paloaltonetworks.com/unit42-pulling-back-the-curtains-on-encodedcommand-powershell-attacks/
logsource:
    category: process_creation
    product: windows
tags:
    - attack.execution
    - attack.t1059.001
detection:
    selection_image:
        - Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        - OriginalFileName:
            - 'PowerShell.EXE'
            - 'pwsh.dll'
        - CommandLine:
            - ' hidden '
            - ' bypass '
    selection_body:
        - CommandLine|base64offset|contains:
            - 'iex ('
            - 'Iex ('
            - 'iEx ('
            - 'IEx ('
            - 'ieX ('
            - 'IeX ('
            - 'iEX ('
            - 'IEX ('
            - 'iex (New'
            - 'Iex (New'
            - 'iEx (New'
            - 'IEx (New'
            - 'ieX (New'
            - 'IeX (New'
            - 'iEX (New'
            - 'IEX (New'
            - 'iex(New'
            - 'Iex(New'
            - 'iEx(New'
            - 'IEx(New'
            - 'ieX(New'
            - 'IeX(New'
            - 'iEX(New'
            - 'IEX(New'
            - 'iex $'
            - 'Iex $'
            - 'iEx $'
            - 'IEx $'
            - 'ieX $'
            - 'IeX $'
            - 'iEX $'
            - 'iex($'
            - 'Iex($'
            - 'iEx($'
            - 'IEx($'
            - 'ieX($'
            - 'IeX($'
            - 'iEX($'
            - 'IEX($'
            - ';iex('
            - ';Iex('
            - ';iEx('
            - ';IEx('
            - ';ieX('
            - ';IeX('
            - ';iEX('
            - ';IEX('
            - '.DownloadString('
            - '.DownloadFile('
            - '.DownloadData('
            - '.downloadString('
            - '.downloadFile('
            - '.downloadData('
            - '.downloadstring('
            - '.downloadfile('
            - '.downloaddata('
            - '.Downloadstring('
            - '.Downloadfile('
            - '.Downloaddata('
            #TODO: Not supported by THOR 10.5 (i.e. go-sigmav1), reenble comment block after THOR 10.5 is end of life
            #- CommandLine|utf16le|base64offset|contains:
            #  - 'iex ('
            #  - 'Iex ('
            #  - 'iEx ('
            #  - 'IEx ('
            #  - 'ieX ('
            #  - 'IeX ('
            #  - 'iEX ('
            #  - 'IEX ('
            #  - 'iex (New'
            #  - 'Iex (New'
            #  - 'iEx (New'
            #  - 'IEx (New'
            #  - 'ieX (New'
            #  - 'IeX (New'
            #  - 'iEX (New'
            #  - 'IEX (New'
            #  - 'iex(New'
            #  - 'Iex(New'
            #  - 'iEx(New'
            #  - 'IEx(New'
            #  - 'ieX(New'
            #  - 'IeX(New'
            #  - 'iEX(New'
            #  - 'IEX(New'
            #  - 'iex $'
            #  - 'Iex $'
            #  - 'iEx $'
            #  - 'IEx $'
            #  - 'ieX $'
            #  - 'IeX $'
            #  - 'iEX $'
            #  - 'iex($'
            #  - 'Iex($'
            #  - 'iEx($'
            #  - 'IEx($'
            #  - 'ieX($'
            #  - 'IeX($'
            #  - 'iEX($'
            #  - 'IEX($'
            #  - ';iex('
            #  - ';Iex('
            #  - ';iEx('
            #  - ';IEx('
            #  - ';ieX('
            #  - ';IeX('
            #  - ';iEX('
            #  - ';IEX('
            #  - '.DownloadString('
            #  - '.DownloadFile('
            #  - '.DownloadData('
            #  - '.downloadString('
            #  - '.downloadFile('
            #  - '.downloadData('
            #  - '.downloadstring('
            #  - '.downloadfile('
            #  - '.downloaddata('
            #  - '.Downloadstring('
            #  - '.Downloadfile('
            #  - '.Downloaddata('
        #TODO: Remove the following subselection after uft16le value modifier is added
        - CommandLine|contains:
            - 'aQBlAHgAIAAoA'
            - 'kAZQB4ACAAKA'
            - 'pAGUAeAAgACgA'
            - 'SQBlAHgAIAAoA'
            - 'JAGUAeAAgACgA'
            - 'aQBFAHgAIAAoA'
            - 'kARQB4ACAAKA'
            - 'pAEUAeAAgACgA'
            - 'SQBFAHgAIAAoA'
            - 'JAEUAeAAgACgA'
            - 'aQBlAFgAIAAoA'
            - 'kAZQBYACAAKA'
            - 'pAGUAWAAgACgA'
            - 'SQBlAFgAIAAoA'
            - 'JAGUAWAAgACgA'
            - 'aQBFAFgAIAAoA'
            - 'kARQBYACAAKA'
            - 'pAEUAWAAgACgA'
            - 'SQBFAFgAIAAoA'
            - 'JAEUAWAAgACgA'
            - 'aQBlAHgAIAAoAE4AZQB3A'
            - 'kAZQB4ACAAKABOAGUAdw'
            - 'pAGUAeAAgACgATgBlAHcA'
            - 'SQBlAHgAIAAoAE4AZQB3A'
            - 'JAGUAeAAgACgATgBlAHcA'
            - 'aQBFAHgAIAAoAE4AZQB3A'
            - 'kARQB4ACAAKABOAGUAdw'
            - 'pAEUAeAAgACgATgBlAHcA'
            - 'SQBFAHgAIAAoAE4AZQB3A'
            - 'JAEUAeAAgACgATgBlAHcA'
            - 'aQBlAFgAIAAoAE4AZQB3A'
            - 'kAZQBYACAAKABOAGUAdw'
            - 'pAGUAWAAgACgATgBlAHcA'
            - 'SQBlAFgAIAAoAE4AZQB3A'
            - 'JAGUAWAAgACgATgBlAHcA'
            - 'aQBFAFgAIAAoAE4AZQB3A'
            - 'kARQBYACAAKABOAGUAdw'
            - 'pAEUAWAAgACgATgBlAHcA'
            - 'SQBFAFgAIAAoAE4AZQB3A'
            - 'JAEUAWAAgACgATgBlAHcA'
            - 'aQBlAHgAKABOAGUAdw'
            - 'kAZQB4ACgATgBlAHcA'
            - 'pAGUAeAAoAE4AZQB3A'
            - 'SQBlAHgAKABOAGUAdw'
            - 'JAGUAeAAoAE4AZQB3A'
            - 'aQBFAHgAKABOAGUAdw'
            - 'kARQB4ACgATgBlAHcA'
            - 'pAEUAeAAoAE4AZQB3A'
            - 'SQBFAHgAKABOAGUAdw'
            - 'JAEUAeAAoAE4AZQB3A'
            - 'aQBlAFgAKABOAGUAdw'
            - 'kAZQBYACgATgBlAHcA'
            - 'pAGUAWAAoAE4AZQB3A'
            - 'SQBlAFgAKABOAGUAdw'
            - 'JAGUAWAAoAE4AZQB3A'
            - 'aQBFAFgAKABOAGUAdw'
            - 'kARQBYACgATgBlAHcA'
            - 'pAEUAWAAoAE4AZQB3A'
            - 'SQBFAFgAKABOAGUAdw'
            - 'JAEUAWAAoAE4AZQB3A'
            - 'aQBlAHgAIAAkA'
            - 'kAZQB4ACAAJA'
            - 'pAGUAeAAgACQA'
            - 'SQBlAHgAIAAkA'
            - 'JAGUAeAAgACQA'
            - 'aQBFAHgAIAAkA'
            - 'kARQB4ACAAJA'
            - 'pAEUAeAAgACQA'
            - 'SQBFAHgAIAAkA'
            - 'JAEUAeAAgACQA'
            - 'aQBlAFgAIAAkA'
            - 'kAZQBYACAAJA'
            - 'pAGUAWAAgACQA'
            - 'SQBlAFgAIAAkA'
            - 'JAGUAWAAgACQA'
            - 'aQBFAFgAIAAkA'
            - 'kARQBYACAAJA'
            - 'pAEUAWAAgACQA'
            - 'aQBlAHgAKAAkA'
            - 'kAZQB4ACgAJA'
            - 'pAGUAeAAoACQA'
            - 'SQBlAHgAKAAkA'
            - 'JAGUAeAAoACQA'
            - 'aQBFAHgAKAAkA'
            - 'kARQB4ACgAJA'
            - 'pAEUAeAAoACQA'
            - 'SQBFAHgAKAAkA'
            - 'JAEUAeAAoACQA'
            - 'aQBlAFgAKAAkA'
            - 'kAZQBYACgAJA'
            - 'pAGUAWAAoACQA'
            - 'SQBlAFgAKAAkA'
            - 'JAGUAWAAoACQA'
            - 'aQBFAFgAKAAkA'
            - 'kARQBYACgAJA'
            - 'pAEUAWAAoACQA'
            - 'SQBFAFgAKAAkA'
            - 'JAEUAWAAoACQA'
            - 'OwBpAGUAeAAoA'
            - 'sAaQBlAHgAKA'
            - '7AGkAZQB4ACgA'
            - 'OwBJAGUAeAAoA'
            - 'sASQBlAHgAKA'
            - '7AEkAZQB4ACgA'
            - 'OwBpAEUAeAAoA'
            - 'sAaQBFAHgAKA'
            - '7AGkARQB4ACgA'
            - 'OwBJAEUAeAAoA'
            - 'sASQBFAHgAKA'
            - '7AEkARQB4ACgA'
            - 'OwBpAGUAWAAoA'
            - 'sAaQBlAFgAKA'
            - '7AGkAZQBYACgA'
            - 'OwBJAGUAWAAoA'
            - 'sASQBlAFgAKA'
            - '7AEkAZQBYACgA'
            - 'OwBpAEUAWAAoA'
            - 'sAaQBFAFgAKA'
            - '7AGkARQBYACgA'
            - 'OwBJAEUAWAAoA'
            - 'sASQBFAFgAKA'
            - '7AEkARQBYACgA'
            - 'LgBEAG8AdwBuAGwAbwBhAGQAUwB0AHIAaQBuAGcAKA'
            - '4ARABvAHcAbgBsAG8AYQBkAFMAdAByAGkAbgBnACgA'
            - 'uAEQAbwB3AG4AbABvAGEAZABTAHQAcgBpAG4AZwAoA'
            - 'LgBEAG8AdwBuAGwAbwBhAGQARgBpAGwAZQAoA'
            - '4ARABvAHcAbgBsAG8AYQBkAEYAaQBsAGUAKA'
            - 'uAEQAbwB3AG4AbABvAGEAZABGAGkAbABlACgA'
            - 'LgBEAG8AdwBuAGwAbwBhAGQARABhAHQAYQAoA'
            - '4ARABvAHcAbgBsAG8AYQBkAEQAYQB0AGEAKA'
            - 'uAEQAbwB3AG4AbABvAGEAZABEAGEAdABhACgA'
            - 'LgBkAG8AdwBuAGwAbwBhAGQAUwB0AHIAaQBuAGcAKA'
            - '4AZABvAHcAbgBsAG8AYQBkAFMAdAByAGkAbgBnACgA'
            - 'uAGQAbwB3AG4AbABvAGEAZABTAHQAcgBpAG4AZwAoA'
            - 'LgBkAG8AdwBuAGwAbwBhAGQARgBpAGwAZQAoA'
            - '4AZABvAHcAbgBsAG8AYQBkAEYAaQBsAGUAKA'
            - 'uAGQAbwB3AG4AbABvAGEAZABGAGkAbABlACgA'
            - 'LgBkAG8AdwBuAGwAbwBhAGQARABhAHQAYQAoA'
            - '4AZABvAHcAbgBsAG8AYQBkAEQAYQB0AGEAKA'
            - 'uAGQAbwB3AG4AbABvAGEAZABEAGEAdABhACgA'
            - 'LgBkAG8AdwBuAGwAbwBhAGQAcwB0AHIAaQBuAGcAKA'
            - '4AZABvAHcAbgBsAG8AYQBkAHMAdAByAGkAbgBnACgA'
            - 'uAGQAbwB3AG4AbABvAGEAZABzAHQAcgBpAG4AZwAoA'
            - 'LgBkAG8AdwBuAGwAbwBhAGQAZgBpAGwAZQAoA'
            - '4AZABvAHcAbgBsAG8AYQBkAGYAaQBsAGUAKA'
            - 'uAGQAbwB3AG4AbABvAGEAZABmAGkAbABlACgA'
            - 'LgBkAG8AdwBuAGwAbwBhAGQAZABhAHQAYQAoA'
            - '4AZABvAHcAbgBsAG8AYQBkAGQAYQB0AGEAKA'
            - 'uAGQAbwB3AG4AbABvAGEAZABkAGEAdABhACgA'
            - 'LgBEAG8AdwBuAGwAbwBhAGQAcwB0AHIAaQBuAGcAKA'
            - '4ARABvAHcAbgBsAG8AYQBkAHMAdAByAGkAbgBnACgA'
            - 'uAEQAbwB3AG4AbABvAGEAZABzAHQAcgBpAG4AZwAoA'
            - 'LgBEAG8AdwBuAGwAbwBhAGQAZgBpAGwAZQAoA'
            - '4ARABvAHcAbgBsAG8AYQBkAGYAaQBsAGUAKA'
            - 'uAEQAbwB3AG4AbABvAGEAZABmAGkAbABlACgA'
            - 'LgBEAG8AdwBuAGwAbwBhAGQAZABhAHQAYQAoA'
            - '4ARABvAHcAbgBsAG8AYQBkAGQAYQB0AGEAKA'
            - 'uAEQAbwB3AG4AbABvAGEAZABkAGEAdABhACgA'
    condition: all of selection_*
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored environment
level: high
