title: PuTTY Secure Copy Suspicious Usage
id: 6b69e637-a67b-4062-bb9d-c354db0a4664
status: experimental
description: Detects suspicious usage of PuTTY Secure Copy (PSCP) to exilftrate file
references:
    - https://the.earth.li/~sgtatham/putty/0.60/htmldoc/Chapter5.html
    - https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
author: Nasreddine Bencherchali
date: 2022/11/10
tags:
    - attack.exfiltration
    - attack.t1048.003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\pscp.exe'
        - OriginalFileName: 'PSCP'
    selection_cli:
        # Example: https://www.microsoft.com/en-us/security/blog/wp-content/uploads/2022/10/FO2-11-lsas.png
        CommandLine|contains|all:
            - ' -q '
            - ' -batch'
            - '\\\\'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
