title: Microsoft Exchange ProxyNotShell Exploit
id: df23d4fb-b12b-4425-a340-8d59e2460c43
status: experimental
description: Detects Microsoft Exchange exploit for CVE-2022-41040 and CVE-2022-41082 (A.K.A ProxyNotShell)
references:
    - https://github.com/testanull/ProxyNotShell-PoC
    - https://twitter.com/testanull/status/1593069258543894528
    - https://www.paloaltonetworks.com/blog/security-operations/busted-by-xdr-detecting-microsoft-exchange-post-exploit-activity-in-february/
author: pH-T
date: 2022/11/17
tags:
    - attack.execution
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        #<Data Name="ParentCommandLine">c:\windows\system32\inetsrv\w3wp.exe -ap "MSExchangePowerShellAppPool" -v "v4.0" -c "C:\Program Files\Microsoft\Exchange Server\V15\bin\GenericAppPoolConfigWithGCServerEnabledFalse.config" -a \\.\pipe\iisipm22d3b657-eac2-4bec-af77-13601862d15a -h "C:\inetpub\temp\apppools\MSExchangePowerShellAppPool\MSExchangePowerShellAppPool.config" -w "" -m 0</Data>
        ParentImage|endswith: '\w3wp.exe'
        ParentCommandLine|contains: 'MSExchangePowerShellAppPool'
        Image|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\wscript.exe'
            - '\cscript.exe'
            - '\sh.exe'
            - '\ssh.exe'
            - '\bash.exe'
            - '\scrcons.exe'
            - '\schtasks.exe'
            - '\regsvr32.exe'
            - '\hh.exe'
            - '\wmic.exe'
            - '\mshta.exe'
            - '\rundll32.exe'
            - '\msiexec.exe'
            - '\forfiles.exe'
            - '\scriptrunner.exe'
            - '\mftrace.exe'
            - '\AppVLP.exe'
            - '\svchost.exe'
            - '\msbuild.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
