
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Remote Access Tool - ScreenConnect Remote Command Execution
id: b1f73849-6329-4069-bc8f-78a604bb8b23
status: experimental
description: Detects the execution of a system command via the ScreenConnect RMM service.
author: Ali Alwashali
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/10/10 21:15:01
references:
  - https://github.com/SigmaHQ/sigma/pull/4467
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains: \TEMP\ScreenConnect\
    selection_img:
      - Image|endswith: \cmd.exe
      - OriginalFileName: Cmd.Exe
    selection_parent:
        ParentImage|endswith: \ScreenConnect.ClientService.exe
falsepositives: Legitimate use of ScreenConnect. Disable this rule if ScreenConnect
    is heavily used.
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.t1059.003
  - DEMO
