title: Black Basta Ransomware Patterns
id: e3c516a5-9ebe-4061-9962-382863cacaa4
status: experimental
description: Detects suspicious deletion patterns as observed in Black Basta intrusions
author: pH-T
references:
    - https://assets.sentinelone.com/sentinellabs22/SentinelLabs-BlackBasta#page=1
date: 2023/01/23
tags:
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains|all:
            - ' del '
            - 'pc.txt'
            - 'processes.txt'
            - 'processresult.txt'
    selection2:
        CommandLine|contains: 'del spider.dll'
    selection3:
        CommandLine|contains|all:
            - 'net user'
            - 'Crackenn'
            - '/delete'
    condition: 1 of selection*
falsepositives:
    - Unknown
level: high
