
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: AddinUtil.EXE Execution From Uncommon Directory
id: 6120ac2a-a34b-42c0-a9bd-1fb9f459f348
status: experimental
description: Detects execution of the Add-In deployment cache updating utility (AddInutil.exe)
    from a non-standard directory.
author: Michael McKinley (@McKinleyMike), Tony Latteri (@TheLatteri)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/09/18 18:19:51
references:
  - https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_legit_location:
        Image|contains:
          - :\Windows\Microsoft.NET\Framework\
          - :\Windows\Microsoft.NET\Framework64\
          - :\Windows\WinSxS\
    selection:
      - Image|endswith: \addinutil.exe
      - OriginalFileName: AddInUtil.exe
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218
  - DEMO
