title: New Process Created In Context Of AppX Package - ProcCreation
id: 87506372-81e5-4ecd-9038-1019d5517a1c
related:
    - id: 420d6631-aebd-4590-8c0e-2d63140bc1f9
      type: similar
status: experimental
description: Detects the usage of the "Invoke-CommandInDesktopPackage" cmdlet to spawn processes in the context of an AppX package. In order to gain access to it's virtualized file system and registry
references:
    - https://learn.microsoft.com/en-us/powershell/module/appx/invoke-commandindesktoppackage?view=windowsserver2022-ps
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/01
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        - OriginalFileName:
            - 'PowerShell.EXE'
            - 'pwsh.dll'
    selection_cli:
        # Example: Get-AppxPackage *calc* | % { Invoke-CommandInDesktopPackage -Command cmd.exe -PreventBreakaway -PackageFamilyName $_.PackageFamilyName -AppId $((Get-AppxPackageManifest $_.PackageFullName).Package.Applications.Application.id[0]) }
        CommandLine|contains|all:
            - 'Invoke-CommandInDesktopPackage '
            - ' -Command '
            - ' -PackageFamilyName '
            - ' -AppId '
    condition: all of selection_*
falsepositives:
    - Legitimate usage for debugging purposes
level: medium
