
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Binary Proxy Execution Via Dotnet-Trace.EXE
id: 9257c05b-4a4a-48e5-a670-b7b073cf401b
status: experimental
description: Detects commandline arguments for executing a child process via dotnet-trace.exe
author: Jimmy Bayne (@bohops)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/01/02 16:59:31
references:
  - https://twitter.com/bohops/status/1740022869198037480
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_cli:
        CommandLine|contains|all:
          - '-- '
          - collect
    selection_img:
      - Image|endswith: \dotnet-trace.exe
      - OriginalFileName: dotnet-trace.dll
falsepositives: Legitimate usage of the utility in order to debug and trace a program.
level: medium
customer: 'demo'
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218
  - DEMO
