
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Remote File Download Via Findstr.EXE
id: 587254ee-a24b-4335-b3cd-065c0f1f4baa
related:
  - type: obsoletes
    id: bf6c39fc-e203-45b9-9538-05397c1b4f3f
status: experimental
description: |
    Detects execution of "findstr" with specific flags and a remote share path. This specific set of CLI flags would allow "findstr" to download the content of the file located on the remote share as described in the LOLBAS entry.
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative, Nasreddine Bencherchali
    (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/05 15:01:01
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Findstr/
  - https://oddvar.moe/2018/04/11/putting-data-in-alternate-data-streams-and-how-to-execute-it-part-2/
  - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
logsource:
    category: process_creation
    product: windows
detection:
    condition: selection_findstr and all of selection_cli_download_*
    selection_cli_download_1:
        CommandLine|contains:
          - ' /v '
          - ' -v '
    selection_cli_download_2:
        CommandLine|contains:
          - ' /l '
          - ' -l '
    selection_cli_download_3:
        CommandLine|contains: \\\\
    selection_findstr:
      - CommandLine|contains: findstr
      - Image|endswith: findstr.exe
      - OriginalFileName: FINDSTR.EXE
falsepositives: Unknown
level: medium
customer: 'demo'
modified: 2023/11/12
tags:
  - attack.defense_evasion
  - attack.t1218
  - attack.t1564.004
  - attack.t1552.001
  - attack.t1105
  - DEMO
