
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Mustang Panda Dropper
id: 2d87d610-d760-45ee-a7e6-7a6f2a65de00
status: test
description: Detects specific process parameters as used by Mustang Panda droppers
author: Florian Roth (Nextron Systems), oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/30 11:35:51
references:
  - https://app.any.run/tasks/7ca5661d-a67b-43ec-98c1-dd7a8103c256/
  - https://app.any.run/tasks/b12cccf3-1c22-4e28-9d3e-c7a6062f3914/
  - https://www.anomali.com/blog/china-based-apt-mustang-panda-targets-minority-groups-public-and-private-sector-organizations
logsource:
    category: process_creation
    product: windows
detection:
    condition: 1 of selection_*
    selection_cli:
      - CommandLine|contains:
          - Temp\wtask.exe /create
          - '%windir:~-3,1%%PUBLIC:~-9,1%'
          - '/tn "Security Script '
          - '%windir:~-1,1%'
      - CommandLine|contains|all:
          - /E:vbscript
          - C:\Users\
          - .txt
          - /F
    selection_img:
        Image|endswith: Temp\winwsh.exe
falsepositives: Unlikely
level: high
customer: 'demo'
modified: 2021/11/27
tags:
  - attack.t1587.001
  - attack.resource_development
  - detection.emerging_threats
  - DEMO
