
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Operation Wocao Activity
id: 1cfac73c-be78-4f9a-9b08-5bde0c3953ab
related:
  - type: derived
    id: 74ad4314-482e-4c3e-b237-3f7ed3b9ca8d
status: test
description: Detects activity mentioned in Operation Wocao report
author: Florian Roth (Nextron Systems), frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/12/20 12:33:11
references:
  - https://www.fox-it.com/en/news/whitepapers/operation-wocao-shining-a-light-on-one-of-chinas-hidden-hacking-groups/
  - https://twitter.com/SBousseaden/status/1207671369963646976
logsource:
    category: process_creation
    product: windows
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
detection:
    condition: selection
    selection:
        CommandLine|contains:
          - checkadmin.exe 127.0.0.1 -all
          - netsh advfirewall firewall add rule name=powershell dir=in
          - cmd /c powershell.exe -ep bypass -file c:\s.ps1
          - /tn win32times /f
          - create win32times binPath=
          - \c$\windows\system32\devmgr.dll
          - ' -exec bypass -enc JgAg'
          - type *keepass\KeePass.config.xml
          - iie.exe iie.txt
          - reg query HKEY_CURRENT_USER\Software\\*\PuTTY\Sessions\
falsepositives: Administrators that use checkadmin.exe tool to enumerate local administrators
level: high
customer: 'demo'
modified: 2022/10/09
tags:
  - attack.discovery
  - attack.t1012
  - attack.defense_evasion
  - attack.t1036.004
  - attack.t1027
  - attack.execution
  - attack.t1053.005
  - attack.t1059.001
  - detection.emerging_threats
  - DEMO
