
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-07 01:36
# Generated for User: demo
# Number of Rules: 3139
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potential Dropper Script Execution Via WScript/CScript
id: cea72823-df4d-4567-950c-0b579eaf0846
related:
  - type: similar
    id: 1e33157c-53b1-41ad-bbcc-780b80b58288
status: experimental
description: Detects wscript/cscript executions of scripts located in user directories
author: Margaritis Dimitrios (idea), Florian Roth (Nextron Systems), oscd.community,
    Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/01/16 20:20:01
references:
  - https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
  - https://redcanary.com/blog/gootloader/
logsource:
    category: process_creation
    product: windows
detection:
    condition: all of selection_*
    selection_exec:
        Image|endswith:
          - \wscript.exe
          - \cscript.exe
    selection_ext:
        CommandLine|contains:
          - .js
          - .jse
          - .vba
          - .vbe
          - .vbs
          - .wsf
    selection_paths:
        CommandLine|contains:
          - :\Temp\
          - :\Tmp\
          - :\Users\Public\
          - :\Windows\Temp\
          - \AppData\Local\Temp\
falsepositives: Some installers might generate a similar behavior. An initial baseline
    is required
level: medium
customer: 'demo'
modified: 2024/01/30
tags:
  - attack.execution
  - attack.t1059.005
  - attack.t1059.007
  - DEMO
