
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: DNS Query for Anonfiles.com Domain - DNS Client
id: 29f171d7-aa47-42c7-9c7b-3c87938164d9
related:
  - type: similar
    id: 065cceea-77ec-4030-9052-fc0affea7110
status: test
description: Detects DNS queries for anonfiles.com, which is an anonymous file upload
    platform often used for malicious purposes
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/01/16 17:21:11
references:
  - https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
logsource:
    product: windows
    service: dns-client
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
        Log must be enabled/collected in order to receive the events.'
detection:
    condition: selection
    selection:
        EventID: "3008"
        QueryName|contains: .anonfiles.com
falsepositives: Rare legitimate access to anonfiles.com
level: high
customer: 'demo'
tags:
  - attack.exfiltration
  - attack.t1567.002
  - DEMO
