
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious PowerShell Invocations - Specific - PowerShell Module
id: 8ff28fdd-e2fa-4dfa-aeda-ef3d61c62090
related:
  - type: obsoletes
    id: fce5f582-cc00-41e1-941a-c6fabf0fdb8c
  - type: similar
    id: ae7fbf8e-f3cb-49fd-8db4-5f3bed522c71
  - type: similar
    id: 536e2947-3729-478c-9903-745aaffe60d2
status: test
description: Detects suspicious PowerShell invocation command parameters
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2017/03/05 22:46:01
references:
  - Internal Research
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    condition: 1 of selection_* and not 1 of filter_*
    filter_chocolatey:
        ContextInfo|contains:
          - (New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1
          - Write-ChocolateyWarning
    selection_convert_b64:
        ContextInfo|contains|all:
          - -nop
          - ' -w '
          - hidden
          - ' -c '
          - '[Convert]::FromBase64String'
    selection_enc:
        ContextInfo|contains|all:
          - ' -w '
          - hidden
          - -ep
          - bypass
          - -Enc
    selection_iex:
        ContextInfo|contains|all:
          - ' -w '
          - hidden
          - -noni
          - -nop
          - ' -c '
          - iex
          - New-Object
    selection_iex_webclient:
        ContextInfo|contains|all:
          - iex
          - New-Object
          - Net.WebClient
          - .Download
    selection_reg:
        ContextInfo|contains|all:
          - powershell
          - reg
          - add
          - HKCU\software\microsoft\windows\currentversion\run
    selection_webclient:
        ContextInfo|contains|all:
          - bypass
          - -noprofile
          - -windowstyle
          - hidden
          - new-object
          - system.net.webclient
          - .download
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2023/01/05
tags:
  - attack.execution
  - attack.t1059.001
  - DEMO
