
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Clear PowerShell History - PowerShell Module
id: f99276ad-d122-4989-a09a-d00904a5f9d2
related:
  - type: derived
    id: dfba4ce1-e0ea-495f-986e-97140f31af2d
status: test
description: Detects keywords that could indicate clearing PowerShell history
author: Ilyas Ochkov, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/25 17:26:21
references:
  - https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    condition: 1 of selection_payload_* or all of selection_1*
    selection_1a_payload:
        Payload|contains:
          - del
          - Remove-Item
          - rm
    selection_1b_payload:
        Payload|contains: (Get-PSReadlineOption).HistorySavePath
    selection_payload_2:
        Payload|contains|all:
          - Set-PSReadlineOption
          - –HistorySaveStyle
          - SaveNothing
    selection_payload_3:
        Payload|contains|all:
          - Set-PSReadlineOption
          - -HistorySaveStyle
          - SaveNothing
falsepositives: Legitimate PowerShell scripts
level: medium
customer: 'demo'
modified: 2022/12/02
tags:
  - attack.defense_evasion
  - attack.t1070.003
  - DEMO
