
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Get Local Groups Information
id: cef24b90-dddc-4ae1-a09a-8764872f69fc
status: test
description: |
    Adversaries may attempt to find local system groups and permission settings.
    The knowledge of local system permission groups can help adversaries determine which groups exist and which users belong to a particular group.
    Adversaries may use this information to determine which users have elevated permissions, such as the users found within the local administrators group.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/12 16:30:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md
logsource:
    category: ps_module
    product: windows
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    condition: 1 of test_*
    test_3:
      - Payload|contains:
          - get-localgroup
          - Get-LocalGroupMember
      - ContextInfo|contains:
          - get-localgroup
          - Get-LocalGroupMember
    test_6:
      - Payload|contains|all:
          - Get-WMIObject
          - Win32_Group
      - ContextInfo|contains|all:
          - Get-WMIObject
          - Win32_Group
falsepositives: Administrator script
level: low
customer: 'demo'
modified: 2022/12/25
tags:
  - attack.discovery
  - attack.t1069.001
  - DEMO
