
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Communication To Ngrok Tunneling Service Initiated
id: 1d08ac94-400d-4469-a82f-daee9a908849
related:
  - type: similar
    id: 18249279-932f-45e2-b37a-8925f2597670
status: test
description: |
    Detects an executable initiating a network connection to "ngrok" tunneling domains.
    Attackers were seen using this "ngrok" in order to store their second stage payloads and malware.
    While communication with such domains can be legitimate, often times is a sign of either data exfiltration by malicious actors or additional download.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/11/03 19:24:21
references:
  - https://twitter.com/hakluke/status/1587733971814977537/photo/1
  - https://ngrok.com/docs/secure-tunnels/tunnels/ssh-reverse-tunnel-agent
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection
    selection:
        DestinationHostname|contains:
          - tunnel.us.ngrok.com
          - tunnel.eu.ngrok.com
          - tunnel.ap.ngrok.com
          - tunnel.au.ngrok.com
          - tunnel.sa.ngrok.com
          - tunnel.jp.ngrok.com
          - tunnel.in.ngrok.com
falsepositives: Legitimate use of the ngrok service.
level: high
customer: 'demo'
modified: 2024/02/02
tags:
  - attack.exfiltration
  - attack.command_and_control
  - attack.t1567
  - attack.t1568.002
  - attack.t1572
  - attack.t1090
  - attack.t1102
  - attack.s0508
  - DEMO
