
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Microsoft Binary Suspicious Communication Endpoint
id: e0f8ab85-0ac9-423b-a73a-81b3c7b1aa97
related:
  - type: obsoletes
    id: 635dbb88-67b3-4b41-9ea5-a3af2dd88153
status: test
description: Detects executables located in potentially suspicious directories initiating
    network connections towards file sharing domains.
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2018/08/30 19:48:11
references:
  - https://twitter.com/M_haggis/status/900741347035889665
  - https://twitter.com/M_haggis/status/1032799638213066752
  - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
  - https://www.cisa.gov/uscert/ncas/alerts/aa22-321a
  - https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/exfil/Invoke-ExfilDataToGitHub.ps1
logsource:
    category: network_connection
    product: windows
detection:
    condition: all of selection_*
    selection_domains:
        DestinationHostname|endswith:
          - .githubusercontent.com
          - anonfiles.com
          - cdn.discordapp.com
          - cdn.discordapp.com/attachments/
          - ddns.net
          - dl.dropboxusercontent.com
          - ghostbin.co
          - glitch.me
          - gofile.io
          - hastebin.com
          - mediafire.com
          - mega.co.nz
          - mega.nz
          - onrender.com
          - paste.ee
          - pastebin.com
          - pastebin.pl
          - pastetext.net
          - privatlab.com
          - privatlab.net
          - send.exploit.in
          - sendspace.com
          - storage.googleapis.com
          - storjshare.io
          - supabase.co
          - temp.sh
          - transfer.sh
          - ufile.io
        Initiated: "true"
    selection_paths:
        Image|contains:
          - :\PerfLogs\
          - :\Temp\
          - :\Users\Public\
          - :\Windows\System32\Tasks\
          - :\Windows\Tasks\
          - :\Windows\Temp\
          - \AppData\Temp\
falsepositives: Some installers located in the temp directory might communicate with
    the Github domains in order to download additional software. Baseline these cases
    or move the github domain to a lower level hunting rule.
level: high
customer: 'demo'
modified: 2024/02/09
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
