
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Outbound RDP Connections Over Non-Standard Tools
id: ed74fe75-7594-4b4b-ae38-e38e3fd2eb23
status: test
description: |
    Detects Non-Standard tools initiating a connection over port 3389 indicating possible lateral movement.
    An initial baseline is required before using this utility to exclude third party RDP tooling that you might use.
author: Markus Neis
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/05/15 18:29:11
references:
  - https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2019-0708
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_mstsc:
        Image:
          - C:\Windows\System32\mstsc.exe
          - C:\Windows\SysWOW64\mstsc.exe
    filter_optional_avast:
        Image|endswith:
          - \Avast Software\Avast\AvastSvc.exe
          - \Avast\AvastSvc.exe
    filter_optional_chrome:
        Image: C:\Program Files\Google\Chrome\Application\chrome.exe
    filter_optional_dns:
        Image: C:\Windows\System32\dns.exe
        Protocol: udp
        SourcePort: "53"
    filter_optional_empty:
        Image: ""
    filter_optional_firefox:
        Image: C:\Program Files\Mozilla Firefox\firefox.exe
    filter_optional_null:
        Image: []
    filter_optional_sentinel_one:
        Image|endswith: \Ranger\SentinelRanger.exe
    filter_optional_splunk:
        Image|startswith: C:\Program Files\SplunkUniversalForwarder\bin\
    filter_optional_sysinternals_rdcman:
        Image|endswith: \RDCMan.exe
    filter_optional_third_party:
        Image|endswith:
          - \FSAssessment.exe
          - \FSDiscovery.exe
          - \MobaRTE.exe
          - \mRemote.exe
          - \mRemoteNG.exe
          - \Passwordstate.exe
          - \RemoteDesktopManager.exe
          - \RemoteDesktopManager64.exe
          - \RemoteDesktopManagerFree.exe
          - \RSSensor.exe
          - \RTS2App.exe
          - \RTSApp.exe
          - \spiceworks-finder.exe
          - \Terminals.exe
          - \ws_TunnelService.exe
    filter_optional_thor:
        Image|endswith:
          - \thor.exe
          - \thor64.exe
    filter_optional_tsplus:
        Image:
          - C:\Program Files\TSplus\Java\bin\HTML5service.exe
          - C:\Program Files (x86)\TSplus\Java\bin\HTML5service.exe
    filter_optional_unknown:
        Image: <unknown process>
    selection:
        DestinationPort: "3389"
        Initiated: "true"
falsepositives: Third party RDP tools
level: high
customer: 'demo'
modified: 2024/02/09
tags:
  - attack.lateral_movement
  - attack.t1021.001
  - car.2013-07-002
  - DEMO
