
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Outbound SMTP Connections
id: 9976fa64-2804-423c-8a5b-646ade840773
status: test
description: |
    Adversaries may steal data by exfiltrating it over an un-encrypted network protocol other than that of the existing command and control channel.
    The data may also be sent to an alternate network location from the main command and control server.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/01/07 15:43:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1048.003/T1048.003.md#atomic-test-5---exfiltration-over-alternative-protocol---smtp
  - https://www.ietf.org/rfc/rfc2821.txt
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection and not 1 of filter_*
    filter_clients:
        Image|endswith:
          - \thunderbird.exe
          - \outlook.exe
    filter_mailserver:
        Image|startswith: C:\Program Files\Microsoft\Exchange Server\
    filter_outlook:
        Image|endswith: \HxTsr.exe
        Image|startswith: C:\Program Files\WindowsApps\microsoft.windowscommunicationsapps_
    selection:
        DestinationPort:
          - "25"
          - "587"
          - "465"
          - "2525"
        Initiated: "true"
falsepositives: Other SMTP tools
level: medium
customer: 'demo'
modified: 2022/09/21
tags:
  - attack.exfiltration
  - attack.t1048.003
  - DEMO
