
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Dropbox API Usage
id: 25eabf56-22f0-4915-a1ed-056b8dae0a68
status: test
description: Detects an executable that isn't dropbox but communicates with the Dropbox
    API
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/20 13:18:01
references:
  - https://app.any.run/tasks/7e906adc-9d11-447f-8641-5f40375ecebb
  - https://www.zscaler.com/blogs/security-research/new-espionage-attack-molerats-apt-targeting-users-middle-east
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection and not filter
    filter:
        Image|contains: \Dropbox
    selection:
        DestinationHostname|endswith:
          - api.dropboxapi.com
          - content.dropboxapi.com
        Initiated: "true"
falsepositives: Legitimate use of the API with a tool that the author wasn't aware
    of
level: high
customer: 'demo'
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
