
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Script Initiated Connection
id: 08249dc0-a28d-4555-8ba5-9255a198e08c
status: test
description: Detects a script interpreter wscript/cscript opening a network connection.
    Adversaries may use script to download malicious payloads.
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/28 13:22:41
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith:
          - \wscript.exe
          - \cscript.exe
        Initiated: "true"
falsepositives: Legitimate scripts
level: medium
customer: 'demo'
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
