
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Script Initiated Connection to Non-Local Network
id: 992a6cae-db6a-43c8-9cec-76d7195c96fc
status: test
description: Detects a script interpreter wscript/cscript opening a network connection
    to a non-local network. Adversaries may use script to download malicious payloads.
author: frack113, Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/28 18:40:01
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_local_ranges:
        DestinationIp|cidr:
          - 127.0.0.0/8
          - 10.0.0.0/8
          - 172.16.0.0/12
          - 192.168.0.0/16
          - 169.254.0.0/16
          - ::1/128
          - fe80::/10
          - fc00::/7
    filter_main_ms_ranges:
        DestinationIp|cidr: 20.0.0.0/11
    selection:
        Image|endswith:
          - \wscript.exe
          - \cscript.exe
        Initiated: "true"
falsepositives: Legitimate scripts
level: high
customer: 'demo'
modified: 2024/03/13
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
