
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Silenttrinity Stager Msbuild Activity
id: 50e54b8d-ad73-43f8-96a1-5191685b17a4
status: test
description: Detects a possible remote connections to Silenttrinity c2
author: Kiran kumar s, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/10/11 16:14:11
references:
  - https://www.blackhillsinfosec.com/my-first-joyride-with-silenttrinity/
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection and filter
    filter:
        DestinationPort:
          - "80"
          - "443"
        Initiated: "true"
    selection:
        Image|endswith: \msbuild.exe
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/10/05
tags:
  - attack.execution
  - attack.t1127.001
  - DEMO
