
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Uncommon Outbound Kerberos Connection
id: e54979bd-c5f9-4d6c-967b-a04b19ac4c74
related:
  - type: similar
    id: eca91c7c-9214-47b9-b4c5-cb1d7e4f2350
status: test
description: |
    Detects uncommon outbound network activity via Kerberos default port indicating possible lateral movement or first stage PrivEsc via delegation.
author: Ilyas Ochkov, oscd.community
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2019/10/24 16:09:31
references:
  - https://github.com/GhostPack/Rubeus
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    filter_main_lsass:
        Image: C:\Windows\System32\lsass.exe
    filter_optional_chrome:
        Image:
          - C:\Program Files (x86)\Google\Chrome\Application\chrome.exe
          - C:\Program Files\Google\Chrome\Application\chrome.exe
    filter_optional_firefox:
        Image:
          - C:\Program Files (x86)\Mozilla Firefox\firefox.exe
          - C:\Program Files\Mozilla Firefox\firefox.exe
    filter_optional_tomcat:
        Image|endswith: \tomcat\bin\tomcat8.exe
    selection:
        DestinationPort: "88"
        Initiated: "true"
falsepositives: Web Browsers and third party application might generate similar activity.
    An initial baseline is required.
level: medium
customer: 'demo'
modified: 2024/03/15
tags:
  - attack.credential_access
  - attack.t1558
  - attack.lateral_movement
  - attack.t1550.003
  - DEMO
