
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-06-21 19:00
# Generated for User: demo
# Number of Rules: 3228
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Network Connection Initiated To Cloudflared Tunnels Domains
id: 7cd1dcdc-6edf-4896-86dc-d1f19ad64903
related:
  - type: derived
    id: a1d9eec5-33b2-4177-8d24-27fe754d0812
status: experimental
description: |
    Detects network connections to Cloudflared tunnels domains initiated by a process on the system.
    Attackers can abuse that feature to establish a reverse shell or persistence on a machine.
author: Kamran Saifullah, Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/05/27 21:46:51
references:
  - https://defr0ggy.github.io/research/Abusing-Cloudflared-A-Proxy-Service-To-Host-Share-Applications/
  - https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
  - Internal Research
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection
    selection:
        DestinationHostname|endswith:
          - .v2.argotunnel.com
          - protocol-v2.argotunnel.com
          - trycloudflare.com
          - update.argotunnel.com
        Initiated: "true"
falsepositives: Legitimate use of cloudflare tunnels will also trigger this.
level: medium
customer: 'demo'
tags:
  - attack.exfiltration
  - attack.command_and_control
  - attack.t1567.001
  - DEMO
