
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Equation Editor Network Connection
id: a66bc059-c370-472c-a0d7-f8fd1bf9d583
status: test
description: Detects network connections from Equation Editor
author: Max Altgelt (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/14 15:15:51
references:
  - https://twitter.com/forensicitguy/status/1513538712986079238
  - https://news.sophos.com/en-us/2019/07/18/a-new-equation-editor-exploit-goes-commercial-as-maldoc-attacks-using-it-spike/
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection
    selection:
        Image|endswith: \eqnedt32.exe
falsepositives: Unlikely
level: high
customer: 'demo'
tags:
  - attack.execution
  - attack.t1203
  - DEMO
