
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: RDP to HTTP or HTTPS Target Ports
id: b1e5da3b-ca8e-4adf-915c-9921f3d85481
status: test
description: Detects svchost hosting RDP termsvcs communicating to target systems
    on TCP port 80 or 443
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/04/29 13:38:01
references:
  - https://twitter.com/tekdefense/status/1519711183162556416?s=12&t=OTsHCBkQOTNs1k3USz65Zg
  - https://www.mandiant.com/resources/bypassing-network-restrictions-through-rdp-tunneling
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection
    selection:
        DestinationPort:
          - "80"
          - "443"
        Image|endswith: \svchost.exe
        Initiated: "true"
        SourcePort: "3389"
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/07/14
tags:
  - attack.command_and_control
  - attack.t1572
  - attack.lateral_movement
  - attack.t1021.001
  - car.2013-07-002
  - DEMO
