
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Potentially Suspicious Network Connection To Notion API
id: 7e9cf7b6-e827-11ed-a05b-15959c120003
status: test
description: Detects a non-browser process communicating with the Notion API. This
    could indicate potential use of a covert C2 channel such as "OffensiveNotion C2"
author: Gavin Knapp
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/03 20:39:01
references:
  - https://github.com/mttaggart/OffensiveNotion
  - https://medium.com/@huskyhacks.mk/we-put-a-c2-in-your-notetaking-app-offensivenotion-3e933bace332
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_brave:
        Image|endswith: \brave.exe
    filter_main_chrome:
        Image:
          - C:\Program Files\Google\Chrome\Application\chrome.exe
          - C:\Program Files (x86)\Google\Chrome\Application\chrome.exe
    filter_main_edge_1:
      - Image|startswith: C:\Program Files (x86)\Microsoft\EdgeWebView\Application\
      - Image|endswith: \WindowsApps\MicrosoftEdge.exe
      - Image:
          - C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe
          - C:\Program Files\Microsoft\Edge\Application\msedge.exe
    filter_main_edge_2:
        Image|endswith:
          - \msedge.exe
          - \msedgewebview2.exe
        Image|startswith:
          - C:\Program Files (x86)\Microsoft\EdgeCore\
          - C:\Program Files\Microsoft\EdgeCore\
    filter_main_firefox:
        Image:
          - C:\Program Files\Mozilla Firefox\firefox.exe
          - C:\Program Files (x86)\Mozilla Firefox\firefox.exe
    filter_main_ie:
        Image:
          - C:\Program Files (x86)\Internet Explorer\iexplore.exe
          - C:\Program Files\Internet Explorer\iexplore.exe
    filter_main_maxthon:
        Image|endswith: \maxthon.exe
    filter_main_notion:
        Image|endswith: \AppData\Local\Programs\Notion\Notion.exe
    filter_main_opera:
        Image|endswith: \opera.exe
    filter_main_safari:
        Image|endswith: \safari.exe
    filter_main_seamonkey:
        Image|endswith: \seamonkey.exe
    filter_main_vivaldi:
        Image|endswith: \vivaldi.exe
    filter_main_whale:
        Image|endswith: \whale.exe
    selection:
        DestinationHostname|contains: api.notion.com
falsepositives: Legitimate applications communicating with the "api.notion.com" endpoint
    that are not already in the exclusion list. The desktop and browser applications
    do not appear to be using the API by default unless integrations are configured.
level: low
customer: 'demo'
tags:
  - attack.command_and_control
  - attack.t1102
  - DEMO
