
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Process Initiated Network  Connection To Ngrok Domain
id: 18249279-932f-45e2-b37a-8925f2597670
related:
  - type: similar
    id: 1d08ac94-400d-4469-a82f-daee9a908849
status: test
description: |
    Detects an executable initiating a network connection to "ngrok" domains.
    Attackers were seen using this "ngrok" in order to store their second stage payloads and malware.
    While communication with such domains can be legitimate, often times is a sign of either data exfiltration by malicious actors or additional download.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/07/16 19:49:21
references:
  - https://ngrok.com/
  - https://ngrok.com/blog-post/new-ngrok-domains
  - https://www.virustotal.com/gui/file/cca0c1182ac114b44dc52dd2058fcd38611c20bb6b5ad84710681d38212f835a/
  - https://www.rnbo.gov.ua/files/2023_YEAR/CYBERCENTER/november/APT29%20attacks%20Embassies%20using%20CVE-2023-38831%20-%20report%20en.pdf
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection
    selection:
        DestinationHostname|endswith:
          - .ngrok-free.app
          - .ngrok-free.dev
          - .ngrok.app
          - .ngrok.dev
          - .ngrok.io
        Initiated: "true"
falsepositives: Legitimate use of the ngrok service.
level: high
customer: 'demo'
modified: 2023/11/17
tags:
  - attack.exfiltration
  - attack.t1567.001
  - DEMO
