
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Dllhost.EXE Initiated Network Connection To Non-Local IP Address
id: cfed2f44-16df-4bf3-833a-79405198b277
status: test
description: |
    Detects dllhost initiating a network connection to a non-local IP address.
    Aside from Microsoft own IP range that needs to be excluded. Network communication from Dllhost will depend entirely on the hosted DLL.
    An initial baseline is recommended before deployment.
author: bartblaze
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2020/07/13 22:11:21
references:
  - https://redcanary.com/blog/child-processes/
  - https://nasbench.medium.com/what-is-the-dllhost-exe-process-actually-running-ef9fe4c19c08
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_local_ranges:
        DestinationIp|cidr:
          - ::1/128
          - 10.0.0.0/8
          - 127.0.0.0/8
          - 172.16.0.0/12
          - 192.168.0.0/16
          - 169.254.0.0/16
          - fc00::/7
          - fe80::/10
    filter_main_msrange:
        DestinationIp|cidr:
          - 20.184.0.0/13
          - 20.192.0.0/10
          - 23.72.0.0/13
          - 51.10.0.0/15
          - 51.103.0.0/16
          - 51.104.0.0/15
          - 52.224.0.0/11
          - 204.79.197.0/24
    selection:
        Image|endswith: \dllhost.exe
        Initiated: "true"
falsepositives: Communication to other corporate systems that use IP addresses from
    public address spaces
level: medium
customer: 'demo'
modified: 2024/03/12
tags:
  - attack.defense_evasion
  - attack.t1218
  - attack.execution
  - attack.t1559.001
  - DEMO
