
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Connection Initiated Via Certutil.EXE
id: 0dba975d-a193-4ed1-a067-424df57570d1
status: test
description: |
    Detects a network connection initiated by the certutil.exe utility.
    Attackers can abuse the utility in order to download malware or additional payloads.
author: frack113, Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/09/02 15:37:11
references:
  - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection
    selection:
        DestinationPort:
          - "80"
          - "135"
          - "443"
          - "445"
        Image|endswith: \certutil.exe
        Initiated: "true"
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/10/04
tags:
  - attack.command_and_control
  - attack.t1105
  - DEMO
