
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Network Connection Initiated To Mega.nz
id: fdeebdf0-9f3f-4d08-84a6-4c4d13e39fe4
status: test
description: |
    Detects a network connection initiated by a binary to "api.mega.co.nz".
    Attackers were seen abusing file sharing websites similar to "mega.nz" in order to upload/download additional payloads.
author: Florian Roth (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2021/12/06 16:14:41
references:
  - https://megatools.megous.com/
  - https://www.mandiant.com/resources/russian-targeting-gov-business
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection
    selection:
        DestinationHostname|endswith:
          - mega.co.nz
          - mega.nz
        Initiated: "true"
falsepositives: Legitimate MEGA installers and utilities are expected to communicate
    with this domain. Exclude hosts that are known to be allowed to use this tool.
level: medium
customer: 'demo'
modified: 2024/02/01
tags:
  - attack.exfiltration
  - attack.t1567.001
  - DEMO
