
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Suspicious Non-Browser Network Communication With Google API
id: 7e9cf7b6-e827-11ed-a05b-0242ac120003
status: experimental
description: |
    Detects a non-browser process interacting with the Google API which could indicate the use of a covert C2 such as Google Sheet C2 (GC2-sheet)
author: Gavin Knapp
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/05/01 21:50:21
references:
  - https://github.com/looCiprian/GC2-sheet
  - https://youtu.be/n2dFlSaBBKo
  - https://services.google.com/fh/files/blogs/gcat_threathorizons_full_apr2023.pdf
  - https://www.tanium.com/blog/apt41-deploys-google-gc2-for-attacks-cyber-threat-intelligence-roundup/
  - https://www.bleepingcomputer.com/news/security/hackers-abuse-google-command-and-control-red-team-tool-in-attacks/
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection and not 1 of filter_optional_*
    filter_optional_brave:
        Image|endswith: \brave.exe
    filter_optional_chrome:
        Image|endswith:
          - :\Program Files\Google\Chrome\Application\chrome.exe
          - :\Program Files (x86)\Google\Chrome\Application\chrome.exe
    filter_optional_edge_1:
      - Image|contains: :\Program Files (x86)\Microsoft\EdgeWebView\Application\
      - Image|endswith:
          - :\Program Files (x86)\Microsoft\Edge\Application\msedge.exe
          - :\Program Files\Microsoft\Edge\Application\msedge.exe
          - \WindowsApps\MicrosoftEdge.exe
    filter_optional_edge_2:
        Image|contains:
          - :\Program Files (x86)\Microsoft\EdgeCore\
          - :\Program Files\Microsoft\EdgeCore\
        Image|endswith:
          - \msedge.exe
          - \msedgewebview2.exe
    filter_optional_firefox:
        Image|endswith:
          - :\Program Files\Mozilla Firefox\firefox.exe
          - :\Program Files (x86)\Mozilla Firefox\firefox.exe
    filter_optional_google_drive:
        Image|contains: :\Program Files\Google\Drive File Stream\
        Image|endswith: \GoogleDriveFS.exe
    filter_optional_googleupdate:
        Image|endswith: \GoogleUpdate.exe
    filter_optional_ie:
        Image|endswith:
          - :\Program Files (x86)\Internet Explorer\iexplore.exe
          - :\Program Files\Internet Explorer\iexplore.exe
    filter_optional_maxthon:
        Image|endswith: \maxthon.exe
    filter_optional_opera:
        Image|endswith: \opera.exe
    filter_optional_outlook.exe:
        Image|endswith: \outlook.exe
    filter_optional_safari:
        Image|endswith: \safari.exe
    filter_optional_seamonkey:
        Image|endswith: \seamonkey.exe
    filter_optional_teams:
        Image|endswith: \teams.exe
    filter_optional_vivaldi:
        Image|endswith: \vivaldi.exe
    filter_optional_whale:
        Image|endswith: \whale.exe
    selection:
        DestinationHostname|contains:
          - drive.googleapis.com
          - oauth2.googleapis.com
          - sheets.googleapis.com
          - www.googleapis.com
falsepositives: Legitimate applications communicating with the "googleapis.com" endpoints
    that are not already in the exclusion list. This is environmental dependent and
    requires further testing and tuning.
level: medium
customer: 'demo'
modified: 2023/11/03
tags:
  - attack.command_and_control
  - attack.t1102
  - DEMO
