
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-06-21 19:00
# Generated for User: demo
# Number of Rules: 3228
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: RegAsm.EXE Initiating Network Connection To Public IP
id: 0531e43a-d77d-47c2-b89f-5fe50321c805
status: experimental
description: Detects "RegAsm.exe" initiating a network connection to public IP adresses
author: frack113
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2024/04/25 19:23:21
references:
  - https://app.any.run/tasks/ec207948-4916-47eb-a0f4-4c6abb2e7668/
  - https://research.splunk.com/endpoint/07921114-6db4-4e2e-ae58-3ea8a52ae93f/
  - https://lolbas-project.github.io/lolbas/Binaries/Regasm/
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_local_ranges:
        DestinationIp|cidr:
          - 127.0.0.0/8
          - 10.0.0.0/8
          - 172.16.0.0/12
          - 192.168.0.0/16
          - 169.254.0.0/16
          - ::1/128
          - fe80::/10
          - fc00::/7
    selection:
        Image|endswith: \regasm.exe
        Initiated: "true"
falsepositives: Unknown
level: medium
customer: 'demo'
tags:
  - attack.defense_evasion
  - attack.t1218.009
  - DEMO
