
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Outbound Network Connection To Public IP Via Winlogon
id: 7610a4ea-c06d-495f-a2ac-0a696abcfd3b
status: test
description: Detects a "winlogon.exe" process that initiate network communications
    with public IP addresses
author: Christopher Peacock @securepeacock, SCYTHE @scythe_io
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2023/04/28 19:44:21
references:
  - https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
logsource:
    category: network_connection
    product: windows
detection:
    condition: selection and not 1 of filter_main_*
    filter_main_local_ranges:
        DestinationIp|cidr:
          - 127.0.0.0/8
          - 10.0.0.0/8
          - 172.16.0.0/12
          - 192.168.0.0/16
          - 169.254.0.0/16
          - ::1/128
          - fe80::/10
          - fc00::/7
    selection:
        Image|endswith: \winlogon.exe
        Initiated: "true"
falsepositives: Communication to other corporate systems that use IP addresses from
    public address spaces
level: medium
customer: 'demo'
modified: 2024/03/12
tags:
  - attack.defense_evasion
  - attack.execution
  - attack.command_and_control
  - attack.t1218.011
  - DEMO
