
# VALHALLA SIGMA RULE SET - DEMO
# Retrieved: 2024-03-26 18:48
# Generated for User: demo
# Number of Rules: 3189
# Warning:
#     The full rule set contains rules with low level (< high) 
#     that can lead to false positives - use the Python
#     module valhallaAPI tools to retrieve a filtered set
# This is the VALHALLA demo rule set. The content represents the 'SigmaHQ' repository
# in a streamlined format.
# All rules are licensed under DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md.
title: Unsigned Binary Loaded From Suspicious Location
id: 8289bf8c-4aca-4f5a-9db3-dc3d7afe5c10
status: test
description: Detects Code Integrity (CI) engine blocking processes from loading unsigned
    DLLs residing in suspicious locations
author: Nasreddine Bencherchali (Nextron Systems)
license: 'DRL 1.1 https://github.com/SigmaHQ/sigma/blob/master/LICENSE.Detection.Rules.md'
date: 2022/08/03 18:29:11
references:
  - https://github.com/nasbench/EVTX-ETW-Resources/blob/45fd5be71a51aa518b1b36d4e1f36af498084e27/ETWEventsList/CSV/Windows11/21H2/W11_21H2_Pro_20220719_22000.795/Providers/Microsoft-Windows-Security-Mitigations.csv
logsource:
    product: windows
    service: security-mitigations
detection:
    condition: selection
    selection:
        EventID:
          - "11"
          - "12"
        ImageName|contains:
          - \Users\Public\
          - \PerfLogs\
          - \Desktop\
          - \Downloads\
          - \AppData\Local\Temp\
          - C:\Windows\TEMP\
falsepositives: Unknown
level: high
customer: 'demo'
modified: 2022/09/28
tags:
  - attack.defense_evasion
  - attack.t1574.002
  - DEMO
